[
  {
    "scrape_time": "2024-11-19T22:40:28.544951",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Programador/a .NET MOM",
        "company": "NUNSYS",
        "location": "Aranda de Duero, Castilla and Leon, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "9 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Descripción\n\n¿Te apasiona la tecnología? ¿Quieres desarrollarte en una empresa dinámica y en constante crecimiento? ¡Te estamos buscando! En  Nunsys Group  estamos ampliando nuestro equipo, buscamos un/a  Programador/a .NET MOM  para incorporarse en nuestra delegación de  Aranda de Duero, Valencia o Sevilla.\n\nNuestro viaje empezó en 2007 y tenemos una meta: ser la empresa española líder en tecnología. Nos apasiona la transformación digital y contamos con un gran portfolio de soluciones tecnológicas. Gracias a esto garantizamos que podemos afrontar cualquier reto que nos planteen nuestros clientes.\n\nActualmente somos más de 2.600 profesionales y tenemos presencia en 25 ciudades españolas, Portugal, USA, Colombia y Ecuador. ¡Y esto es solo el principio!\n\nEl proyecto ¿en qué consiste? El día a día es muy variado, pero algunas de las funciones en las que participarás son:\n\n      -Participarás en proyectos nacionales e internacionales en empresas lideres del sector Food&Beverage como desarrollador de aplicaciones para soluciones MOM como LIMS , PDM y R&D.\n-Formarás parte de un equipo de alto conocimiento y se desarrollarás como profesional en la interpretación de necesidades de nuestros clientes y en aplicar las solucione necesarias para obtener los objetivos deseados para cada proyecto.\n-Las soluciones que desarrollarás tendrán aplicaciones en la formulación de nuevos productos, en la gestion de la calidad y los laboratorios de las empresas y en la gestion de proyectos globales.\n-Formarás parte de un equipo con metodología Agile y SCRUM.\n\n\n\n\nRequisitos\n\n🌟 ¿Qué estamos buscando?\n\n      -Buscamos personas con una gran capacidad de organización y una metodología de trabajo impecable, en este equipo todos/as sumamos.\n-En Nunsys Group el compañerismo es esencial. Nos apoyamos mutuamente para superar cualquier desafío y alcanzar nuestros objetivos en equipo.  \n-Tener una mínima experiencia en el desarrollo de aplicaciones informáticas con el framework .NET o similar .  \n-Conocer las estructuras básicas y funciones de bases de datos SQL.\n-Manejo de estructuras XML y JSON.\n-Tener grado superior como desarrollador de aplicaciones informáticas.\n\n\n\n\nSi tienes experiencia en el puesto y quieres formar parte de nuestro equipo ¡vamos por el buen camino!\n\n🔝 ¿Algo más con lo que aportar valor?  \n\nEs necesario leer y entender Inglés para la documentación y las formaciones que se imparten por parte de nuestro proveedor de software.\n\n¿Nos eliges? Con nosotros encontrarás:\n\n💼 Contrato indefinido en una empresa líder en el sector\n\n💰 Paquete retributivo competitivo acorde a los conocimientos y experiencia aportados\n\n🌴 Jornada intensiva los meses de julio y agosto y todos los viernes del año.\n\n📚En nuestro equipo creemos en las personas y en su talento, por eso apostamos por la formación de nuestros profesionales.\n\n💳Posibilidad de acogerte al programa de retribución flexible: Ticket Guardería, Ticket restaurante, Tarjeta transporte y Seguro Médico.\n\n🤑Descuentos en distintos establecimientos, productos (electrodomésticos, moda, tecnología) y servicios (viajes, alquiler de vehículos, salud).\n\n💗 Un ambiente diverso y sobre todo inclusivo donde lo primero son las personas.\n\n🎉 ¡No todo es trabajo, también hay tiempo para la diversión! Tenemos diferentes eventos a lo largo del año, desde nuestro \"Christmas Jumper Day\" hasta nuestro concurso de disfraces en Halloween, siempre buscamos formas de crear un ambiente divertido.\n\n¡Y muchas más cosas que queremos que conozcas!\n\n¿Quieres unirte a nosotros/as y ser parte del cambio?\n\nQueremos informar a todo interesado/a en nuestras ofertas de empleo que las únicas ofertas vigentes están publicadas en nuestra página web  <a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/portal-de-talento/\" data-test-app-aware-link=\"\">https://empleo.nunsys.com/</a></em>  o  </em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/unete-al-equipo/\" data-test-app-aware-link=\"\">https://www.sothis.tech/unete-al-equipo/</a></em>,  </em>no debiendo confiar en portales que simplemente se limitan a agregar la información de nuestras ofertas con objeto recabar sus datos personales.\n\nLocalización (Híbrido)",
        "skills": [
          "SQL"
        ]
      },
      {
        "title": "Java Developer for IAM Team - SCIB Málaga",
        "company": "Santander Corporate & Investment Banking",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "74 people clicked apply",
        "salary": "",
        "posted": "Reposted 3 days ago",
        "description": "Country: Spain\n\nSCIB CISO is looking for a Junior Java Developer  for IAM Team  based in our Málaga office.\n\nWHY YOU SHOULD CONSIDER THIS OPPORTUNITY\n\nSantander Corporate & Investment Banking (SCIB)  is Santander's global division that supports some of the world's most complex and sophisticated corporate and institutional clients, offering customized services and value-added wholesale products to best meet their needs.\n\nWe embrace a strong risk culture and all of our professionals at all levels are expected to take a proactive and responsible approach toward risk management.\n\nSantander is proud of being an organization where there are equal opportunities regardless of gender identity, culture and disability. Our mission is to contribute to help more people and business prosper.\n\nWhat You Will Be Doing\n\nAs a  Java Developer, you will be part of the team that develops, maintains an evolves an in-house IAM Software that helps managing the Authorization of several other applications used both by employees and SCIB Clients. You will be both developing new software and new infrastructure as well as maintaining the existing one and assisting on the configuration of the engine needed to service every app.\n\nWe need someone like you to help us in different fronts:\n\n      -Design and Develop new functionalities for the Authorization Engine.  \n-Deploy, Manage and Maintain the core software and its infrastructure.  \n-Explore, Design and develop new pieces of software that connect our IAM Authorization Software to new technologies.  \n-Configure the Authorization Model designed to manage the applications onboarded in our Software.  \n-Assist the “Integration & Discovery” teams during the design of the Authorization Model.  \n-Help complying with Audit and SCIB’s internal security requirements.  \n-Assist during stress tests, Disaster Recoveries and other test.  \n\n\n\nExperience\n\n      -2- years of experience in development teams.  \n\n\n\nEDUCATION\n\n      -Graduate/Licentiate/Master in Computer Science, Telecommunications Engineering, or similar education.  \n\n\n\nSkills & Knowledge\n\n      -Experience in development teams using Java (microservices architecture, APIs), Spring Boot, Maven, Spring Batch, Spring Cloud Stream, Javascript, SQL & Oracle databases, Framework testing (Postman).  \n-Continuous Integration Experience: Github, Jenkins.  \n-APIs knowledge (REST & Open API, software design patterns).  \n-Cloud Computing Infrastructure Knowledge (PaaS, Openshift, Kubernetes, Docker).  \n-Agile Tools Experience: Kanban, Jira, Confluence.  \n-B2 English and fluency Spanish.  \n\n\n\nOther Information\n\nOther knowledge in cybersecurity will be valued:\n\n      -DevSecOps skill (Secure Software Development Life Cycle, Security in DevOps Processes etc.)\n-Cybersecurity knowledge and certification\n\n\n\nIf you want to know more about us, follow us on:  \n\n</em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.linkedin.com/company/santander-corporate-investment-banking/\" data-test-app-aware-link=\"\">https://www.linkedin.com/company/santander-corporate-investment-banking/\n\n</a></em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://es.linkedin.com/company/banco-santander\" data-test-app-aware-link=\"\">https://es.linkedin.com/company/banco-santander\n\n</a></em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.betechwithsantander.com/en/home\" data-test-app-aware-link=\"\">https://www.betechwithsantander.com/en/home\n\n</a></em>#SCIB",
        "skills": [
          "Java",
          "Spring",
          "SQL",
          "Oracle",
          "Jenkins",
          "Kubernetes"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      }
    ],
    "companies_data": [
      {
        "title": "Mediacore Solutions",
        "website": "http://mediacore.es",
        "industry": "Advertising Services",
        "company_size": "11-50 employees",
        "headquarters": null,
        "founded": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "specialties": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "description": "Mediacore Solutions is a cutting-edge digital consultancy specializing in integrating advanced technologies such as artificial intelligence to deliver measurable business outcomes. Focused on enhancing efficiency and innovation, they provide tailored solutions that blend top-tier digital talent, strategic planning, and the latest tech tools. With a diverse team of over 40 professionals across six nationalities, they excel in creating impactful digital strategies for a wide range of industries. Their expertise spans digital development, dynamic branding, and performance marketing, making them a valuable partner in driving business growth through innovation."
      },
      {
        "title": "NUNSYS",
        "website": "http://nunsys.com",
        "industry": "IT Services and IT Consulting",
        "company_size": "1K-5K employees",
        "headquarters": null,
        "founded": "Business Intelligence, Industria 4.0, Comunicaciones, Sistemas, Ciberseguridad, Big Data, Smart Cities, Servicios Gestionados de Impresión y Contenidos, Data center, comunicaciones unificadas, audiovisuales, pantallas led, and formación tecnológica",
        "specialties": "Business Intelligence, Industria 4.0, Comunicaciones, Sistemas, Ciberseguridad, Big Data, Smart Cities, Servicios Gestionados de Impresión y Contenidos, Data center, comunicaciones unificadas, audiovisuales, pantallas led, and formación tecnológica",
        "description": "NUNSYS es una empresa especializada en la Implantación de Soluciones Integrales de Tecnología. Realiza proyectos de Comunicaciones (es operadora de telecomunicaciones con red propia registrada en la C.M.T.), Sistemas, Networking y Software, dirigidos tanto a empresas privadas como a entidades públicas"
      },
      {
        "title": "Santander Corporate & Investment Banking",
        "website": "https://www.santandercib.com",
        "industry": "Financial Services",
        "company_size": "10K+ employees",
        "headquarters": null,
        "founded": "10,001+ employees",
        "specialties": null,
        "description": "Santander Corporate & Investment Banking (SCIB) is Santander’s global division that supports corporate and institutional clients, offering tailored services and value-added wholesale products suited to their complexity and sophistication. SCIB’s aim is to be the best bank for its clients in Latin American and Europe, with solid business hubs in the US and Asia.\n\nBanco Santander is a leading retail and commercial bank, founded in 1857 and headquartered in Spain. It has a meaningful market share in 10 core markets in Europe and the Americas, and is the largest bank in the euro zone by market capitalization. At the end of June 2018, Banco Santander had EUR 981 billion in customer funds (deposits and mutual funds), 140 million customers, 13,500 branches and 200,000 employees. Banco Santander made attributable profit of EUR 3,752 million in the first half of 2018, an increase of 4% compared to the same period last year"
      },
      {
        "title": "M47 Labs - Your AI Partner",
        "website": "http://www.m47labs.com",
        "industry": "IT Services and IT Consulting",
        "company_size": "51-200 employees",
        "headquarters": null,
        "founded": "Barcelona, Spain",
        "specialties": null,
        "description": "Because we understand humans and machines a like, we advance Natural Language Processing (NLP) to impact and drive innovation in your organization by automating complex processes while gaining effective business insights."
      },
      {
        "title": "UST",
        "website": "http://www.ust.com",
        "industry": "IT Services and IT Consulting",
        "company_size": "10K+ employees",
        "headquarters": null,
        "founded": "Digital Solutions, Platforms, Engineering, R&D, and Products",
        "specialties": "Digital Solutions, Platforms, Engineering, R&D, and Products",
        "description": "UST is a global digital transformation solutions provider. For more than 20 years, UST has worked side by side with the world’s best companies to make a real impact through transformation. Powered by technology, inspired by people and led by purpose, UST partners with their clients from design to operation. With deep domain expertise and a future-proof philosophy, UST embeds innovation and agility into their clients’ organizations. With over 30K+ employees in 30+ countries, UST builds for boundless impact—touching billions of lives in the process."
      }
    ]
  },
  {
    "scrape_time": "2024-11-19T22:44:36.202363",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      }
    ],
    "companies_data": [
      {
        "title": "Mediacore Solutions",
        "website": "http://mediacore.es",
        "industry": "Advertising Services",
        "company_size": "11-50 employees",
        "headquarters": null,
        "founded": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "specialties": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "description": "Mediacore Solutions is a cutting-edge digital consultancy specializing in integrating advanced technologies such as artificial intelligence to deliver measurable business outcomes. Focused on enhancing efficiency and innovation, they provide tailored solutions that blend top-tier digital talent, strategic planning, and the latest tech tools. With a diverse team of over 40 professionals across six nationalities, they excel in creating impactful digital strategies for a wide range of industries. Their expertise spans digital development, dynamic branding, and performance marketing, making them a valuable partner in driving business growth through innovation."
      },
      {
        "title": "M47 Labs - Your AI Partner",
        "website": "http://www.m47labs.com",
        "industry": "IT Services and IT Consulting",
        "company_size": "51-200 employees",
        "headquarters": null,
        "founded": "Barcelona, Spain",
        "specialties": null,
        "description": "Because we understand humans and machines a like, we advance Natural Language Processing (NLP) to impact and drive innovation in your organization by automating complex processes while gaining effective business insights."
      },
      {
        "title": "UST",
        "website": "http://www.ust.com",
        "industry": "IT Services and IT Consulting",
        "company_size": "10K+ employees",
        "headquarters": null,
        "founded": "Digital Solutions, Platforms, Engineering, R&D, and Products",
        "specialties": "Digital Solutions, Platforms, Engineering, R&D, and Products",
        "description": "UST is a global digital transformation solutions provider. For more than 20 years, UST has worked side by side with the world’s best companies to make a real impact through transformation. Powered by technology, inspired by people and led by purpose, UST partners with their clients from design to operation. With deep domain expertise and a future-proof philosophy, UST embeds innovation and agility into their clients’ organizations. With over 30K+ employees in 30+ countries, UST builds for boundless impact—touching billions of lives in the process."
      }
    ]
  },
  {
    "scrape_time": "2024-11-19T22:49:35.483490",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-19T22:54:16.919267",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Programador/a .NET MOM",
        "company": "NUNSYS",
        "location": "Aranda de Duero, Castilla and Leon, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "9 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Descripción\n\n¿Te apasiona la tecnología? ¿Quieres desarrollarte en una empresa dinámica y en constante crecimiento? ¡Te estamos buscando! En  Nunsys Group  estamos ampliando nuestro equipo, buscamos un/a  Programador/a .NET MOM  para incorporarse en nuestra delegación de  Aranda de Duero, Valencia o Sevilla.\n\nNuestro viaje empezó en 2007 y tenemos una meta: ser la empresa española líder en tecnología. Nos apasiona la transformación digital y contamos con un gran portfolio de soluciones tecnológicas. Gracias a esto garantizamos que podemos afrontar cualquier reto que nos planteen nuestros clientes.\n\nActualmente somos más de 2.600 profesionales y tenemos presencia en 25 ciudades españolas, Portugal, USA, Colombia y Ecuador. ¡Y esto es solo el principio!\n\nEl proyecto ¿en qué consiste? El día a día es muy variado, pero algunas de las funciones en las que participarás son:\n\n      -Participarás en proyectos nacionales e internacionales en empresas lideres del sector Food&Beverage como desarrollador de aplicaciones para soluciones MOM como LIMS , PDM y R&D.\n-Formarás parte de un equipo de alto conocimiento y se desarrollarás como profesional en la interpretación de necesidades de nuestros clientes y en aplicar las solucione necesarias para obtener los objetivos deseados para cada proyecto.\n-Las soluciones que desarrollarás tendrán aplicaciones en la formulación de nuevos productos, en la gestion de la calidad y los laboratorios de las empresas y en la gestion de proyectos globales.\n-Formarás parte de un equipo con metodología Agile y SCRUM.\n\n\n\n\nRequisitos\n\n🌟 ¿Qué estamos buscando?\n\n      -Buscamos personas con una gran capacidad de organización y una metodología de trabajo impecable, en este equipo todos/as sumamos.\n-En Nunsys Group el compañerismo es esencial. Nos apoyamos mutuamente para superar cualquier desafío y alcanzar nuestros objetivos en equipo.  \n-Tener una mínima experiencia en el desarrollo de aplicaciones informáticas con el framework .NET o similar .  \n-Conocer las estructuras básicas y funciones de bases de datos SQL.\n-Manejo de estructuras XML y JSON.\n-Tener grado superior como desarrollador de aplicaciones informáticas.\n\n\n\n\nSi tienes experiencia en el puesto y quieres formar parte de nuestro equipo ¡vamos por el buen camino!\n\n🔝 ¿Algo más con lo que aportar valor?  \n\nEs necesario leer y entender Inglés para la documentación y las formaciones que se imparten por parte de nuestro proveedor de software.\n\n¿Nos eliges? Con nosotros encontrarás:\n\n💼 Contrato indefinido en una empresa líder en el sector\n\n💰 Paquete retributivo competitivo acorde a los conocimientos y experiencia aportados\n\n🌴 Jornada intensiva los meses de julio y agosto y todos los viernes del año.\n\n📚En nuestro equipo creemos en las personas y en su talento, por eso apostamos por la formación de nuestros profesionales.\n\n💳Posibilidad de acogerte al programa de retribución flexible: Ticket Guardería, Ticket restaurante, Tarjeta transporte y Seguro Médico.\n\n🤑Descuentos en distintos establecimientos, productos (electrodomésticos, moda, tecnología) y servicios (viajes, alquiler de vehículos, salud).\n\n💗 Un ambiente diverso y sobre todo inclusivo donde lo primero son las personas.\n\n🎉 ¡No todo es trabajo, también hay tiempo para la diversión! Tenemos diferentes eventos a lo largo del año, desde nuestro \"Christmas Jumper Day\" hasta nuestro concurso de disfraces en Halloween, siempre buscamos formas de crear un ambiente divertido.\n\n¡Y muchas más cosas que queremos que conozcas!\n\n¿Quieres unirte a nosotros/as y ser parte del cambio?\n\nQueremos informar a todo interesado/a en nuestras ofertas de empleo que las únicas ofertas vigentes están publicadas en nuestra página web  <a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/portal-de-talento/\" data-test-app-aware-link=\"\">https://empleo.nunsys.com/</a></em>  o  </em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/unete-al-equipo/\" data-test-app-aware-link=\"\">https://www.sothis.tech/unete-al-equipo/</a></em>,  </em>no debiendo confiar en portales que simplemente se limitan a agregar la información de nuestras ofertas con objeto recabar sus datos personales.\n\nLocalización (Híbrido)",
        "skills": [
          "SQL"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-19T22:58:17.376273",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Programador/a .NET MOM",
        "company": "NUNSYS",
        "location": "Aranda de Duero, Castilla and Leon, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "9 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Descripción\n\n¿Te apasiona la tecnología? ¿Quieres desarrollarte en una empresa dinámica y en constante crecimiento? ¡Te estamos buscando! En  Nunsys Group  estamos ampliando nuestro equipo, buscamos un/a  Programador/a .NET MOM  para incorporarse en nuestra delegación de  Aranda de Duero, Valencia o Sevilla.\n\nNuestro viaje empezó en 2007 y tenemos una meta: ser la empresa española líder en tecnología. Nos apasiona la transformación digital y contamos con un gran portfolio de soluciones tecnológicas. Gracias a esto garantizamos que podemos afrontar cualquier reto que nos planteen nuestros clientes.\n\nActualmente somos más de 2.600 profesionales y tenemos presencia en 25 ciudades españolas, Portugal, USA, Colombia y Ecuador. ¡Y esto es solo el principio!\n\nEl proyecto ¿en qué consiste? El día a día es muy variado, pero algunas de las funciones en las que participarás son:\n\n      -Participarás en proyectos nacionales e internacionales en empresas lideres del sector Food&Beverage como desarrollador de aplicaciones para soluciones MOM como LIMS , PDM y R&D.\n-Formarás parte de un equipo de alto conocimiento y se desarrollarás como profesional en la interpretación de necesidades de nuestros clientes y en aplicar las solucione necesarias para obtener los objetivos deseados para cada proyecto.\n-Las soluciones que desarrollarás tendrán aplicaciones en la formulación de nuevos productos, en la gestion de la calidad y los laboratorios de las empresas y en la gestion de proyectos globales.\n-Formarás parte de un equipo con metodología Agile y SCRUM.\n\n\n\n\nRequisitos\n\n🌟 ¿Qué estamos buscando?\n\n      -Buscamos personas con una gran capacidad de organización y una metodología de trabajo impecable, en este equipo todos/as sumamos.\n-En Nunsys Group el compañerismo es esencial. Nos apoyamos mutuamente para superar cualquier desafío y alcanzar nuestros objetivos en equipo.  \n-Tener una mínima experiencia en el desarrollo de aplicaciones informáticas con el framework .NET o similar .  \n-Conocer las estructuras básicas y funciones de bases de datos SQL.\n-Manejo de estructuras XML y JSON.\n-Tener grado superior como desarrollador de aplicaciones informáticas.\n\n\n\n\nSi tienes experiencia en el puesto y quieres formar parte de nuestro equipo ¡vamos por el buen camino!\n\n🔝 ¿Algo más con lo que aportar valor?  \n\nEs necesario leer y entender Inglés para la documentación y las formaciones que se imparten por parte de nuestro proveedor de software.\n\n¿Nos eliges? Con nosotros encontrarás:\n\n💼 Contrato indefinido en una empresa líder en el sector\n\n💰 Paquete retributivo competitivo acorde a los conocimientos y experiencia aportados\n\n🌴 Jornada intensiva los meses de julio y agosto y todos los viernes del año.\n\n📚En nuestro equipo creemos en las personas y en su talento, por eso apostamos por la formación de nuestros profesionales.\n\n💳Posibilidad de acogerte al programa de retribución flexible: Ticket Guardería, Ticket restaurante, Tarjeta transporte y Seguro Médico.\n\n🤑Descuentos en distintos establecimientos, productos (electrodomésticos, moda, tecnología) y servicios (viajes, alquiler de vehículos, salud).\n\n💗 Un ambiente diverso y sobre todo inclusivo donde lo primero son las personas.\n\n🎉 ¡No todo es trabajo, también hay tiempo para la diversión! Tenemos diferentes eventos a lo largo del año, desde nuestro \"Christmas Jumper Day\" hasta nuestro concurso de disfraces en Halloween, siempre buscamos formas de crear un ambiente divertido.\n\n¡Y muchas más cosas que queremos que conozcas!\n\n¿Quieres unirte a nosotros/as y ser parte del cambio?\n\nQueremos informar a todo interesado/a en nuestras ofertas de empleo que las únicas ofertas vigentes están publicadas en nuestra página web  <a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/portal-de-talento/\" data-test-app-aware-link=\"\">https://empleo.nunsys.com/</a></em>  o  </em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/unete-al-equipo/\" data-test-app-aware-link=\"\">https://www.sothis.tech/unete-al-equipo/</a></em>,  </em>no debiendo confiar en portales que simplemente se limitan a agregar la información de nuestras ofertas con objeto recabar sus datos personales.\n\nLocalización (Híbrido)",
        "skills": [
          "SQL"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-19T23:08:25.651568",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry-level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "Power Platform Developer Internship",
        "company": "Zurich Insurance",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "Hybrid",
        "job_type": "Internship",
        "level": null,
        "applicants": "50 people clicked apply",
        "salary": "",
        "posted": "Reposted 5 days ago",
        "description": "Our opportunity\n\nLife is too short to just tick the box. Reimagine the box with Zurich!  \n\nWe are looking for an Intern PowerApps developer who possesses a passion to learn about to create and improve useful applications for our users, will work with our team of talented engineers to design and build the next generation of our web & mobile applications.\n\nDuring this experience not only you will learn and boost your career but also you will build relationships and have fun with teams all over the world!\n\nWith us you will have a real opportunity to make a difference and be part of the team!\n\nYour role\n\nAs an Intern Power Platform/FullStack Developer you will have opportunity to:  \n\n      -Development focused on Power Apps, C#, NET and Angular.\n-Collaborating with cross-functional teams to design and ship new features.\n-Analyze the customer needs and design, document, test, and develop software as required to satisfy the functional and non-requirements.\n-Acquire technical expertise on aspects of the organization´s IT infrastructure / software applications / architecture / hardware to internal customers, advise them of appropriate actions to fulfill procedural and regulatory requirements or solve immediate problems.\n-Help on production issues.\n-Collaborate with the team, working always in Agile methodology.\n-Completes agreed work within established estimates and communicates status and issues promptly.\n\n\n\nYour Skills And Experience\n\nWe would like to give this opportunity to somebody who is:\n\n      -Active student status with Spanish University/School is mandatory  \n-University student interested in developing career in tech field  \n-Looking for at least 6 months part-time/internship program  \n-Tech savvy approach  \n-An enthusiastic, capable, curious person craving to learn  \n-A good team player with responsible and can-do attitude  \n-Currently pursuing a Bachelor's or Master's degree in Computer Science, Engineering, Physics, Mathematics, or a related field\n-Fluent in English, Spanish or Catalan\n-Basic knowledge of any programming language (preferred C# .NET or Angular).\n\n\n\nNice to have:\n\n      -Any other frameworks, programming languages or Rest API services  \n-PowerApps/Power Platform knowledge\n-PowerBI knowledge\n-Testing experience (Unit Testing or SIT/UAT functional testing)\n\n\n\nAdditional Information\n\nWe offer benefits such as:\n\n      -Paid Internship  \n-Option to work remotely within Spain  \n-Up to 30 hours weekly with Flexible schedule  \n-LinkedIn and internal training opportunities  \n-Special discounts on different brands and products & great banking and insurance conditions.  \n-Welcome pack that includes amazing gadgets.  \n-A cool workspace with gaming, gym, and fun area!  \n-A variety of clubs for you to get to know your colleagues and have fun, e.g. hiking, skiing, reading and many others!  \n-Free coffee and fruit at the office.  \n\n\n\nPrimary work location is Barcelona Poblenou.\n\nDoes it look like you have found your future job? Don’t wait anymore and apply sending your CV in English!\n\nWho We Are\n\nLooking for a challenging and inspiring work environment where you can make a difference? At Zurich millions of individuals and businesses place their trust in our products and services every day. Our 53,000 employees worldwide form the basis of our success, enabling, businesses and communities to face a world of risk with confidence. Imagine if you could help people do this all over the world. You’d give them confidence and reassurance by protecting what they love most. It’s a big challenge, but you will be supported by a world-class team who believe in helping you to reach your full potential and deliver on our promises.\n\nDiversity & Inclusion\n\nAt Zurich we are an equal opportunity employer. We attract and retain the best qualified individuals available, without regard to race/ethnicity, religion, gender, sexual orientation, age or disability.\n\nSo be challenged. Be inspired. Help us make a difference.\n\n</em>You are the heart & soul of Zurich!  \n\nAt Zurich, we like to think outside the box and challenge the status quo. We take an optimistic approach by focusing on the positives and constantly asking What can go right?\n\nWe highly value the experience and know-how of our employees and offer a wide range of opportunities across business areas to encourage you to apply for new opportunities within Zurich when you are ready for your next career step.\n\nLet’s continue to grow together!\n\n      -Location(s): ES - Barcelona  \n-Remote working:  \n-Schedule: Part Time\n-Recruiter name: Alba Marin Sola",
        "skills": [
          "C#",
          "Angular"
        ]
      },
      {
        "title": "Rev-celerator Graduate Programme: Backend Java Software Engineer",
        "company": "Revolut",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Internship",
        "level": null,
        "applicants": "83 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "About Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It’s one of the best in the world. And we’re proud of it. It’s our driving force, our engine. From building a new financial backend to creating an innovative app that millions of people around the world will use, there’s nothing (and we mean nothing) our tech team can’t do.\n\nAbout The Rev-Celerator Graduate Programme 🎓\n\nAre you a recent graduate eager to shape the future of finance? Ready to make a meaningful impact and bring innovative ideas to life? Well, the Rev-celerator Graduate Software Engineer programme is designed just for you.\n\nFirst, kick off with a few weeks of bootcamp, where we’ll prepare you to jump into work at Revolut with workshops, lectures, and practical exercises to start developing your skills. After successful preparation, we’ll launch you into on-the-job training where you’ll be face-to-face with tough challenges, problem-solving, and tasks to own.\n\nThe Rev-celerator Graduate programme is now open to international candidates willing to relocate to our tech hubs in Poland, Portugal, and Spain. Get support on visa application (if needed), relocation cost and the first month of accommodation.\n\nWe’re looking for Java Engineers interested in every step, stage, and release of a feature. Want to work alone? This isn’t for you. We want communicators. One minute you’re chatting to a Product Owner, the next a Designer, and then a customer (for feature feedback, we don’t need you on the phones).\n\nLike your projects varied? This is for you. We don’t pigeonhole. We want you to spread your wings to as many places as possible.\n\nUp for the challenge? Let's get in touch 🚀\n\nWhat You’ll Be Doing\n\n      -Collaborating with engineers across various tech stacks\n-Building mobile APIs\n-Developing micro-services to evolve our architecture\n-Optimising existing critical systems that our business depends on, such as Risk Management, Fraud Detection, andPayment Processing\n-Focusing on new greenfield projects and development work.\n\n\n\nWhat You'll Need\n\n      -A 2:1 predicted or achieved grade (or above)\n-To have graduated university in 2023, 2024, or 2025\n-A portfolio of multiple coding side projects or open source contributions\n-Studies of Computer Science, Maths, Physics, or a similar subject\n-A proactive attitude\n-Love for problem-solving\n-Fluency in English\n-Quick learner with an ambitious and results-driven personality\n-Excellent communication and organisational skills\n-To feel comfortable working as part of a team in a fast-paced environment\n-Full-time availability for the programme starting in September 2025\n\n\n\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nRefer to our <a class=\"postings-link\" href=\"<a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" data-test-app-aware-link=\"\">https://www.revolut.com/legal/data-privacy-for-candidates</a>\">Data Privacy Statement for Candidates for details on our data handling practices during your application.</em>",
        "skills": [
          "Java"
        ]
      },
      {
        "title": "Rev-celerator Graduate Programme: Backend Java Software Engineer",
        "company": "Revolut",
        "location": "Spain",
        "workplace": "Remote",
        "job_type": "Internship",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "About Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It’s one of the best in the world. And we’re proud of it. It’s our driving force, our engine. From building a new financial backend to creating an innovative app that millions of people around the world will use, there’s nothing (and we mean nothing) our tech team can’t do.\n\nAbout The Rev-Celerator Graduate Programme 🎓\n\nAre you a recent graduate eager to shape the future of finance? Ready to make a meaningful impact and bring innovative ideas to life? Well, the Rev-celerator Graduate Software Engineer programme is designed just for you.\n\nFirst, kick off with a few weeks of bootcamp, where we’ll prepare you to jump into work at Revolut with workshops, lectures, and practical exercises to start developing your skills. After successful preparation, we’ll launch you into on-the-job training where you’ll be face-to-face with tough challenges, problem-solving, and tasks to own.\n\nThe Rev-celerator Graduate programme is now open to international candidates willing to relocate to our tech hubs in Poland, Portugal, and Spain. Get support on visa application (if needed), relocation cost and the first month of accommodation.\n\nWe’re looking for Java Engineers interested in every step, stage, and release of a feature. Want to work alone? This isn’t for you. We want communicators. One minute you’re chatting to a Product Owner, the next a Designer, and then a customer (for feature feedback, we don’t need you on the phones).\n\nLike your projects varied? This is for you. We don’t pigeonhole. We want you to spread your wings to as many places as possible.\n\nUp for the challenge? Let's get in touch 🚀\n\nWhat You’ll Be Doing\n\n      -Collaborating with engineers across various tech stacks\n-Building mobile APIs\n-Developing micro-services to evolve our architecture\n-Optimising existing critical systems that our business depends on, such as Risk Management, Fraud Detection, andPayment Processing\n-Focusing on new greenfield projects and development work.\n\n\n\nWhat You'll Need\n\n      -A 2:1 predicted or achieved grade (or above)\n-To have graduated university in 2023, 2024, or 2025\n-A portfolio of multiple coding side projects or open source contributions\n-Studies of Computer Science, Maths, Physics, or a similar subject\n-A proactive attitude\n-Love for problem-solving\n-Fluency in English\n-Quick learner with an ambitious and results-driven personality\n-Excellent communication and organisational skills\n-To feel comfortable working as part of a team in a fast-paced environment\n-Full-time availability for the programme starting in September 2025\n\n\n\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nRefer to our <a class=\"postings-link\" href=\"<a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" data-test-app-aware-link=\"\">https://www.revolut.com/legal/data-privacy-for-candidates</a>\">Data Privacy Statement for Candidates for details on our data handling practices during your application.\n\n</em>",
        "skills": [
          "Java"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-19T23:17:05.956001",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry-level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "Rev-celerator Graduate Programme: Backend Java Software Engineer",
        "company": "Revolut",
        "location": "Spain",
        "workplace": "Remote",
        "job_type": "Internship",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "About Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It’s one of the best in the world. And we’re proud of it. It’s our driving force, our engine. From building a new financial backend to creating an innovative app that millions of people around the world will use, there’s nothing (and we mean nothing) our tech team can’t do.\n\nAbout The Rev-Celerator Graduate Programme 🎓\n\nAre you a recent graduate eager to shape the future of finance? Ready to make a meaningful impact and bring innovative ideas to life? Well, the Rev-celerator Graduate Software Engineer programme is designed just for you.\n\nFirst, kick off with a few weeks of bootcamp, where we’ll prepare you to jump into work at Revolut with workshops, lectures, and practical exercises to start developing your skills. After successful preparation, we’ll launch you into on-the-job training where you’ll be face-to-face with tough challenges, problem-solving, and tasks to own.\n\nThe Rev-celerator Graduate programme is now open to international candidates willing to relocate to our tech hubs in Poland, Portugal, and Spain. Get support on visa application (if needed), relocation cost and the first month of accommodation.\n\nWe’re looking for Java Engineers interested in every step, stage, and release of a feature. Want to work alone? This isn’t for you. We want communicators. One minute you’re chatting to a Product Owner, the next a Designer, and then a customer (for feature feedback, we don’t need you on the phones).\n\nLike your projects varied? This is for you. We don’t pigeonhole. We want you to spread your wings to as many places as possible.\n\nUp for the challenge? Let's get in touch 🚀\n\nWhat You’ll Be Doing\n\n      -Collaborating with engineers across various tech stacks\n-Building mobile APIs\n-Developing micro-services to evolve our architecture\n-Optimising existing critical systems that our business depends on, such as Risk Management, Fraud Detection, andPayment Processing\n-Focusing on new greenfield projects and development work.\n\n\n\nWhat You'll Need\n\n      -A 2:1 predicted or achieved grade (or above)\n-To have graduated university in 2023, 2024, or 2025\n-A portfolio of multiple coding side projects or open source contributions\n-Studies of Computer Science, Maths, Physics, or a similar subject\n-A proactive attitude\n-Love for problem-solving\n-Fluency in English\n-Quick learner with an ambitious and results-driven personality\n-Excellent communication and organisational skills\n-To feel comfortable working as part of a team in a fast-paced environment\n-Full-time availability for the programme starting in September 2025\n\n\n\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nRefer to our <a class=\"postings-link\" href=\"<a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" data-test-app-aware-link=\"\">https://www.revolut.com/legal/data-privacy-for-candidates</a>\">Data Privacy Statement for Candidates for details on our data handling practices during your application.\n\n</em>",
        "skills": [
          "Java"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-19T23:41:53.920157",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "45",
        "salary": "",
        "posted": "6 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Programador/a .NET MOM",
        "company": "NUNSYS",
        "location": "Aranda de Duero, Castilla and Leon, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "9 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Descripción\n\n¿Te apasiona la tecnología? ¿Quieres desarrollarte en una empresa dinámica y en constante crecimiento? ¡Te estamos buscando! En  Nunsys Group  estamos ampliando nuestro equipo, buscamos un/a  Programador/a .NET MOM  para incorporarse en nuestra delegación de  Aranda de Duero, Valencia o Sevilla.\n\nNuestro viaje empezó en 2007 y tenemos una meta: ser la empresa española líder en tecnología. Nos apasiona la transformación digital y contamos con un gran portfolio de soluciones tecnológicas. Gracias a esto garantizamos que podemos afrontar cualquier reto que nos planteen nuestros clientes.\n\nActualmente somos más de 2.600 profesionales y tenemos presencia en 25 ciudades españolas, Portugal, USA, Colombia y Ecuador. ¡Y esto es solo el principio!\n\nEl proyecto ¿en qué consiste? El día a día es muy variado, pero algunas de las funciones en las que participarás son:\n\n      -Participarás en proyectos nacionales e internacionales en empresas lideres del sector Food&Beverage como desarrollador de aplicaciones para soluciones MOM como LIMS , PDM y R&D.\n-Formarás parte de un equipo de alto conocimiento y se desarrollarás como profesional en la interpretación de necesidades de nuestros clientes y en aplicar las solucione necesarias para obtener los objetivos deseados para cada proyecto.\n-Las soluciones que desarrollarás tendrán aplicaciones en la formulación de nuevos productos, en la gestion de la calidad y los laboratorios de las empresas y en la gestion de proyectos globales.\n-Formarás parte de un equipo con metodología Agile y SCRUM.\n\n\n\n\nRequisitos\n\n🌟 ¿Qué estamos buscando?\n\n      -Buscamos personas con una gran capacidad de organización y una metodología de trabajo impecable, en este equipo todos/as sumamos.\n-En Nunsys Group el compañerismo es esencial. Nos apoyamos mutuamente para superar cualquier desafío y alcanzar nuestros objetivos en equipo.  \n-Tener una mínima experiencia en el desarrollo de aplicaciones informáticas con el framework .NET o similar .  \n-Conocer las estructuras básicas y funciones de bases de datos SQL.\n-Manejo de estructuras XML y JSON.\n-Tener grado superior como desarrollador de aplicaciones informáticas.\n\n\n\n\nSi tienes experiencia en el puesto y quieres formar parte de nuestro equipo ¡vamos por el buen camino!\n\n🔝 ¿Algo más con lo que aportar valor?  \n\nEs necesario leer y entender Inglés para la documentación y las formaciones que se imparten por parte de nuestro proveedor de software.\n\n¿Nos eliges? Con nosotros encontrarás:\n\n💼 Contrato indefinido en una empresa líder en el sector\n\n💰 Paquete retributivo competitivo acorde a los conocimientos y experiencia aportados\n\n🌴 Jornada intensiva los meses de julio y agosto y todos los viernes del año.\n\n📚En nuestro equipo creemos en las personas y en su talento, por eso apostamos por la formación de nuestros profesionales.\n\n💳Posibilidad de acogerte al programa de retribución flexible: Ticket Guardería, Ticket restaurante, Tarjeta transporte y Seguro Médico.\n\n🤑Descuentos en distintos establecimientos, productos (electrodomésticos, moda, tecnología) y servicios (viajes, alquiler de vehículos, salud).\n\n💗 Un ambiente diverso y sobre todo inclusivo donde lo primero son las personas.\n\n🎉 ¡No todo es trabajo, también hay tiempo para la diversión! Tenemos diferentes eventos a lo largo del año, desde nuestro \"Christmas Jumper Day\" hasta nuestro concurso de disfraces en Halloween, siempre buscamos formas de crear un ambiente divertido.\n\n¡Y muchas más cosas que queremos que conozcas!\n\n¿Quieres unirte a nosotros/as y ser parte del cambio?\n\nQueremos informar a todo interesado/a en nuestras ofertas de empleo que las únicas ofertas vigentes están publicadas en nuestra página web  <a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/portal-de-talento/\" data-test-app-aware-link=\"\">https://empleo.nunsys.com/</a></em>  o  </em><a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.sothis.tech/unete-al-equipo/\" data-test-app-aware-link=\"\">https://www.sothis.tech/unete-al-equipo/</a></em>,  </em>no debiendo confiar en portales que simplemente se limitan a agregar la información de nuestras ofertas con objeto recabar sus datos personales.\n\nLocalización (Híbrido)",
        "skills": [
          "SQL"
        ]
      },
      {
        "title": "Software QA Engineer - Native in Dutch (Belgium)",
        "company": "M47 Labs - Your AI Partner",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "0 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "About Us\n\nM47 Labs is an AI Engineering company focused on providing businesses with the latest and most advanced Artificial Intelligence solutions. Our deep expertise in AI Language Technologies, including NLP and LLMs, empowers businesses with custom-built cutting-edge solutions. We are dedicated to creating AI-driven applications that can understand, interpret, and respond to human language. Join us in making the future more intelligent.\n\nAbout You\n\nIn line with M47’s exciting growth, we are searching for tech-savvy professionals native in one of the locales listed below and are interested in working with cutting-edge Personal Voice Assistant software used by millions of users worldwide, with one of our major clients.\n\nAbout your day-to-day:\n\n      -Hands-on quality assurance and product testing\n-Investigating and scoping out software bugs.\n-Develop tools and metrics that will help triage software issues and track KPIs.\n-Resolve key quality issues.\n\n\n\n\nWhat is in it for you?\n\n💪🏽 Indefinite full-time contract\n\n☀️ Office located at the heart of Madrid\n\n🚀 Follow your career ambition with growth opportunities (horizontal and vertical)\n\n📚On-demand learning budget and ongoing educational company-wide training of relevant topics of our industry\n\n💸 Comprehensive compensation package, including private medical insurance coverage and flexible remuneration through Cobee including meals, gym pass, transport and kindergarten.\n\n🌈 Be part of our diverse communities and enjoy our meetups (Women in Tech, LGTBQ+, Wellbeing, City Lifestyle...)\n\n🌍 Great international, inclusive and dynamic work environment (more than 20 nationalities!)\n\nWhat you'll need:\n\n      -Native knowledge in Dutch (from Belgium)\n-Sound knowledge in reading and writing code (Ex. Python, Javascript..)\n-Knowledge about E2E testing and SDLC\n-Experience with client-server environments\n-Flexibility to respond and react to changing priorities quickly and efficiently\n-Exceptional analytical, troubleshooting and problem-solving skills\n-Understanding of QA software testing\n-Easiness with learning about new technologies, software, platforms...\n\n\n\n\nWhat's nice to have:\n\n      -Automation testing experience, as well as API testing and other backend services\n-Comfortable working in a Mac environment and experience with Xcode\n-Experience with web services development\n-Familiarity with debugging iOS\n-Experience with GIT or other version control systems\n-Drive for innovation\n-Experience developing test cases and planning a test route\n\n\n\n\nSpecial requirement\n\nFor this position you must be a holder of a valid working permit for Spain (or EU passport) and be available to work full-time onsite.\n\n**M47 Labs not only encourages but is actively working on empowering its diverse and inclusive talent. M47 Labs is committed to ensure a non-discriminative workplace, work life and selection process and such decisions will not be influenced by race, color, religion, gender identity or expression, sexual orientation, disability, social and conjugal status, age or other applicable characteristics. M47 Labs prohibits discrimination and harassment of any kind and all employment is decided on the basis of qualifications, merit, and business needs.**\n\nIn accordance with the provisions of Regulation (EU) 2016/679 of 27 April (GDPR) and the Organic Law 3/2018 of 5 December (LOPDGDD), we inform you that personal data and email addresses collected from the Data Subject will be processed under the responsibility of M47 LABS & INTERNATIONAL FIDUCIA SL for a legitimate interest and for the purpose of sending communications about our products and services and will be retained for as long as none of the parties object. The data will not be communicated to third parties, unless under legal obligation. You can exercise your rights of access, rectification, portability and erasure of your data and those of restriction and objection to their processing by contacting DIPUTACIÓ, 279 3 6 - 08007 BARCELONA (Barcelona). E-mail:info@m47labs.com. If you consider that the processing does not comply with current legislation, you may file a complaint with the Spanish supervisory authority atwww.aepd.es",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "RDA Developer",
        "company": "UST",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "2 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Role Description\n\n¡Seguimos buscando talento…y nos encantaría que te unieras a nuestro equipo!\n\nPara que nos conozcas algo mejor, UST es una multinacional norteamericana certificada como Top Employer y Great Place to Work con más de 35.000 empleados a nivel global y con presencia en más de 35 países. Somos líderes en servicios de tecnología digital y proporcionamos soluciones tecnológicas de gran alcance a grandes compañías.\n\n¿Qué buscamos?\n\nPara nuestro equipo estamos buscando Desarrolladores RDA con al menos 2 años de experiencia para la creación de soluciones de procesos de automatización de extremo a extremo con importante cliente del sector bancario.\n\nFunciones\n\n      -Diseñar y construir flujos de trabajo de los bots\n-Crear actividades para buscar los elementos particulares de la interfaz de usuario y realice operaciones en ellos\n-Realizar operaciones con datos numéricos, texto y bases de datos.\n-Monitorizar y resolver problemas de automatización de procesos, informes de estado, pruebas y resolución de problemas en todas las fases\n-Integración a través de API\n-Realizar pruebas de conceptos para reconocer la viabilidad de una solución automatizada\n-Documentación a través de cambios y lanzamientos\n\n\n\nRequisitos Mínimos\n\n      -Al menos 2 años de RDA\n-Experiencia de desarrollo en back: Java Herramientas Atlassian (Jira, Confluence o Bitbucket)\n-Buenas dotes de comunicación\n\n\n\nRequisitos Deseados\n\n      -Experiencia y/o conocimiento en AutoHotKey\n-Experiencia en desarrollo de soluciones que se han implementado con éxito en infraestructura Cloud (Azure, AWS, Google)\n\n\n\n¿Qué te ofrecemos?\n\n      -23 días laborables de vacaciones y el 24 y 31 de diciembre.\n-Numerosos beneficios sociales (seguro médico, ayuda al teletrabajo, seguro de vida y seguro de accidentes).\n-Programa de Retribución Flexible (tarjeta comida, cheques guardería, tarjeta transporte, clases de inglés online, seguro médico para tu familia…).\n-Acceso gratuito a varias plataformas de formación.\n-Estabilidad y carrera profesional.\n-Tenemos implantado un plan de compensación de referencias internas.\n-Posibilidad de elección de percibir tu salario en 12 o 14 pagas.\n-Medidas de conciliación (horario flexible, teletrabajo, asesoramiento de especialistas (psicólogo, nutricionista, entrenador personal), jornada intensiva los viernes y en verano según proyecto).\n-Plataforma UST Club descuentos y descuentos en gimnasios.\n\n\n\nSi quieres conocer más, no dudes en inscribirte y nos pondremos en contacto contigo para ampliarte información de la posición ¡Te estamos esperando!\n\nEn UST nos comprometemos con la igualdad de oportunidades en nuestros procesos de selección y no realizamos ningún tipo de discriminación por razón de raza, género, discapacidad, edad, religión, orientación sexual o nacionalidad. Estamos comprometidos con la discapacidad y apostamos por la incorporación de personas con certificado de discapacidad.\n\n#UST\n\nSkills\n\nRda,Java,Jira",
        "skills": [
          "Java",
          "AWS"
        ]
      },
      {
        "title": "Backend Software Engineer (JVM + Blockchain)",
        "company": "Revolut",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "77 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "About Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 50+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It's one of the best in the world. And we’re proud of it. It’s our driving force — our engine 🚀\n\nFrom building a new financial backend to creating an innovative app, there’s nothing they can’t do. Our Technology team isn’t here to fix legacy systems — it’s here to build world-class financial features from the ground up that'll be used by millions of people around the world 🌎\n\nWe’re looking for a Blockchain Engineer that wants to change the world. If you like to work at a steady pace with no surprises, keep scrolling. If you want your work to change the global financial landscape, you might be just who we’re looking for. We have a minimalist approach to using external frameworks, with an emphasis on maintainability and fast turnaround with TDD, DDD, and Continuous Integration & Delivery.\n\nWhat You’ll Be Doing\n\n      -Designing and delivering quality blockchain solutions\n-Delivering high-quality testable code\n-Enhancing the team's technical knowledge\n-Collaborating with auditors to ensure code quality and security\n-Working closely with cross-functional teams on product development and integration of blockchain solutions into the company's ecosystem\n-Suggesting and developing features to improve and grow the product\n-Supporting and mentoring junior colleagues\n\n\n\nWhat You'll Need\n\n      -Fluency in Solidity or other similar smart contract languages\n-2+ years of experience in blockchain development\n-Experience in backend development using Java, Scala or Kotlin (JVM environment)\n-Practical experience deploying smart contracts on the mainnet of major blockchains\n-Practical experience in distributed systems with a deep understanding of consensus algorithms\n\n\n\nNice to have\n\n      -Fluency in multiple smart contract languages\n-Experience working with enterprise-grade digital asset infrastructure, such as Fireblocks\n-Contribution to a crypto project with a large market cap\n\n\n\nBuilding a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nRefer to our <a class=\"postings-link\" href=\"<a class=\"kQcMOFNBfpvQJXmmMoTHzFyqvsaVayASkM \" target=\"_blank\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" data-test-app-aware-link=\"\">https://www.revolut.com/legal/data-privacy-for-candidates</a>\">Data Privacy Statement for Candidates for details on our data handling practices during your application.</em>",
        "skills": [
          "Solidity",
          "Java",
          "Scala",
          "Kotlin"
        ]
      }
    ],
    "companies_data": []
  }
]