[
  {
    "scrape_time": "2024-11-18T20:20:14.988517",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "Desarrollador Ruby on Rails",
        "company": "CODILEX",
        "location": "Gijón, Principality of Asturias, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "29",
        "salary": "",
        "posted": "6 days ago",
        "description": "Distribuidora asturiana líder en el sector alimentación, en plena expansión a nivel nacional, necesita contratar de manera urgente programador/a-desarrollador/a con dominio de leguaje  Ruby on Rails</em>  para desarrollo y mantenimiento de ERP de gestión.  \nResponsabilidades-Principales: desarrollo y resolución de incidencias del sistema de gestión de la empresa.\nRequisitos\n-Certificaciones y experiencia demostrable en programación, y específicamente en lenguaje ruby ( desarrollador full-stack ruby on rails)-Trabajo in situ, no remoto-Incorporación inmediata-Proactivo/a, resolutivo/a-Contrato indefinido",
        "skills": [
          "Ruby"
        ]
      },
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "44",
        "salary": "",
        "posted": "5 days ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      }
    ],
    "companies_data": [
      {
        "title": "Mediacore Solutions",
        "website": "http://mediacore.es",
        "industry": "Advertising Services",
        "company_size": "11-50 employees",
        "headquarters": null,
        "founded": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "specialties": "Retargeting, RTB (Real Time Biding), SEM, Analytics y Big Data, Producción Creativa Digital, Social Ads, Adserving y Traficado, Big Data, Compra programática, SEO, Inteligencia Artificial, Ciberseguridad, Consultoría Tecnológica, Consultoría de Negocios y Procesos, Formación In-house, Outsourcing, and Talento",
        "description": "Mediacore Solutions is a cutting-edge digital consultancy specializing in integrating advanced technologies such as artificial intelligence to deliver measurable business outcomes. Focused on enhancing efficiency and innovation, they provide tailored solutions that blend top-tier digital talent, strategic planning, and the latest tech tools. With a diverse team of over 40 professionals across six nationalities, they excel in creating impactful digital strategies for a wide range of industries. Their expertise spans digital development, dynamic branding, and performance marketing, making them a valuable partner in driving business growth through innovation."
      }
    ]
  }
]