[
  {
    "scrape_time": "2024-11-13T15:14:22.168114",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past week"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "Desarrollador de back-end Valencia",
        "company": "Conmuta Soluciones S.L",
        "location": "Paterna, Valencian Community, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "5 days ago",
        "description": "En CONMUTA queremos incorporar a nuestra plantilla un Desarrollador de Back-End para participar en un proyecto estable en el sector de la automoción.\nFormarás parte de un equipo de más de 10 desarrolladores, trabajando en una estructura liderada por el responsable de Desarrollo. Bajo diversas metodologías, tendrás la oportunidad de participar en todas las etapas del proceso y asumir responsabilidades en los proyectos como Tech Lead. Esto incluye la toma de necesidades, diseño de arquitectura, definición, desarrollo, pruebas, mejoras, entre otros.\nEn función de tu experiencia e intereses podrás trabajar en aspectos de implementación de APIs en una arquitectura orientada a servicios o como programador Back-End en contacto con BBDD.\nVisita nuestra web:  www.conmuta.es\nCaracterísticas del puesto      -  Liderar iniciativas propias proponiendo las mejores ideas para que el equipo siga en tecnologías y procesos de desarrollo.\n-  Crear soluciones y construir los proyectos más destacados en estrecha colaboración con el cliente interno.\n-Trabajar en un contexto SCRUM para entregar software funcional y de alta calidad.\n-Jornada completa flexible.\n-Hibrido; teletrabajo 2 días a la semana.\n-Ubicación: Parque tecnológico (Paterna).\n-Salario: 24.000€ a 30.000€ Bruto/año\n\n\nRequisitos      -  Estudios mínimos - Ciclo Formativo Grado Superior - Informática y Comunicaciones\n-Experiencia mínima - 2 años\n-Idiomas - Inglés - Nivel escrito intermedio\n-Conocimiento de algún lenguaje orientado a objetos.\n-Experiencia consumiendo API REST o conocimiento del funcionamiento de REST.\n-Conocimientos de bases de datos SQL.\n\n\nSe valorará      -  Experiencia en desarrollo con C# y .net Core\n-Experiencia en base de datos PostgreSQL\n-Conocimiento de ORM (EntityFramework, dapper,...)\n-Conocimientos sobre arquitectura orientada a Servicios",
        "skills": [
          "SQL",
          "C#",
          "PostgreSQL"
        ]
      },
      {
        "title": "Full Stack Developer",
        "company": "HERCAL DIGGERS S.L.",
        "location": "Terrassa, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "5 days ago",
        "description": "Hercal es una empresa joven cuya actividad principal son los derribos, demoliciones y la ejecución de proyectos de obra civil.Una empresa joven y consciente de que la receta del progreso, consolidación y crecimiento de un proyecto empresarial incluye entre sus ingredientes valores como el esfuerzo, la responsabilidad y la honestidad. Sobre esta base, la competencia y la calidad marcan la diferencia en la consecución del fin último: el trabajo bien hecho, el trato completo, el cliente satisfecho.\nDescripción del puesto:Estamos implementando un proyecto de transformación digital y queremos incorporar un/a Full Stack Developer que lo lidere. La gestión de este proyecto supondrá para quien lo asuma una gran oportunidad de crecimiento profesional.  \nFunciones:      -Desarrollo de soluciones innovadoras: crearás y mantendrás aplicaciones web y móviles que optimicen procesos y mejoren la experiencia de los usuarios.\n-Procesos inteligentes: programarás y gestionarás servicios ETL (Extract, Transform, Load) que transformarán cómo manejamos nuestros datos.\n-Liderazgo técnico: coordinarás a colaboradores externos y supervisarás a proveedores, asegurando la calidad y cumplimiento de los proyectos.\n-Colaboración estratégica: serás una pieza clave en la transformación digital de la empresa, trabajando codo a codo con diferentes equipos.\n\n\nRequisitos técnicos:      -Experiencia en desarrollo móvil: Programación de aplicaciones para Android y iOS, ya sea de forma nativa o con frameworks.\n-Sólidos conocimientos de desarrollo web: Tanto en el backend como en el frontend.\n-Habilidades en ETL: Capacidad para programar y gestionar servicios de extracción, transformación y carga de datos.\n\n\nRequisitos de lenguajes de programación:        -Python, Vue, PHP (Symfony, Twig), HTML, JavaScript y Bootstrap.\n-Bases de datos: MySQL, MariaDB, Percona y Microsoft SQL Server.\n-Sistemas operativos: Windows y distribuciones de GNU/Linux como Ubuntu y Debian.\n-Entornos cloud: Azure de Microsoft y Clouding.io.\n\n\n¿Qué te ofrecemos?      -Contrato indefinido a tiempo completo.\n-Un día de teletrabajo y viernes intensivos alternos.\n-Un ambiente colaborativo y dinámico.\n-Oportunidades de desarrollo y aprendizaje continuo en un entorno que valora la innovación.\n-Salario competitivo acorde a la experiencia y habilidades del candidato/a.\n\n\nSi eres un/a Full Stack Developer apasionado/a por la tecnología y la innovación, ¡te estamos buscando!",
        "skills": [
          "PHP",
          "HTML",
          "JavaScript",
          "MySQL",
          "MariaDB",
          "SQL",
          "Azure"
        ]
      },
      {
        "title": "Desarrollador Ruby on Rails",
        "company": "CODILEX",
        "location": "Gijón, Principality of Asturias, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "8",
        "salary": "",
        "posted": "21 hours ago",
        "description": "Distribuidora asturiana líder en el sector alimentación, en plena expansión a nivel nacional, necesita contratar de manera urgente programador/a-desarrollador/a con dominio de leguaje  Ruby on Rails</em>  para desarrollo y mantenimiento de ERP de gestión.  \nResponsabilidades-Principales: desarrollo y resolución de incidencias del sistema de gestión de la empresa.\nRequisitos\n-Certificaciones y experiencia demostrable en programación, y específicamente en lenguaje ruby ( desarrollador full-stack ruby on rails)-Trabajo in situ, no remoto-Incorporación inmediata-Proactivo/a, resolutivo/a-Contrato indefinido",
        "skills": [
          "Ruby"
        ]
      },
      {
        "title": "Programador full stack PHP - Torrelodones",
        "company": "thexpeople",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "6 days ago",
        "description": "Perfil del Candidato - Desarrollador Full StackUbicación: Torrelodones, con presencialidad requerida de  1-2 días por semana.Buscamos un Desarrollador Full Stack con experiencia en múltiples tecnologías y entornos de desarrollo, para unirse a nuestro equipo y contribuir al desarrollo y mantenimiento de nuestras plataformas digitales. El perfil ideal debe poseer sólidos conocimientos en los siguientes campos:\nLenguajes de Programación y Frontend      -PHP\n-JavaScript\n-CSS\n-HTML\n-Tailwind CSS\n\n\nFrameworks      -Laravel\n-CodeIgniter\n-Vue.JS  (se valorará experiencia en  Angular  o  React)\n\n\nBases de Datos      -MySQL\n\n\nServicios en la Nube      -AWS (Amazon Web Services):\n-EC2\n-RDS\n-CloudFront\n\n\nSeguridad y Control de Versiones      -GitHub  para control de versiones.\n-Conocimientos de  seguridad  en el desarrollo y despliegue de aplicaciones web.\n\n\nHerramientas de Despliegue y Gestión de Proyectos  (deseable)      -Metodologías ágiles como  SCRUM.\n-Experiencia con herramientas como  ClickUp,  Trello, o similares.\n\n\nConfiguración de Servidores y Gestión de Infraestructura      -Servidores de Correo:\n-Zimbra\n-Protocolos de correo:  SMTP,  POP,  IMAP\n-Single Sign-On (SSO):\n-SAML2\n\n\nAdministración de Servidores      -Ubuntu\n-LAMP stack  (Linux, Apache, MySQL, PHP)\n\n\nGestión de Dominios / DNS      -Cloudflare\n\n\nCondiciones      -Salario: hasta  45K, según experiencia.\n-Modalidad: presencial en  Torrelodones, con  1-2 días de trabajo presencial  por semana.\n-Buscamos una persona proactiva, con capacidad de adaptación y buenas habilidades para trabajar en equipo. Se valorará experiencia previa en administración de servidores y gestión de infraestructura, así como en entornos de despliegue continuo.",
        "skills": [
          "CSS",
          "Angular",
          "MySQL"
        ]
      },
      {
        "title": "Desarrollador web",
        "company": "Meteored",
        "location": "Lorca, Región de Murcia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "6 days ago",
        "description": "Meteored (Alpred S.L.) es una empresa innovadora en el top de empresas del ámbito de la meteorología a nivel mundial, en pleno proceso de crecimiento y expansión, en continuo desarrollo y mejora de productos propios, y estamos buscando una nueva incorporación a nuestro equipo de desarrollo.\nQuienes somos:https://www.tiempo.com/sobre-nosotros\nNuestro equipo de desarrollo se encuentra en nuestra sede principal de Almendricos (30893 Lorca). Tenemos partnership con grandes empresas como Google, CloudFlare, etc… Trabajamos con las últimas tecnologías, por lo que el aprendizaje y desarrollo profesional está garantizado.\nInstalaciones / oficinas de Meteored (Video):\nhttps://services.meteored.com/video/media/es_meteored_headquarters.mp4\nBuscamos una persona que se una a nuestro departamento web para trabajar en el mantenimiento y mejora de nuestros portales web en mas de 25 países\nNecesario que tengas:      -Grado Universitario: Ingeniería Informática, Telecomunicaciones, Matemáticas e Informática...\n\n\nSe valorará conocimientos y experiencia en:      -Gestión de Versiones (GIT)\n-HTML5 / CSS3\n-PHP\n-MySQL\n-JavaScript\n-Node JS\n-Elastic\n-Docker / Kubernetes\n\n\n¿Qué condiciones tendrás?      -Contrato indefinido desde el primer momento.\n-Salario inicial: entre 26.500 - 28500 € Brutos / año, en función de la experiencia demostrable.\n-Modelo mixto Presencial / Teletrabajo (2 días oficina / 3 Teletrabajo) tras un periodo de onBoarding de 3 meses full presencial. No ofrecemos 100% teletrabajo.\n-Trabajarás en equipo\n-Tendrás formación\n-Beneficios Sociales\n\n\nContacta con nosotros si estas interesado/a y encajas en lo que buscamos, y te comentamos en detalle todas las condiciones: Horarios, Tipos de jornada, flexibilidad, vacaciones, metodologías, filosofía de trabajo, etc… y buscamos un hueco para enseñarte nuestras oficinas.",
        "skills": [
          "Kubernetes"
        ]
      },
      {
        "title": "Data Engineer on GCP",
        "company": "W3Global",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "13 people clicked apply",
        "salary": "",
        "posted": "4 days ago",
        "description": "Spanish & English professional level speaking candidates\n\nData Engineer on GCP\n\n      -  Design, implement, and manage data pipelines on Google Cloud using Apache Nifi, Dataproc, BigQuery, Dataflow, and other GCP services.\n-  Develop Spark and Hadoop workflows to process large datasets in Dataproc, ensuring data reliability and efficiency.\n-  Integrate Dataproc workflows with other GCP data services like Cloud Storage, BigQuery, and Pub/Sub.\n-  Troubleshoot data quality issues and optimize pipeline performance in Dataproc clusters.\n-  Advanced proficiency with SQL and Python/Spark/Scala for data processing.\n-  Document data pipelines, ETL processes, and data architecture.\n-  Datahub knowledge is additional benefit.",
        "skills": [
          "GCP",
          "BigQuery",
          "Spark",
          "Hadoop",
          "SQL"
        ]
      },
      {
        "title": "Backend Engineer (APIs / Python)",
        "company": "Restb.ai",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "76 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Who we are 💡\nWe are an Artificial Intelligence company that specializes in industry-specific visual recognition, solving core business needs with razor-sharp precision.  We go beyond object recognition (that’s so 2016) and teach computers how to understand intangible visual concepts (e.g “this room has natural light”), something trivial for a human to understand but complex for a machine.  \nJob description ⭐️\nWe are looking for a Backend Engineer with 2-3 years of experience who is passionate about technology, always looking for new ways to tackle complex issues. As our Backend Engineer, you’ll be a key player managing our APIs, building the Machine Learning models wrappers, and helping us bring our state-of-the-art AI solutions to market.\nThe usual day to day tasks include designing, developing, and maintaining APIs integrating Machine Learning models for Real Estate market applications.\nThe role will be completely in English and any CV’s/resumes in other languages will not be considered.\nMain responsibilities and duties 🔎\n      -Collaborate with the Product team on all API platform aspects.\n-Work with the CTO on backend developments and improvements.\n-Lead the design and development of API architectures.\n-Monitor and automate API operations and alert management.\n-Support CI/CD pipeline design and delivery with Software and QA teams.\n-Deploy robust pipelines for pre-production builds and tests.\n-Provide your technical vision in Software architecture and product discussions.\n\n\nBackground and Skills 💼\nA strong candidate will ideally possess at least one strong expertise in the following areas and at least a familiarity in others:      -APIs.\n-Python, Flask and uWSGI.\n-Celery or similar queue system frameworks.\n-Docker and Linux-based systems.\n-Cloud architecture best practices.\n-Elasticsearch or similar document management databases.\n-The passion to keep up with the latest best practices, tools, and frameworks.\n-An active GitHub portfolio is a big plus.\n\n\nWhat makes working at Restb.ai great 🔥\n      -Be a part of Barcelona’s hottest startup in its growth stage.\n-Work at an international company that works with some of the largest companies in the world.\n-Work in an open environment with young, driven, and dynamic team members.\n-Free in-office snacks, beverages, hot drinks, and salads.\n-Free team lunch every Wednesday.\n-Free in-office physical therapy sessions.\n-Quarterly team-building event.\n-Career development training.\n-Health insurance.\n-Barcelona-based, working worldwide!! Do we need to say more?\n\n\nEmployment type 🚨\nPermanent position.Ready to start ASAP.",
        "skills": [
          "Flask"
        ]
      },
      {
        "title": "Desarrollador/a .net React and Sharepoint Spfx",
        "company": "Avanade",
        "location": "Málaga, Andalusia, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "16 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Impulsa el futuro de la ingeniería de software, creando soluciones innovadoras y sostenibles que marcan la diferencia.\n\nCome join us\n\nEn Avanade, tu día a día estará lleno de retos y aprendizaje continuo. Diseñarás y desarrollarás componentes de arquitectura técnica y aplicaciones, colaborando estrechamente con un equipo de profesionales comprometidos con la excelencia y la innovación. Juntos, avanzaremos hacia nuestros objetivos, siempre con un espíritu de mejora y colaboración. Together we do what matters.\n\nSkills And Experiences\n\n      -  Experiencia en programación con c#. .net y Sharepoint.\n-  Experiencia con React.\n\n\n\nAbout You\n\nQué esperamos de ti?\n\nCaracterísticas Que Te Llevarán Al Éxito\n\n      -  Trabajo en equipo y buena comunicación.\n-  Automotivación.\n-  Ser analítico, curioso y ágil.\n\n\n\nWhat You'll Do\n\nEstas son las tareas a desempeñar:\n\n      -  Desarrollo de aplicaciones web con .Net, react y Sharepoint\n-  Asegurar que los componentes cumplan con los requisitos y objetivos de rendimiento.\n-  Resolver problemas y optimizar el proceso de entrega de software.\n-  Crear documentación técnica y operativa de usuario final.\n\n\n\nLearn more\n\nEncontrarás Más Información Sobre Los Tipos De Proyectos De Nuestro Equipo De Desarrollo De Software En Los Siguientes Casos De Estudio\n\n[3] Inail Digitalization Case Study | Avanade\n\n[4] AI-powered Software Development | Avanade\n\nEstás interesado/a en conocer qué está ocurriendo dentro de Avanade? Echa un vistazo a nuestros blogs:\n\n[5] Avanade Insights - exchange ideas that drive tomorrow's innovation\n\n[6] Inside Avanade - explore what life is like working at Avanade\n\nReferences\n\nVisible links\n\n      -  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/-/media/asset/careers/benefits-spain.pdf?la=en&ver=3&hash=476432A7D0FD4E100B97D0BF53D562B2\" data-test-app-aware-link=\"\">https://www.avanade.com/-/media/asset/careers/benefits-spain.pdf?la=en&ver=3&hash=476432A7D0FD4E100B97D0BF53D562B2</a>\n-  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/en-us/about-avanade/inclusion-and-diversity\" data-test-app-aware-link=\"\">https://www.avanade.com/en-us/about-avanade/inclusion-and-diversity</a>\n-  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/en/clients/sportello-digitale-di-inail\" data-test-app-aware-link=\"\">https://www.avanade.com/en/clients/sportello-digitale-di-inail</a>\n-  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/en/thinking/research-and-insights/avanade-presents/ai-powered-software-dev\" data-test-app-aware-link=\"\">https://www.avanade.com/en/thinking/research-and-insights/avanade-presents/ai-powered-software-dev</a>\n-  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/en/blogs/avanade-insights\" data-test-app-aware-link=\"\">https://www.avanade.com/en/blogs/avanade-insights</a>\n-  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.avanade.com/en/blogs/inside-avanade\" data-test-app-aware-link=\"\">https://www.avanade.com/en/blogs/inside-avanade\n\n</a>\n\nEnjoy your career\n\nQué beneficios tendrás en Avanade?\n\nHorario flexible.\n\nDías libres en Semana Santa y Navidad.\n\nSeguro médico.\n\nRetribución fija y variable.\n\nDisfruta tu carrera\n\nLo Mejor De Trabajar En Avanade\n\n      -  Oportunidad para trabajar para Microsoft's Global Alliance Partner of the Year (durante 14 años), con interesante desarrollo y formación (mínimo 50 horas/año de formación y certificaciones gratis).\n-  Acceso a recursos técnicos y en habilidades.\n-  Dispondrás de un Career Advisor para promover tu crecimiento.\n-  Compañeros comprometidos y dispuestos a ayudarte.\n\n\n\nPuedes revisar la lista completa de beneficios en el siguiente enlace: [1] benefits-spain.pdf (avanade.com)\n\nA great place to work\n\nTrayendo tus fortalezas y habilidades a Avanade, conseguirás una experiencia diferenciadora, con aprendizaje ilimitado y ambicioso crecimiento. Estamos construyendo una cultura diversa e inclusiva, llegando a ser cada vez más innovadores y creativos, ayudándonos a ofrecer mejores soluciones a nuestros clientes y comunidades. Te unirás a una comunidad inteligente, con colaboradores que te ayudarán a avanzar, mentorizándote y guiándote y, apoyándose en tu trayectoria. Formarás parte de una compañía diseñada específicamente para promover soluciones tecnológicas de vanguardia y, comprometidos a mejorar la forma en la que los humanos trabajamos, interactuamos y vivimos. Está todo aquí, echa un vistazo!\n\nTrabajamos para proporcionar una cultura diversa e inclusiva con un profundo sentido de pertenencia en todos nuestros empleados/as. Visita nuestro portal de [2] Inclusion & Diversity.\n\nCreamos un futuro para nuestros empleados/as, focalizado en: Ampliar su pensamiento, Experimentar con valentía y, Aprendizaje.\n\nInspiramos grandeza en nuestros colaboradores/as: Empoderando cada voz, Fomentando la Audacia y, Celebrando el progreso.\n\nAceleramos el impacto de nuestros compañeros/as, a través de: Sorpresa al cliente, Priorizar lo importante y, Actuando unidos.",
        "skills": [
          "React"
        ]
      },
      {
        "title": "DevOps Engineer con experiencia en Azure y Kubernetes",
        "company": "Mediacore Solutions",
        "location": "Granada, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "10",
        "salary": "",
        "posted": "6 hours ago",
        "description": "¿Tienes experiencia en la gestión de infraestructuras en la nube y te apasiona la automatización? ¡Únete a nuestro equipo en una startup en expansión! Estamos desarrollando una plataforma innovadora de servicios automatizados que permite a los usuarios contratar servicios esenciales como energía, seguros y telecomunicaciones a través de  WhatsApp. Buscamos un  DevOps Engineer  con sólidos conocimientos en  Azure y  Kubernetes  para ayudarnos a construir una infraestructura escalable y de alto rendimiento que permita conectar a nuestros usuarios de manera rápida y segura.\nResponsabilidades:\n      -Diseñar, desplegar y mantener la infraestructura en  Kubernetes  y  Azure, asegurando la estabilidad y escalabilidad de la plataforma.\n-Gestionar y optimizar pipelines de  CI/CD  para facilitar despliegues continuos y eficientes, minimizando tiempos de inactividad.\n-Implementar políticas avanzadas de seguridad para proteger los datos de los usuarios y asegurar la confidencialidad de la información.\n-Colaborar estrechamente con equipos de desarrollo y producto para implementar las mejores prácticas de DevOps y automatización, adaptándose a un entorno dinámico y en constante evolución.\n\n\nRequisitos:\n      -Experiencia demostrable en  Azure  y  Kubernetes  para la creación y administración de infraestructuras en la nube.\n-Conocimientos sólidos en  CI/CD  y herramientas de automatización de despliegues.\n-Familiaridad con  seguridad en DevOps  y prácticas de DevSecOps para mantener la infraestructura protegida y conforme a las normativas.\n-Actitud proactiva y orientada a la resolución de problemas, con capacidad de adaptación en un entorno de startup.\n-Inglés con nivel profesional para poder trabajar con nuestros partners.\n\n\nOfrecemos:\n      -Salario competitivo según capacidades.\n-Oportunidad de formar parte de un equipo en crecimiento y de un proyecto innovador desde sus inicios, donde tus ideas y contribuciones marcarán la diferencia.\n-Modalidad híbrida de trabajo, con base en Granada y posibilidad de teletrabajo.\n-Un entorno dinámico en una startup, donde cada miembro del equipo tiene voz y contribuye activamente al desarrollo de la plataforma.",
        "skills": [
          "Azure",
          "Kubernetes"
        ]
      },
      {
        "title": "Software Developer in Test",
        "company": "Sysdig",
        "location": "Zaragoza, Aragon, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "27",
        "salary": "",
        "posted": "5 days ago",
        "description": "In the cloud, every second counts. On the leading edge of security, Sysdig stops attacks in real-time by instantly detecting changes in cloud security risk with runtime insights and open source Falco. We are passionate open source enthusiasts at heart and problem-solvers who are building and delivering powerful solutions to secure cloud-native applications.\n\nWe value diverse opinions and open dialogue to spur ideas. We believe in working together to achieve our goals and we pride ourselves on a flexible work culture. We're an international company that understands how to cultivate an inclusive environment across remote teams.\n\nAnd we're a great place to work too – we've been named a \"Best Place to Work\" by Inc.,the San Francisco Business Times and the Silicon Valley Business Journal, and we won six workplace awards from Comparably this year. We have been recognized by Deloitte as one of the 500 fastest-growing organizations for the last four years.\n\nWe are looking for driven team members who want to join us on our mission to lead cloud security globally. Does this sound like the right place for you?\n\nWhat You Will Do\n\n      -Reporting to the Quality Engineering Manager you will code automated tests cases adding end-to-end coverage to Sysdig features\n-You will help us with automation shift-left strategy, even by helping in new frameworks creation\n-You will work with multiple teams in different countries improving coverage efficiency\n-You will implement wider improvements regarding costs, stability and time efficiency, helping the full quality engineering organization\n\n\n\nWhat You Will Bring\n\n      -You will bring experience coding in Java or Python languages\n-Experience with the full stack of web development or testing\n-Familiarity with testing frameworks\n-Familiarity with cloud providers (AWS, GCP)\n-Some Kubernetes knowledge would be a great addition\n\n\n\nWhat We Look For\n\n      -At least one year of professional experience working in cross team environment, contributing to technical and product discussions\n-Interest in professional development to stay informed of industry trends and improve skills\n-Proficiency in English to collaborate with a global team\n\n\n\nWhy work at Sysdig?\n\n      -We're a well funded startup that already has a large enterprise customer base\n-We have an organizational focus on delivering value to customers\n-Our open source tools are widely used and loved by technologists & developers\n\n\n\nWhen you join Sysdig, you can expect\n\n      -Great compensation package, including equity opportunities\n-An international culture with employees in more than 40 countries\n-Flexible work arrangement\n-Mental well-being support for you and your family and company-wide wellness days\n-Development opportunities\n\n\n\nWe would love for you to join us! Please reach out even if your experience doesn't perfectly match the job description. We can always explore other options after starting the conversation. Your background and passion will set you apart, especially if your career path is different.\n\nSome of our Hiring Managers are globally distributed, an English version of your CV will be appreciated.\n\nSysdig values a diverse workplace and encourages women, people of color, LGBTQIA+ individuals, people with disabilities, members of ethnic minorities, foreign-born residents, and veterans to apply. Sysdig is an equal-opportunity employer. Sysdig does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, genetic information, sexual orientation, gender identity, or any other legally protected status.\n\n</em>  PJ1\n\n</em>",
        "skills": [
          "Java",
          "Python",
          "Kubernetes"
        ]
      },
      {
        "title": "Identity and Security Infrastructure Engineer - Cloud security engineering (ODS)",
        "company": "Openbank",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "5 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 days ago",
        "description": "Country: Spain\n\nTechnology Risk & Cybersecurity Associate Expert II\n\nOpen Digital Services is a tech company with a unique culture, dedicated to creating innovative products for Santander Group Affiliates. Open Digital Services is part of the Retail & Commercial Division of Santander Group, one of the world's largest financial institutions and the Eurozone's leader, we're committed to being the best Digital Bank with Branches in the industry.\n\nOur mission at ODS is to design and support an advanced digital and omnichannel platform, ensuring the best customer experience using cutting-edge technology. Openbank, our flagship partner, is where we develop our most advanced concepts. Be part of our Best-in-Class tech team and help us create unique value for our customers!\n\nJoin us to tackle exciting tech challenges in an agile environment, benefiting from learning, growth, and local and international career opportunities in a modern, diverse setting.\n\nMission and responsibilities:\n\nThis role requires technical troubleshooting skills and working knowledge of common security standards and frameworks (NIST, CIS Security…).\n\nThe ideal candidate would be well versed in cloud technologies with knowledge of AWS.\n\nThe role requires the individual to understand the different security challenges across the entire technology stack, including infrastructure, networking, and application level.\n\nThe main tasks of this position will be the following:\n\n      -Operating AWS platform and its infrastructure providing technical expertise in various security domains (WAF, Firewalls, Instance & Containers Hardening, Identity, HSM, etc.)\n-Support audit preparation activities, ensures audit readiness, facilitating the delivery of information. Response and remediation to audit observations for internal and external audits.  \n-Anticipating risks and issues of technical complexity\n-Provides experience of certificates management, hardening, vulnerability and patch management.  \n-Actively collaborate with other internal teams.  \n\n\n\nDemonstrable technical knowledge in:\n\n      -Cloud & DevOps methodologies\n-Automation related technologies & programming languages (Cloudformation, Ansible, shell scripting, python, etc.)\n-Operating & maintaining security appliances\n-Knowledge of SSO solutions with various identity protocols such as SAML, OAtuh and OIDC\n-  Organized and disciplined working approach tailored to meeting tight deadlines while producing good quality work\n-Ability to work independently with external and internal stakeholders.  \n-Good verbal and written English and Spanish communication skills.  \n\n\n\nWhat do we offer?\n\n      -Joining a dynamic and agile company undergoing international expansion.  \n-Working in start-up mode with the support of the Santander Group.  \n-Competitive remuneration and attractive benefits package.  \n-Possibility of growth within the company and the Group.  \n-Collaborating on international projects in different countries.  \n-Excellent work environment, social clubs and frequent events.  \n\n\n\nWould you like to grow with us? Join our team!\n\nODS is an equal opportunity employer. All applicants will be considered as equal without paying attention to gender identity, sexual orientation, ethnicity, religion, age, political orientation, union membership nor disability status.  \n\n</em>We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify, and build.\n\n</em>The personal data you provide as well as any data generated during the selection process are confidential and will be processed by Open Bank, S.A./ Open Digital Services, S.L. with registered office at Plaza de Santa Bárbara 2, 28004 (Madrid), for the sole purpose of managing your participation in the selection processes and, where appropriate, to formalise your recruitment.</em>  \n\nFor further information about your rights and data protection, please read the ODS/Openbank Privacy Policy applicable to this type of data processing  </em><a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.openbank.es/assets/static/pdf/politica_privacidad_candidatos_es.pdf\" data-test-app-aware-link=\"\">here</a></em>.</em>",
        "skills": [
          "AWS"
        ]
      },
      {
        "title": "Data Engineer",
        "company": "Factorial",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 5 days ago",
        "description": "Hello!  👋🏽\n\nAt Factorial we're looking for a new  Data Engineer  to help us boost the company’s support team to the next level. 🦄\n\nReady to be part of the challenge?🚀\n\nRole Overview:\n\nThe Data Engineer is essential for managing and optimizing the flow of data from various sources into the SaaS platform. This role involves data extraction, transformation, and loading (ETL) while collaborating closely with data analysts and other teams to ensure the integration of operational and historical data.\n\nKey Responsibilities:\n\n      -Develop and manage data pipelines to efficiently perform ETL operations.\n-Collaborate with Data and Business Analysts to clarify data requirements and proper structuring.\n-Integrate diverse data sources while ensuring consistency and accuracy.\n-Create scripts and automated tools to streamline data entry processes.\n-Oversee data migrations from legacy systems, ensuring data integrity.\n-Identify and troubleshoot data discrepancies and performance issues.\n-Monitor data performance and optimize processes for improved efficiency.\n\n\n\nKey Skills:\n\n      -Proficient in SQL, ETL tools, and programming languages (e.g., Python, R) for data manipulation.\n-Experience with database management systems like MySQL or PostgreSQL.\n-Strong understanding of data integration and transformation methodologies.\n-Familiarity with SaaS platforms and their data architectures.\n-Ability to handle complex data migration tasks effectively.\n-  Exceptional verbal and written communication skills in English.  \n\n\n\nQualifications:\n\n      -Bachelor’s degree in Computer Science or a related discipline.\n-Significant experience in data engineering, integration, or database management.\n-Competence with ETL processes and data migration projects.\n-Excellent problem-solving skills and attention to detail.\n-  Experience with SaaS data structures preferred.\n\n\n\nWhy Join Us?  \n\n      -Opportunity to work with a collaborative and innovative team.\n\n\n\nWe own it: We take responsibility for every project. We make decisions, not excuses.\n\n      -  We care about people and we also offer a lot of benefits for employees:Is this you*?! Come rock the world with us! 👌* About US 🚀Factorial is an all-in-one HR Software fast-growing company founded in 2016. Our mission is to help SMEs automate HR workflows, centralize people data and make better business decisions. Currently, serves thousands of customers in over 60 countries all over the world and across industries, it has built a super diverse and multicultural team of over +900 people in Barcelona, Brazil, Mexico, and US offices.🌎Our ValuesHigh growth, multicultural and friendly environment 🤝🏽  \n      -Alan private health insurance 🩺\n-Healthy life with Gympass(Gyms, pools, outdoor classes) 🧘🏽‍♀️\n-Save expenses with Cobee💰\n-Language classes with Yolk Academy 👩🏽‍🏫\n-Breakfast in the office and organic fruit 🍏\n-Nora and Apetit discounts 🍱\n-Free caffeine and theine ☕\n-  Pet Friendly 🐶\n\n\n\nWe learn and teach: We're dedicated to learning something new every day and, above all, share it.\n\nWe partner: Every decision is a team decision. We trust each other.\n\nWe grow fast: We act fast. We think that the worst mistake is not learning from them.  \n\n      -Professional growth and development opportunities.\n-  Competitive salary and benefits package.\n\n\n\nPerks of being part of our team💆Job Summary:",
        "skills": [
          "SQL",
          "Python",
          "MySQL",
          "PostgreSQL"
        ]
      },
      {
        "title": "Full Stack Software Engineer - Internship",
        "company": "bsport",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Internship",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "Do you know about bsport?\n\nWe are a Barcelona based company that offers a platform combining boutique fitness and advanced technology. Our all-in-one features cover bookings, payroll, marketing and more, helping our partners streamline operations and boost their commercial success.\n\nWe have over 1,200 partners in 30+ countries and continue to expand rapidly.\n\nWe provide our partners with:\n\n      -Our platform - the heart of the system (B2B)\n-A white label iOS and Android mobile application (B2C)\n-An integrated Video on Demand tool\n-Our self-built Smart Marketing Suite\n-A Web shop to up- and cross-sell different products\n\n\n\n\nOur first successes\n\nSince we launched in 2019, we have already achieved the following:\n\n      -We’ve built a community of over 3 million users\n-Finalized a Series A Fundraising of $4+ million in December 2022\n-Grown our team to more than 100 employees\n\n\n\n\nWe’re continuing to grow our team to become the #1 tech partner for boutique studios in Europe and the rest of the world!\n\nWhat your future position looks like:\n\n      -You will play a role in the design and development of our solution, on both functionally and technically sides.\n-Your toolset will include a recent tech stack: Django+DRF (Python 3.11), Celery, React (JS and Native), PostgreSQL15, Redis, RabbitMQ, Docker, and Kubernetes\n-Producing top-notch code for our back office will be a key responsibility.\n-You'll also actively participate in defining and implementing new features within the development team.\n\n\n\n\nYou will be based in our office in Paris, and the first month you will be trained in Barcelona (all costs covered by Bsport). You will enjoy working within an internal team of 25 people, consisting of Tech, Product, QA and Data experts, directly surrounded by our Senior Leads and CTO.\n\nOur stack is fully automated with push-to-deploy on both frontend and backend. We use Kubernetes and AWS, and our CI is self-hosted.\n\nWhy choose to work with us ?\n\n      -  Meaningful Impact: As one of the early employees you will have the opportunity to have a serious impact on our tech evolution, both on features and refactor/stack decision.\n-  Skills Growth: Have the opportunity (if wanted) to develop both your backend and frontend skills: we don't like labelling, even though we will always respect stack preferences.\n-  Innovative Culture: Our team is young and embraces a culture that is unafraid of testing new frameworks and organizational approaches. We encourage experimentation and continuous improvement.\n-  Rapid Development Cycles: We emphasize fast (weekly) development cycles, allowing you to see the results of your efforts quickly. This agility fosters a dynamic and engaging work environment.\n-  Efficient Meetings: less useless meetings than you imagine\n-  Tech-Driven Startup: bsport values the tech department as much as the sales team, with two of our co-founders being software engineers themselves. This balance creates a startup environment where technological innovation is highly valued and em powered.\n-  Competitive Salary: Up to 2'500€ according to experience and background\n\n\n\n\nYou will be a good fit to join us if you:\n\n      -You are a master student in engineering, computer science or any equivalent degree from a top rated engineering program in France\n-You are based in Paris as it’s required to be on-site\n-You are looking for an end of studies internship from 4 to 6 months with possibility to switch to full-time\n-Have professional proficiency in English (French is a plus)\n-Must have working or practical knowledge of JavaScript or Python\n\n\n\n\nWhat our interview process looks like:\n\n      -First interview with one of our Talent Acquisition team members (30 min)\n-Technical Interview with one of our Tech team members (1h30)\n\n\n\n\nWe'd love to have you join us for many reasons, such as:\n\n🌍 A multicultural and international team!\n\n🚀 A stimulating SaaS environment within a supportive and a fast-growing company\n\n🏢 Work from our stunning office in the heart of le Marais\n\n🛵 Public Transportation half covered\n\n🏄🏽 Take part in bsport team building and sport initiatives\n\n🛌🏽 Supported by bsport on sick days\n\nAbout our Company Culture:\n\nAt bsport, we prioritize a positive and inclusive culture by encouraging open communication and providing opportunities for professional growth. We believe in valuing all individuals and empowering them to contribute their unique skills and perspectives.\n\nJoin our team of passionate and committed people who are dedicated to creating a thriving and welcoming environment. Let's make it happen together!\n\nWhat our interview process looks like:\n\n      -Discovery call with one of our Talent Acquisition team members (30min)\n-Technical Interview with one of our Tech Leads (1h30)",
        "skills": [
          "React",
          "Redis",
          "Docker",
          "Kubernetes",
          "AWS",
          "JavaScript",
          "Python"
        ]
      },
      {
        "title": "PL/SQL Developer",
        "company": "KBC Technologies Group",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Contract",
        "level": "Entry level",
        "applicants": "20",
        "salary": "",
        "posted": "1 day ago",
        "description": "Role-PL_SQL DeveloperType-B2B ContractDuration- Start with 6 to 12 months with possible chances to be coverted into a permanent position.Location-Malaga (Hybrid 1,2 days onsite per week)\nWe need someone like you to help us in different fronts:      -Business application development (full software lifecycle: problem analysis, technical solution, solution design, development, testing and production upload).\n-Communication with users to understand technological needs and provide strategic solutions.\n-Code optimization and analysis: Threat modeling, exhaustive SAST, Sonar…\n-Planning and execution of projects using Agile methodology\n-Managing the different internal tools to document ALM in all phases of the projects.\n-Support for incidents, including planned interventions.\n-Execution of unit, integrated and regression tests\n-Managing the tools to promote the releases.\n\n\n<span class=\"tvm-operation__underline\">EXPERIENCE      -2+ years experience as PL_SQL Developer\n-Fluent in Spanish and English.\n\n\n<span class=\"tvm-operation__underline\">EDUCATION      -Bachelor's degree in Computer Science/Telecommunications, Mathematics or related studies.\n\n\n<span class=\"tvm-operation__underline\">SKILLS & KNOWLEDGE      -Medium knowledge of PL_SQL in ORACLE\n-Knowledge of different databases (Oracle, postgre..)\n-Java / Javascript\n-Github\n-Jenkins\n-Drools\n-Agile methodology and tools: Jira, Confluence,…\n-Attitude of strategic ideas and innovation to face all kinds of situations\n-Desirable: knowledge in Microservices (Spring Boot) – Openshift\n-Desirable: Kafka, S3, Elastic, Angular and Flink\n-Desirable: business knowledge in the area of Regulatory Reporting",
        "skills": [
          "Kafka",
          "Angular"
        ]
      },
      {
        "title": "DevOps Engineer",
        "company": "Clarivate",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "7 people clicked apply",
        "salary": "",
        "posted": "2 days ago",
        "description": "We are looking for a DevOps Engineer to join our Clarivate PISA IP Content DevOps team in Barcelona, Spain. This is an amazing opportunity to work on the Amazon Web Services Cloud Platform using Docker, Terraform and Kubernetes.The team consists of 10 DevOps Engineers and is reporting to the Manager, DevOps.\nAbout You – experience, education, skills, and accomplishments  \n      -2-3 years professional experience as a DevOps engineer.\n-Bachelor’s degree in computer science, CIS, MIS, etc or equivalent experience.\n-Demonstratable knowledge of cloud technologies (AWS).\n-Knowledge and experience of Continuous Integration tools and techniques.\n-Knowledge of MySQL and PostgreSQL administration.\n-Knowledge and experience working with Jenkins.\n-Linux administration skills.\n-Ms SQL server, Windows framework, Windows systems.\n-Shell scripting.\n-Excellent communication skills in a fast-paced, global environment.\n-Self-starter with ability to learn new technologies.\n-Knowledge on full-stack monitoring capabilities, security testing, detection, and compliance tools.\n\n\nTechnologies\n      -Infrastructure: Docker, Kubernetes, Terraform, Ansible\n-AWS, EC2, S3, EBS, Lambda, SQS, SNS, RDS, ECS\n-Jenkins\n-Java, Python\n-Bitbucket\n-Nginx, Tomcat, MySQL, PostgreSQL.\n\n\nWhat will you be doing in this role?\n      -Design, develop & test new capabilities and maintain existing framework for continuous integration, continuous deployment (CI/CD) and hosting of SaaS solutions.\n-Apply cloud computing skills to provision, configure and maintain reliable, performant, and secure infrastructure and platform components of our SaaS solutions.\n-Troubleshoot production incidents with the development team and coordinate to streamline resolution delivery.\n-Collaborate with team members to improve and optimize the company's computing architecture, systems' configuration and engineering policies, processes and guidelines.\n-You will continuously explore new technologies that will make automation and scale a reality.\n\n\nProduct you will be developing:\nThe focus of this DevOps role is to support various services and applications involved with IP Content ETL workflows. Key skills critical to this role include Jenkins, AWS, Terraform, Kubernetes, Ansible, and other AWS services.\nAbout the Team  \nProvides a startup culture/working environment that allows team members to experiment with new technologies. Collaborative environment where team members work closely with Product, Development and QA teams.\nHours of Work\n      -Fulltime Position\n-Flexible working hours\n-On-call required\n\n\nWhat we can offer you:\n      -A start up culture/working environment combined with all the financial and stability advantages of working for a publicly traded company.\n-An opportunity to have a real impact on the global Life Sciences industry.\n-30 working days of vacation\n-Volunteering community, with 40 paid hours of volunteering time\n-Private Health and Life & Disability insurances.\n-Tax-free benefits (Ticket Restaurant scheme, kindergarten, and transport cards)\n-Agile work environment with a team of talented colleagues\n-On-site language classes (Catalan, Spanish and English)\n-Digital workplace with possibility to work in a central office location in Barcelona with global and dynamic employees.\n\n\n#hybrid-Barcelona\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training, and other terms, conditions, and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.",
        "skills": [
          "Docker",
          "MySQL",
          "PostgreSQL",
          "Jenkins",
          "SQL",
          "Kubernetes",
          "Python",
          "AWS"
        ]
      },
      {
        "title": "DevOps Engineer-ES-Madrid",
        "company": "Globant",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "60 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "We are a digitally native technology services company where innovation, design and engineering meet scale. We use some of the latest technologies in the digital and cognitive field to empower organizations in every aspect.\n\nRight now, we are looking for  DevOps Engineers  to join our Cloud Studio at  Globant!\n\nThis Studio combines the best cloud technologies, continuous integration and continuous delivery practices along with unique Globant capabilities to facilitate new and more efficient way of doing business.\n\nYou will get the chance to:\n\n      -Work with professionals who have created some of the most revolutionary solutions in their fields.\n-Make an impact. Work in large-scale projects globally.\n-Develop your career in our Studios. Each Studio represents deep pockets of expertise on the latest technologies and trends and delivers tailored solutions focused on specific challenges.\n-Develop your career within an industry or multiple industries.\n-Work in the city you want, and be nourished by cultural exchanges.\n-Be empowered to choose your career path: we have more than 600 simultaneous projects, so you can choose where and how to work.\n-Be part of an agile pod. Driven by a culture of self-regulated teamwork, each team -or POD- works directly with our customers with a full maturity path that evolves as they increase speed, quality and autonomy.\n\n\n\n\nWhat will help you succeed:\n\n      -Believe and love what you do.\n-Build bridges & open doors.\n-Enjoy solving problems.\n-Being capable of taking a step back to look at a bigger picture.\n-Intermediate or upper English skills.\n-Solid Linux/Unix administration skills.\n-Strong Puppet or Chef experience (either for Configuration Management and/or Continuous Delivery) and integration with virtual environments (Vagrant, VirtualBox, AWS EC2).\n-A development background and a strong scripting knowledge.\n\n\n\n\nAt Globant we believe that an inclusive culture and a diverse environment makes us stronger. We encourage people to have an inclusive spirit as our global footprint expands. We seek to generate a place of inspiration and growth for everyone. A safe space, based on equity as a value, where everyone's careers can be promoted and developed in the same way. There is no innovation without diversity and there is no improvement without plurality.\n\n</em>Are you ready?\n\nJob Segment:    Unix, Linux, Engineer, Equity, Technology, Engineering, Finance",
        "skills": [
          "AWS"
        ]
      },
      {
        "title": "2025 Software Development Engineer Intern - Embedded Development",
        "company": "Amazon",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Internship",
        "level": null,
        "applicants": "82 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Description\n\nDo you want to solve business challenges through innovative technology? Do you enjoy working on cutting-edge, scalable services technology in a team environment? Do you like working on industry-defining projects that move the needle?\n\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our interns write real software and collaborate with a selected group of experienced software development engineers who help interns on projects that matter to our customers.\n\nWe want to you to feel welcomed, included and valued right from the start. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth. How often can you say that your work changes the world?\n\nAt Amazon, you’ll say it often. Join us and define tomorrow.\n\nWe have two different internship durations available;\n\n      -  3 months internship\n-  6 months internship\n\n\n\nPlease ensure to indicate your availability during the application process.\n\nKey job responsibilities\n\n      -  Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring to market innovative products and services.\n-  Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\n-  Create solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\n-  Build distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\n-  Work in an agile environment to deliver high quality software.\n\n\n\nA day in the life\n\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to influence the evolution of Amazon technology and lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimisation, scalability, and security – just to name a few.\n\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\n\nMany of our technologies overlap, and you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalise for customers. We make the impossible, possible.\n\nBasic Qualifications\n\n      -  Knowledge of computer science fundamentals such as object-oriented design, operating systems, algorithms, data structures, and complexity analysis\n-  Knowledge of programming languages such as C/C++, Python, Java or Perl\n-  Currently enrolled in a Bachelor’s or Master's in Computer Science, Computer Engineering, or related fields at time of application\n\n\n\nPreferred Qualifications\n\n      -  Speak, write, and read fluently in English\n-  Experience with distributed, multi-tiered systems, algorithms, and relational databases\n-  Experience in optimization mathematics such as linear programming and nonlinear optimization\n-  Experience with;\n-  Natural Language Processing - Java or Python, and ML, AI, Labeling, Annotation, Data Pipeline, Big Data, AWS, or Cloud Services\n-  Computer Vision - Kernel, Hardware Accelerator, TVM, or Code-gen\n-  Deep Learning - C++ or Python, and AI, Neural Network, Tensorflow, PyTorch, MxNET, Llvm, Compiler, CPU, CUDA, Nvidia, TensorRT, TPU, Cluster Management, High Performance Computing, or Optimization\n\n\n\nAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\n\n\nCompany  - Amazon Spain Services, S.L.U. - B76\n\nJob ID: A2825134",
        "skills": [
          "Python",
          "Java",
          "Perl",
          "AWS",
          "C++",
          "PyTorch"
        ]
      },
      {
        "title": "SOFTWARE COMPONENT ENGINEER",
        "company": "Hitachi Rail",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "44 people clicked apply",
        "salary": "",
        "posted": "Reposted 3 hours ago",
        "description": "Sobre nosotros  \n\nUna carrera en Hitachi Rail te ayudará a tener un legado. Con actividades en todos los rincones del mundo, nuestro trabajo está a la vanguardia de la transformación digital y la tecnología. Desde la fuerza multicultural de nuestra organización global a la sostenibilidad e innovación trabajamos para atraer a las personas, hay algo para que todos/as se enganchen. Y ahí es donde entras tú.\n\nMadrid, Spain (Hybrid)\n\nEn Hitachi Rail buscamos una persona que realice el desarrollo y mantenimiento en las herramientas de apoyo a la Ingeniería de datos de ERTMS.\n\n  ¿Cuáles serán tus funciones?  \n\n\n      -  Desarrollo y mantenimiento de herramientas de apoyo a la ingeniería y parametrización de ERTMS / enclavamientos electrónicos.\n-  Análisis de incidencias y errores.\n-  Análisis y definición de requisitos software, desarrollo de nuevas funcionalidades para herramientas de preparación de datos de sistemas de ERTMS.\n-  Documentar los trabajos realizados, aplicando los procesos definidos para cada sistema.\n\n\n\n\n  ¿Qué perfil buscamos?  \n\n\n      -  Ingeniero/a Técnico o Superior en Informática, Telecomunicaciones, Industriales o equivalente.\n-  Que tenga conocimientos en sistemas de protección del tren, aplicaciones de Seguridad, sistemas de señalización y especificaciones técnicas sistemas ERTMS.\n-  Que cuente con conocimientos en lenguaje de programación C++ en entorno de Visual Studio, Base de datos SQL y lenguaje T-SQL, Metalenguaje XML, Sistema de control de versiones GIT (nivel de usuario), amplios conocimientos de informática a nivel de usuario, sistemas Operativos Windows, Jira, conocimientos en JAVA y herramientas de introducción de datos.\n\n\n\n\nY nosotros...¿Qué te ofrecemos?\n\n\n      -Periodos vacacionales de 35 días laborales aproximadamente.\n-Hitachi Rail Concilia que incluye servicios para tu cuidado y el de tu entorno.\n-Posibilidad de teletrabajo, trabaja desde casa hasta 3 días a la semana.\n-Flexibilidad horaria de hasta 2 horas en la entrada y salida.\n-Área de salud y bienestar con servicio médico, sala de lactancia, ¡y acceso a diferentes actividades e iniciativas que cuidan tu salud!\n-Plan de Formación anual adaptado a tu puesto de trabajo en habilidades, idiomas, competencias técnicas...\n-Una organización que considera la diversidad y la inclusón dos pilares estratégicos: trabajamos por la igualdad de género, queremos que todas las generaciones convivan y aprendan unas de otras; nos enriquecemos con todas las culturas y nacionalidades, pensamos que todas las capacidades son útiles y necesarias, y creamos un ambiente seguro para todas las personas, independientemente de su orientación sexual.  \n-¿Dónde estamos? Nuestras oficinas se encuentran en Serrano Galvache, 56 (metro línea 1 - Bambú).\n\n\n\n\nGracias por tu interés en Hitachi Rail. Si tu solicitud es de interés, nos pondremos en contacto contigo. Por favor, no dudes en descubrir más sobre nosotros y nuestras nuevas vacantes en https://www.hitachirail.com/careers .\n\nEn Hitachi Rail, hay un lugar para todos/as. Acogemos y valoramos las diferentes experiencias, edad, género, sexualidad, situación familiar, discapacidad, origen, nacionalidad, etnia, religión, y visión del mundo. Es nuestro compromiso crear un entorno inclusivo - estamos orgullosos/as de ser un empleador paritario.  \n\nNos encantaría que fueras uno/a de nuestros/as seguidores/as en https://www.linkedin.com/company/hitachirail .",
        "skills": [
          "C++",
          "SQL",
          "T-SQL"
        ]
      },
      {
        "title": "Full Stack developer React y NodeJS",
        "company": "Inetum",
        "location": "Zamudio, Basque Country, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "96 people clicked apply",
        "salary": "",
        "posted": "Reposted 5 days ago",
        "description": "Mission\n\nDesde la línea de Desarrollo de Inetum Norte, precisamos incorporar a una persona con perfil con experiencia como desarrollador/a.\n\nLa persona seleccionada se integrara en uno de nuestros equipos de manera híbrida para trabajar en proyectos de un importante cliente del sector energético.\n\n¿Qué características tiene el perfil que buscamos?\n\nPrincipalmente buscamos un perfil que haya trabajado previamente con tecnologías React.JS y NodeJS y que quiera continuar desarrollando su perfil en el mundo de la programación.\n\nPerfil\n\nExperiencia en torno a 2 años en desarrollo y mantenimiento de aplicaciones con las siguientes tecnologías:\n\nReact.JS, Javascript/Typescript\n\nHTML, CSS\n\nNodeJS\n\nSQL\n\nDeseable experiencia en GitHub\n\nExperiencia en proyectos con uso de metodología agile.\n\nSe valorará conocimientos en Ciberseguridad. Desarrollo de código seguro.\n\nBuena interlocución para asistir a reuniones con cliente\n\nAcostumbrado a trabajo en equipo.\n\nProactividad\n\nNivel alto de inglés.\n\nOfrecemos\n\n      -  Retribución salarial acorde con la experiencia aportada.\n-  Plan de carrera: carrera profesional en función de la experiencia y potencial personal dentro de una compañía en continua evolución y con un sólido crecimiento.\n-  Plan de formación en competencias tecnológicas de acuerdo con las exigencias de los proyectos y clientes.\n-  Retribución flexible: retribución a la carta pudiendo elegir diferentes productos y modelar tú mismo cómo distribuirlos: seguro de salud, tickets de comida, guardería, tarjeta transporte, etc.\n-  Flexibilidad horaria.\n\n\n\n\nOrganización\n\nSobre Inetum\n\nInetum es líder europeo en servicios digitales. El equipo de 28.000 consultores y expertos de Inetum se esfuerza cada día por lograr un impacto digital en las empresas, en las entidades del sector público y en la sociedad. Las soluciones de Inetum quieren contribuir al rendimiento y la innovación de sus clientes, así como al interés general.\n\nPresente en 19 países con una red de centros densa, Inetum colabora con los principales fabricantes de software para afrontar los retos de la transformación digital con proximidad y flexibilidad.\n\nImpulsada por su ambición de crecimiento y expansión, Inetum generó una cifra de negocio de 2.500 millones de euros en 2023.",
        "skills": [
          "HTML",
          "CSS",
          "SQL"
        ]
      },
      {
        "title": "React Software Engineer",
        "company": "GMV",
        "location": "Valladolid, Castilla and Leon, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "37",
        "salary": "",
        "posted": "Reposted 2 days ago",
        "description": "Are you passionate about technology and software development? Do you want to be part of innovative projects in the railway sector? This is your opportunity!\n\nWe are looking for a  Software Engineer  passionate about developing innovative and efficient user interfaces.\n\nYou will be part of a multidisciplinary team working on high-tech projects in the Intelligent Transport Systems (ITS) sector, specifically in the Rail project area.\n\nWe´ll get to the point; we'll tell you what's not on the web. If you want to know more about us go to GMV website\n\nWHAT CHALLENGE WILL YOU BE TAKING ON?\n\nIn our team you will develop the following functions:\n\n      -Participate in the design of the necessary developments. Propose new ideas, generating effective and efficient solutions.\n-Perform the implementation with clean, scalable and testable code.\n-Actively contribute to code reviews, ensuring good development practices.\n-Work collaboratively in multidisciplinary teams.\n\n\n\nWHAT DO WE NEED IN OUR TEAM?\n\nFor this position, we are looking for  Engineers with experience and knowledge of HTML, CSS and JavaScript React framework and Unit Testing.\n\nWe also value  previous experience and knowledge of ORMs and development with RESTful APIs.\n\nWHAT DO WE OFFER?\n\n🕑  Hybrid working model  and  8 weeks  per year of  teleworking outside  your usual  geographical area.\n\n💻  Flexible  start and finish  times, and intensive working hours Fridays and in summer.\n\n🚀  Personalized career plan  development, training and  language learning  support.\n\n🌍 National and international  mobility. Do you come from another country? We can offer you a  relocation package.\n\n💰  Competitive compensation  with ongoing  reviews, flexible compensation and discount on brands.\n\n💪Wellbeing program: Health, dental and accident  insurance; free fruit and coffee, physical, mental and financialhealth training, and much more!\n\n⚠️ In our recruitment processes you will always have telephone and personal contact, face-to-face or online, with our talent acquisition team. In addition, bank transfers and bank cards will never be requested. If you are contacted through any other process, please write to our team at privacy@gmv.com\n\n❤️We promote equal opportunities in recruitment, and we are committed to inclusion and diversity.\n\nWHAT ARE YOU WAITING FOR? JOIN US\n\nIf you have any questions please do not hesitate to contact  Alejandra Estévez Melgarejo, in charge of this vacancy.\n\nAlejandra Estévez Melgarejo",
        "skills": [
          "HTML",
          "CSS",
          "JavaScript",
          "React"
        ]
      },
      {
        "title": "Desarrollador Software | CAF Digital Services",
        "company": "CAF (Construcciones y Auxiliar de Ferrocarriles)",
        "location": "San Sebastián, Basque Country, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 3 days ago",
        "description": "¿Estas interesado/a en crecer como profesional de la programación, participando activamente en las decisiones del proyecto y hacerlo de la mano de un equipo experimentado y en un entorno de trabajo cercano y colaborativo?  ¡Esta es tu oportunidad!\n\nSi quieres trabajar para conseguir un mundo más sostenible y responsable con su entorno, en CAF Digital Services creemos y trabajamos en la movilidad sostenible, uno de los principales retos a los que se enfrenta la sociedad actual. En CAF Digital Services mejoramos la disponibilidad de los trenes y el bienestar de los pasajeros a través de la analítica de datos y la digitalización. Trabajamos con las tecnologías de mantenimiento y operación más innovadoras para maximizar la calidad de servicio de los trenes.\n\n¿Qué te ofrecemos?\n\nAmbiente de Trabajo Positivo:  Podrás ser parte de un gran equipo altamente cualificado en el que estarás rodeado/a de personas con un gran espíritu colaborativo en el que te encontrarás un ambiente cercano y muy agradable.\n\nTecnología de Vanguardia:  Trabajarás con las últimas tecnologías (Angular 15 & Java 17), teniendo la posibilidad de proponer e implementar nuevos enfoques y soluciones innovadoras.\n\nConciliación: Nuestro modelo híbrido te permitirá conciliar a la perfección la vida familiar y la vida laboral.\n\nAprendizaje y Autonomía:  Te animaremos a que trabajes de manera autónoma, pudiendo proponer y decidir el 'qué' y el 'cómo'.\n\nSeguridad y estabilidad:  CAF lleva más de 100 años trabajando en un camino que se extiende hacia el futuro, brindándote la seguridad que necesitas.\n\n¿Qué te hará triunfar en esta posición?\n\n      -Poseer estudios de Ingeniería Informática, Industrial o Telecomunicaciones dado el alto contenido técnico del puesto y del producto.\n-Una buena capacidad comprensiva y comunicativa en inglés.\n-Poseer experiencia y buenos conocimientos en Angular y Java.\n-Tener una actitud proactiva y saber trabajar en equipo.\n\n\n\n¿Cuál va a ser tu misión en la empresa?\n\nTu misión será desarrollar aplicaciones web seguras, fiables y eficientes que respondan a las necesidades presentes y futuras de la organización.\n\nResponsabilidades de la posición:\n\n      -Desarrollo front-end y back-end de aplicaciones web,\n-Procesamiento de datos obtenidos por equipos embarcados en tren.\n-Definición de la arquitectura de las soluciones.\n-Evolución de los sistemas de integración y entrega continua.\n-Puesta en producción y monitorización de las aplicaciones.\n-Integración en un equipo agile.\n\n\n\nPor tanto, si te interesa trabajar en una empresa digital para conseguir un mundo más sostenible y responsable con su entorno, no lo dudes e inscríbete en la oferta ahora.",
        "skills": [
          "Java",
          "Angular"
        ]
      },
      {
        "title": "DevOps & Security Specialist - M/H/NB",
        "company": "Cegid",
        "location": "Manresa, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "41 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 hours ago",
        "description": "Let’s Shape the Future Together!\n\nSobre nosotros\n\nCegid es líder europeo en soluciones de gestión empresarial en la nube  para los sectores financiero (tesorería, fiscal, ERP), de recursos humanos (nóminas, gestión del talento), CPA, minorista y empresarial. En el cambiante mundo actual, Cegid y sus  5.000 empleados  hacen posible ayudando a sus 750.000 clientes a liberar su potencial gracias a soluciones empresariales innovadoras y con propósito.\n\nMake more possible, es nuestra vocación. Refleja quiénes somos, cómo y por qué hacemos las cosas como las hacemos para nuestros clientes. Gracias a ello, podemos afirmar que trabajamos cada día para dar forma a su futuro, al nuestro y al de las industrias de nuestros clientes. Un futuro que llevamos años definiendo con nuestros empleados, inventando soluciones que cambian la forma de trabajar de las personas, para un rendimiento sostenible.\n\nEsta posición se encuentra  ubicada en Manresa.\n\n¿Tus principales objetivos como DevOps & Security Specialist?\n\nSerás responsable en la identificación de proyectos que apoyen la estrategia de Cegid Revo y te responsabilizarás de guiar la ejecución y priorización de iniciativas.\n\nComo DevOps & Security Specialist, Deberás Hacer\n\n      -Suministrar y optimizar las infraestructuras de TI y optimizar los ciclos de despliegue.\n-Encontrar métodos para la automatización de tareas repetitivas.\n-Controlar y gestionar los posibles errores.\n-Gestionar y monitorizar costes.\n-Asegurar infraestructura con políticas de seguridad.\n-Disaster Recovery e Interacción con proveedores.\n-Guardias para incidencias de nivel III (1 al mes máx.).\n\n\n\nSobre tí\n\n      -Enfocado en Google Cloud, aunque se valora positivamente conocimiento del Cloud de Microsoft Azure.\n-Experiencia en FinOps (gestión de costes y optimización de recursos) y en gestión y políticas de seguridad en infraestructura.\n-Conocimiento de distribución de red, load balancer, DNS, VPN, VPC, etc.\n-Administración de BBDD en Google Cloud SQL (MySQL).\n-BigQuery y control de Google Cloud Compute Engine.\n-Docker y Kubernetes / Terraform, bash y scripting.\n-Automatización de procesos e implementación de estrategias de CI/CD con TeamCity o experiencia en otras herramientas.\n-Capacidad de programación de scripts de interacción con APIs y gestión de costes y monitorización.\n\n\n\nMás allá de las habilidades empresariales, buscamos profesionales con talento que quieran demostrar y experimentar su potencial abriendose posibilidades con nosotros. Es tu curiosidad, espíritu de equipo y compromiso lo que marcará la diferencia.\n\n</em>Competencias\n\nVisión global\n\nProblem solver\n\nAgilidad deductiva",
        "skills": [
          "Azure",
          "SQL",
          "Kubernetes"
        ]
      },
      {
        "title": "Salesforce Junior Developer",
        "company": "VISEO IBERIA",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "93",
        "salary": "",
        "posted": "Reposted 4 days ago",
        "description": "VISEO es una consultora tecnológica con 20 años de experiencia. Trabajamos en proyectos Cloud para diversas tecnologías (Salesforce, SAP, Azure) y hemos ganado premios por la labor de nuestros consultores. VISEO es Sumit Partners de Salesforce, y nos encontramos en constante crecimiento.\n\nComo parte del equipo VISEO contarás con la confianza de trabajar con una empresa sólida avalada por  grandes marcas y proyectos  tanto a nivel nacional como internacional.\n\nTu Rol:  \n\n      -Programación técnica y resolución de incidencias funcionales.  \n-Lecturas de código, debugs.  \n-Assessments en clientes (indicar sector) para mejorar y optimizar procesos.  \n-Tecnologías que usamos: Apex, ligntning components, Aura, Triggers, JavaScript.  \n\n\n\nTu perfil:\n\n      -Experiencia mínima de 2 años en proyectos de implantación, soporte, mantenimientos o evolutivos en las nubes de Sales y Service\n-Conocimientos de APEX, lightning components, Aura, JavaScript.  \n-Capacidad de tener en mente los distintos procesos de integración, orígenes, destinos, y claves de integración.  \n-Llamadas en REST, SOAP.  \n-Conocimiento sobre GIT, Jenkins. Control de versiones y despliegues.  \n-Valorable conocimiento funcional de las nubes Sales y Service.\n-Ingles C1\n\n\n\nTendrás las siguientes responsabilidades en seguridad dentro de la compañía:\n\n      -Acceso a la información confidencial relativa al cliente del que es responsable.\n-  Solicitud de medidas / usuarios.\n-Observancia del cumplimiento de las políticas de seguridad y las políticas internas.",
        "skills": [
          "JavaScript",
          "Jenkins"
        ]
      },
      {
        "title": "Devops and software Infrastructure Engineer (Ansible)",
        "company": "GMV",
        "location": "Tres Cantos, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "19",
        "salary": "",
        "posted": "Reposted 2 days ago",
        "description": "If you dream about spending the day on the Moon, but you are one of those who get sick on bendy drives... Your place is here!\n\nWe are expanding our teams in satellite navigation to work in Galileo project, the global navigation satellite system (GNSS) created by the European Union through the European Space Agency (ESA).\n\nWe´ll get to the point; we'll tell you what's not on the web. If you want to know more about us go to GMV website\n\nWHAT CHALLENGE WILL YOU BE TAKING ON?\n\nWe are looking for a  Devops Engineer  to join our software and automation team in the  Galileo  project, the European satellite constellation for positioning and navigation.\n\nIn this team we take care of the automation of the deployment and configuration of a series of services of the Control Center, such as the DNS, the access system, the antivirus, the transmission of files, the centralization of information, etc.\n\nIn addition, we carry out a series of small developments to automate the maintenance and control tasks of the system.\n\nThe work will allow you to have an overview of the  Galileo  project and you will contribute to the design, development, deployment and validation of these services, as well as their securing and hardening.\n\nYou will expand your knowledge in Python, security, automation, Linux systems and virtualization and work with tools such as Ansible, Rundeck and Jenkins, among others. Knowledge of UNIX/Linux-based environments.\n\nWHAT DO WE NEED IN OUR TEAM?\n\nWe are looking for Devops Engineer with:\n\nScripting skills (e.g. shell, Python) for Linux\n\nVersion control systems: Git\n\nCI/CD: Ansible, Puppet, chef, etc.\n\nKnowledge of Linux system configuration will be valued: DNS, logging, repositories, ntp, networking concepts, certificates, etc\n\nWHAT DO WE OFFER?\n\n🕑  Hybrid working model  and  8 weeks  per year of  teleworking outside  your usual  geographical area.\n\n💻  Flexible  start and finish  times, and intensive working hours Fridays and in summer.\n\n🚀  Personalized career plan  development, training and  language learning  support.\n\n🌍 National and international  mobility. Do you come from another country? We can offer you a  relocation package.\n\n💰  Competitive compensation  with ongoing  reviews, flexible compensation and discount on brands.\n\n💪Wellbeing program: Health, dental and accident  insurance; free fruit and coffee, physical, mental and financialhealth training, and much more!\n\n⚠️ In our recruitment processes you will always have telephone and personal contact, face-to-face or online, with our talent acquisition team. In addition, bank transfers and bank cards will never be requested. If you are contacted through any other process, please write to our team at privacy@gmv.com\n\n❤️We promote equal opportunities in recruitment, and we are committed to inclusion and diversity.\n\nWHAT ARE YOU WAITING FOR? JOIN US\n\nIf you have any questions please do not hesitate to contact  Azahara Marcos Miguel, in charge of this vacancy.\n\nAzahara Marcos Miguel",
        "skills": [
          "Python",
          "Jenkins",
          "Git"
        ]
      },
      {
        "title": "Software Engineer - Fabric RPC",
        "company": "Datadog",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "39 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 days ago",
        "description": "The Fabric Remote Procedure Call (RPC) team at Datadog provides safe, reliable and scalable internal service-to-service communication for Datadog’s engineering teams. In this role, you’ll develop and maintain data plane components and network control plane integrations for east-west internal service communication for the services that power Datadog’s products.\n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds, and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\n</em>What You’ll Do:  \n\n      -Work with internal engineers and open source maintainers to build features and optimizations that reduce overhead of doing high-throughput network communications at scale\n-Provide both out-of-the-box best practices experience for users as well as deep dives into Linux, Kubernetes, Cilium, gRPC, and related systems\n\n\n\nWho You Are:  \n\n      -Someone who can operate independently, methodically experiment, rapidly iterate, and has no fear of failure\n-Experienced in Golang, gRPC, xDS, Envoy, Cilium, eBPF, Kubernetes, Linux and data center networking concepts (IPv4, IPv6, TCP, UDP, routing, NAT)\n-Bonus: Prior experience with kubernetes controllers, gRPC, Envoy or other load balancers\n\n\n\nDatadog values people from all walks of life. We understand not everyone will meet all the above qualifications on day one. That's okay. If you’re passionate about technology and want to grow your skills, we encourage you to apply.  \n\n</em>Benefits and Growth:\n\n      -New hire stock equity (RSUs) and employee stock purchase plan (ESPP)\n-Continuous professional development, product training, and career pathing\n-Intradepartmental mentor and buddy program for in-house networking\n-An inclusive company culture, ability to join our Community Guilds (Datadog employee resource groups)\n-Access to Inclusion Talks, our Internal panel discussions\n-Free, global mental health benefits for employees and dependents age 6+\n-Competitive global benefits\n\n\n\nBenefits and Growth listed above may vary based on the country of your employment and the nature of your employment with Datadog.\n\n</em>About Datadog:  \n\nDatadog (NASDAQ: DDOG) is a global SaaS business, delivering a rare combination of growth and profitability. We are on a mission to break down silos and solve complexity in the cloud age by enabling digital transformation, cloud migration, and infrastructure monitoring of our customers’ entire technology stacks. Built by engineers, for engineers, Datadog is used by organizations of all sizes across a wide range of industries. Together, we champion professional development, diversity of thought, innovation, and work excellence to empower continuous growth. Join the pack and become part of a collaborative, pragmatic, and thoughtful people-first community where we solve tough problems, take smart risks, and celebrate one another. Learn more about #DatadogLife on  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.instagram.com/datadoghq/?hl=en\" data-test-app-aware-link=\"\">Instagram</a>,  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.linkedin.com/company/datadog\" data-test-app-aware-link=\"\">LinkedIn,</a>  and  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://learn.datadoghq.com/\" data-test-app-aware-link=\"\">Datadog Learning Center.  \n\n</a>Equal Opportunity at Datadog:\n\nDatadog is an  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/affirmative-action-statement\" data-test-app-aware-link=\"\">Affirmative Action</a>  and  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.eeoc.gov/sites/default/files/2022-10/EEOC_KnowYourRights_screen_reader_10_20.pdf\" data-test-app-aware-link=\"\">Equal Opportunity Employer</a>  and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. Here are our  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/legal/candidate-legal-notices/\" data-test-app-aware-link=\"\">Candidate Legal Notices</a>  for your reference.\n\nYour Privacy:\n\nAny information you submit to Datadog as part of your application will be processed in accordance with Datadog’s  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/legal/applicant-candidate-privacy/\" data-test-app-aware-link=\"\">Applicant and Candidate Privacy Notice</a>.",
        "skills": [
          "Kubernetes",
          "Golang"
        ]
      },
      {
        "title": "Associate Application Security Engineer",
        "company": "Pleo",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Remote",
        "job_type": "Internship",
        "level": null,
        "applicants": "7 people clicked apply",
        "salary": "",
        "posted": "1 day ago",
        "description": "Here at Pleo, we're onboarding new customers with Sonic.gif speed, which is amazing don't get me wrong, but the larger we become, the bigger the temptation from cyber criminals. As you may already know, we are in the FinTech business, and we handle money for our customers. So this is not just about protecting a company from a password leak that allows malicious actors to post not-funny cat videos to your SoMe account - this is about directly protecting our customers' money. Well, this is where you (hopefully) come in!\n\nThis role focuses solely on the application security side. We are talking about both security of our application and ensuring our internal dev practices improve our product security maturity. What we're looking for is someone to be part of making all of this happen. Our ideal candidate is someone with coding knowledge, some familiarity with security tooling think Burp Suite and a strong passion or desire to learn more about the industry.\n\nTo give you a better idea, here are some tasks you might do as an Associate Application Security Engineer at Pleo.\n\n      -Assist in dispatching managed Bug Bounty program findings to appropriate teams and follow up as directed\n-Assist Senior team members on feedback to engineering teams during threat modelling sessions\n-Work on scoped security tasks under supervision, including basic authentication, encryption, and partner integration tasks\n-  Assist in reviewing and understanding common security issues in code reported in our bug bounty program, and relay common best practices and guidance to developers\n-Provide basic technical support to the GRC and DevOps team in developing and maintaining security automation in the CI/CD pipeline under the guidance of senior team members\n\n\n\nJust to make it absolutely clear, we're not building a generalist security profile to take over all security-related tasks. We're building a team of specialists to support other teams through paved paths, investigations, and coaching.\n\nThere will be a lot of flexibility in this role depending on your interests and skills, but as an Associate you will most likely:\n\n      -Participate in threat modelling sessions suggesting mitigations to potential threats\n-Assist technical security assessments on our web applications and mobile application\n-Participate in projects while supporting a long-term security vision  \n-Continuously reflect on how we’ve aimed to balance automation in controls and processes against our defined data classifications while providing access and meeting the needs of the company  \n\n\n\nWe'd expect that you have some experience in certain areas. Ideally code review and dynamic testing and not in the whole security-verse. The most important is that you have a passion for the field, you are willing to expand your knowledge, and that you enjoy the responsibilities that come along with such a role.\n\nYour profile\n\n      -You recognize that communication is a core part of your job within application security\n-You are pragmatic in your approach to security - and keen on learning the goldilocks principle. You’re starting to see that risk drives effort, effort drives cost, not the other way around  \n-You agree security isn’t simple, but about understanding complex systems and applying/recycling creative thinking to interesting problems  \n-You love learning new things and enjoy working with problem areas you aren't an expert in (yet) and keen to become one  \n-You are honest and unafraid to state things exactly like they are - acknowledging and communicating what's broken is the first step to fixing things.  \n\n\n\nThe Nitty Gritty Skills\n\n      -You can confidently read server-side languages (we mostly use Kotlin and TypeScript but we know you can learn new languages)\n-You’ve read up on common security flaws and resolutions as published by OWASP, SANS, etc  \n-You have some experience in reviewing security issues during a code review  \n-You’re keen on understanding and gaining experience with common security libraries, and common security flaws  \n-You have played a bit with common web application testing tools (e.g., Burp Suite) and/or SCA/SAST tools\n\n\n\nNice To Have Skills\n\n      -Experience coding using Java or Kotlin and securing applications running on JVM  \n-Experience working in the industry with software development teams  \n-Experience with cloud services such as AWS, Azure and/or GCP services\n\n\n\nNon-requirements\n\nWe don't really care about certificates, degrees, and all that jazz. However, we won't penalise you for talking about your super relevant degree in information security computer science or showing off your brand new certifications. We also don't need you to have any industry experience in information security, and would of course love for you to tell us about any transferable experience that you think is relevant for the job.\n\nShow me the benefits!\n\n      -Your own Pleo card (no more out-of-pocket spending!)\n-Lunch is on us - with catering in our Lisbon, Copenhagen and London offices or a monthly lunch allowance paid directly together with your salary in other markets 🍜\n-Private health insurance to ensure you’re fit in body and mind to do your best work\n-We offer 25 days of holiday + your public holidays\n-Flexibility/remote working options\n-Option to purchase 5 additional days of holiday through a salary sacrifice\n-We’re trialling MyndUp to give our employees access to free mental health and wellbeing support with great success so far ❤️‍🩹\n-Access to LinkedIn Learning - acquire new skills, stay abreast of industry trends and fuel your personal and professional development continuously  \n-Paid parental leave - we want to make sure that we're supportive of families and help you feel that you don't have to compromise your family due to work 👶\n\n\n\n#Remote-LI\n\nWhy join us?\n\nWorking at Pleo means you're working on something very exciting: the future of work. Our mission is to help every company go beyond the books. Pleo itself means ‘more than you’d expect’, and it’s been the secret to our success over the last 8 years. So it’s only fitting that we’d pass this philosophy onto our customers to help them make the most of their finances.\n\nWe think company spending should be delegated to all employees and teams, that it should be as automated as possible, and that it should drive a culture of responsible spending. Finance teams shouldn’t be siloed from the rest of the organisation – they should work in unity with marketing, sales, IT and everyone else.\n\nSpeaking of working in unity, our values tell the story of how we work at Pleo. We have four core values, the first of which is ‘champion the customer’, which means we address real pain points that businesses face. Next up is ‘succeed as a team’, which highlights how our strength lies in our diversity and trust in each other. We also ‘make it happen’ by taking bold decisions and following through to deliver results. Last but not least, we ‘build to scale’, creating lasting solutions that address today’s challenges and anticipate tomorrow’s needs.\n\nSo, in a nutshell, that's Pleo. Today we are a 850+ team, from over 100 nations, sitting in our Copenhagen HQ, London, Stockholm, Berlin, Madrid, Montreal and Lisbon offices —and quite a few full-time remotes in 35 other countries! Being HQ'd out of Copenhagen means we're inspired by things like a good work-life balance. If you don't work in the office with us, we'll help you set up the best remote setup possible  and</em>  make sure you still have time to connect with your team.\n\nAbout Your Application\n\n      -Please submit your application in English; it’s our company language so you’ll be speaking lots of it if you join 💕\n-We treat all candidates equally: If you are interested please apply through our application system - any correspondence should come from there! Our lovely support isn't able to pass on any calls/ emails our way - and this makes sure that the candidate experience is smooth and fair to everyone 😊\n-We’re on a mission to make everyone feel valued at work. That’s only achievable if our team reflects the diversity of the world around us - and that starts with you, hitting apply, even if you are worried you might not tick all the boxes! We embrace and encourage people from all backgrounds to apply - regardless of race/ethnicity, colour, religion, nationality, gender, sex, sexual orientation, age, marital status, disability, neurodiversity, socio-economic status, culture or beliefs  \n-When you submit an application we process your personal data as a data processor. Find out more about how your data is used in the FAQs section at the bottom of our jobs page",
        "skills": [
          "Kotlin",
          "TypeScript",
          "Java",
          "AWS",
          "Azure",
          "GCP"
        ]
      },
      {
        "title": "Programador/a especialista en Digitalización y ERP - SEVILLA",
        "company": "Michael Page",
        "location": "Seville, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "27 people clicked apply",
        "salary": "",
        "posted": "5 days ago",
        "description": "Buscamos un/a apasionado por la tecnología con experiencia en digitalización y ERP para un importante cliente en el sector construcción.Detalles del clienteNuestro cliente es una empresa en pleno crecimiento y revolución tecnológica, con sede en Sevilla.Descripción de la oferta      -Analizar y optimizar los procesos de negocio existentes.\n-Colaborar con los departamentos de tecnología y operaciones para garantizar la eficiencia del sistema.\n-Realizar pruebas de sistemas y solucionar problemas técnicos.\n-Capacitar al personal en el uso del sistema ERP.\n-Realizar seguimiento y crear informes sobre el rendimiento del sistema.\n-Actualizar y mantener la documentación técnica del sistema ERP.\n-Participar en proyectos de digitalización y transformación tecnológica.\n\nPerfil del candidatoEl/la candidato/a seleccionado deberá cumplir los siguientes requisitos:      -Título universitario en Informática, Ingeniería o similar.\n-Experiencia demostrable en la implementación y administración de sistemas ERP.\n-Conocimientos técnicos en lenguajes de programación, preferiblemente JavaScript y bases de datos.\n-Capacidad para analizar y optimizar procesos de negocio.\n-Habilidades de comunicación efectiva para capacitar al personal.\n-Compromiso con la mejora continua y la innovación tecnológica.\n\nOferta de empleo      -Salario competitivo con un rango de 30-35k, según experiencia.\n-Un ambiente de trabajo colaborativo y de apoyo.\n-Oportunidades de formación y desarrollo profesional.\n-Posibilidad de trabajar en proyectos de digitalización y transformación tecnológica.\n\n\nDesired Skills and Experience\n\n❗️💥𝐏𝐫𝐨𝐠𝐫𝐚𝐦𝐚𝐝𝐨𝐫/𝐚 𝐞𝐬𝐩𝐞𝐜𝐢𝐚𝐥𝐢𝐬𝐭𝐚 𝐞𝐧 𝐃𝐢𝐠𝐢𝐭𝐚𝐥𝐢𝐳𝐚𝐜𝐢ó𝐧 𝐲 𝐄𝐑𝐏💥❗️ 𝐒𝐄𝐕𝐈𝐋𝐋𝐀\n\n\n\n🏢 Importante empresa Sevillana inmersa en plena transformación digital.\n\n\n\n💻 Habilidades y calificaciones requeridas:\n\n* 𝟐+ 𝐚ñ𝐨𝐬 𝐝𝐞 𝐞𝐱𝐩𝐞𝐫𝐢𝐞𝐧𝐜𝐢𝐚 en el desarrollo y mantenimiento de soluciones tecnológicas basadas en 𝐉𝐚𝐯𝐚𝐒𝐜𝐫𝐢𝐩𝐭.\n\n* Experiencia demostrable en la implementación y administración de sistemas ERP.\n\n* Experiencia analizando y optimizando procesos de negocio de empresas.\n\n\n\n💰 Rango salarial: Abiertos según experiencia aportada y conocimientos, 30k aprox.\n\n\n\n🏠 Esta posición es para trabajar en un 𝐟𝐨𝐫𝐦𝐚𝐭𝐨 𝐡í𝐛𝐫𝐢𝐝𝐨 en Sevilla.",
        "skills": [
          "JavaScript"
        ]
      },
      {
        "title": "DevOps (AWS) Engineer / Spain-based / Remote",
        "company": "Cognizant",
        "location": "Navalcarnero, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "11 people clicked apply",
        "salary": "",
        "posted": "1 day ago",
        "description": "DevOps (AWS) Engineer\n\n100% Remote / Spain-based / English and Spanish Required\n\n(NOT contractor/freelance)\n\nAre you one of those DevOps Engineers who loves to learn from and teach your colleagues, push yourself to the limit, and take part in very demanding projects with the latest technology?\n\nAt Cognizant Spain we have got the Engineering Community that you’ll want to be part of: great team to count on, continuous training, and interesting projects!\n\nAs a DevOps Engineer, you will get an opportunity to understand the client business requirements and contribute to the design, concentrate on the pure technical solution, learn new technologies and work in agile environment. You will become an active member of the DevOps Competency team that works closely with other disciplines/roles. You are a T-shaped professional and responsible for the whole life cycle of in-house or packaged applications according to development/test standards and corporate architecture policies including security and data privacy guidelines.\n\nWhy choose us?\n\n      -HIGH QUALITY PROJECTS. You will take part in demanding projects focused mainly on digitalization or even start projects from scratch. Show us what you’re made of!\n-LATEST TECHNOLOGIES. We know you love the fascinating world of Front-end, which is why you’ll continue to grow in this field by working with AWS, Terraform, and the tech stack you desire.\n-REMOTE POSITION WITHIN SPAIN. Flexibility, what else do we need? You’ll be able to work from the comfort of your home from any location within Spain.\n-FRONT-END COMMUNITY. We all want to be part of something! Here we’ve built an amazing community that will give you the chance to share your knowledge and experience, participate in TedTalks or even lead them! If you’re a creative person, here’s where you can propose new ideas, don’t be afraid to speak your mind!\n-LEARNING. Your current knowledge is never enough, is it? You’ll have access to learning platforms that will train you to become an expert or even start learning one of those skills you know you’ve been wanting to study.\n-TEAMWORK. This team will always be there for you! We know you’re tough and have a “no task too small” attitude, but you’ll always have a talented teammate to count on if you need to!\n-INTERNATIONAL TEAM. If you stand out among your peers because you’ve got great English communication skills, you’ll be able to put that to good use! If it’s not your strongest suit, don’t worry! Here’s where you can improve it by working alongside teams distributed all around the world.\n-CAREER PLAN. It is a fact, here you’ll grow in every direction: vertically towards gaining more responsibilities and increasing in category, and horizontally towards learning new technologies and becoming an expert in your business.\n\n\n\nOther Benefits That You’ll Find\n\n      -Restaurant tickets for every working day!\n-Permanent contract: you are here to grow with us!\n-Flexible retribution for the Gympass and nursery tickets: take care of your health and your children!\n-Referral program: it’s time to bring your colleagues to an awesome team and get rewarded for it!\n-Salary and bonuses: it’s a matter of reaching an agreement. We’ll discuss it on our first call!\n\n\n\nWhat will make you successful in this position?\n\n      -Experience in Application development and DevOps role.\n-Knowledge and experience working in distributed agile (Scrum + DevOps) model.\n-CI/CD experience.\n-Experience with IAC (Terraform, Ansible, Azure ARM).\n-Cloud Knowledge (Preferable AWS, Azure).\n-Experience with pipelines (Azure DevOps, Gitlab, GitHub actions).\n-Experience with Scripting (Preferable PowerShell, Python, Golang, Bash).\n-Experience with DevOps concepts including Continuous Delivery, Infrastructure as Code, and Test-Driven Development.\n-Experience in Backend development (Java, .NET).\n-Experience with Containers (Docker, Kubernetes, OpenShift).\n\n\n\nTo sum up!\n\nApply to this position if you want to continue being a successful DevOps Engineer surrounded by a healthy and trendy environment!",
        "skills": [
          "AWS",
          "Azure",
          "PowerShell",
          "Python",
          "Golang",
          "Kubernetes"
        ]
      },
      {
        "title": "CiS.Desarrollador Node/Typescript H/M",
        "company": "Inetum",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 4 days ago",
        "description": "Mission\n\nDesarrollo correctivo / evolutivo de aplicaciones Web con tecnología Node.js para el BACK y TypeScript para la capa de presentación.Soporte técnico al cliente\n\nPerfil\n\nExperiencia y conocimientos de al menos 2 años en:Node.jsTypescriptConsumo de APISMuy valorable experiencia en AWS\n\nOrganización\n\nSomos un grupo internacional de consultoría digital ágil. En la era de la post transformación digital, nos esforzamos por permitir que cada uno de nuestros 27 000 profesionales se renueve continuamente viviendo de manera positiva su propio flow digital.\n\nCada uno de ellos puede moldear su trayectoria profesional de acuerdo con sus preferencias, emprender de forma práctica para construir junto a sus clientes un mundo más positivo, innovar localmente en 26 países y armonizar su carrera profesional con su bienestar personal.\n\nÚnete a Inetum. Live your positive digital flow",
        "skills": [
          "TypeScript",
          "AWS"
        ]
      },
      {
        "title": "Front-End Developer (W/M)",
        "company": "MCA España",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 5 days ago",
        "description": "MCA is a European engineering and technology consulting company,\n\nwhich has 1450 employees and 110 million euros in sales.\n\nThanks to our 30 years of experience, we accompany our large customers in their efforts to\n\naccounts in the realization of their projects.\n\nWould you like to join a growing company that will give you all the information you need?\n\nthe keys to develop your career? Apply now!\n\nYour missions\n\nMCA Spain is a company specialized in Software and IT, and we work on cutting-edge projects for clients in sectors such as Life Science, Aeronautics, Energy, Mobility, Banking, Insurance, Telcos...\n\nMCA Engineering is based in France, but we have offices in other parts of the world: Sweden, Belgium, The Netherlands, Germany, Italy, China... We are growing fast in Spain (Madrid and Barcelona) and right now we need to expand our Data Engineering team.\n\nThe goal of the project is to build an application to show KPIs of sustainability area for the business department of the area.\n\nYour Profile\n\n      -Develop high quality, testable and performant software using agile practices.\n-Write effective unit, integration and e2e tests\n-Release software with a DevOps culture through software release management techniques including continuous integration and delivery  \n\n\n\nWe are looking for\n\n      -Minimum 1 year of experience as front-end developer.\n-Technical knowledge in Javascript: ES6, React Hooks, Typescript, Webpack, SPA Application, Jest, React Testing Library.  \n-Styles: PostCSS, Sass, FlexBox, Grid  \n-Version control: GIT  \n-English, minimum B2.\n-Minimum 2 years working in Agile frameworks.  \n\n\n\nSoftskills\n\n      -Proactivity\n-Communication skills\n-Empathy",
        "skills": [
          "React",
          "Sass"
        ]
      },
      {
        "title": "Data Engineer",
        "company": "Globant",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Remote",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 day ago",
        "description": "We are a digitally native technology services company where innovation, design and engineering meet scale. We use some of the latest technologies in the digital and cognitive field to empower organizations in every aspect.\n\nRight now, we’re looking for  Data Engineers  to join our team at  Globant!\n\nYou will get the chance to:\n\n      -Work with professionals who have created some of the most revolutionary solutions in their fields.\n-Make an impact. Work in large-scale projects globally.\n-Develop your career in our Studios. Each Studio represents deep pockets of expertise on the latest technologies and trends and delivers tailored solutions focused on specific challenges.\n-Develop your career within an industry or multiple industries.\n-Work in the city you want, and be nourished by cultural exchanges.\n-Be empowered to choose your career path: we have more than 600 simultaneous projects, so you can choose where and how to work.\n-Be part of an agile pod. Driven by a culture of self-regulated teamwork, each team -or POD- works directly with our customers with a full maturity path that evolves as they increase speed, quality and autonomy.\n\n\n\n\nWhat would help you succeed:\n\n      -Believe and love what you do.\n-Enjoy solving problems.\n-Have imagination and you love innovating.\n-Being flexible & goal oriented.\n-Advanced English skills.\n-High performance analytics.\n-Bachelor Degree in CV, Information Technology or related technical field.\n-Experience with Java or Python.\n-Practical experience in Azure.\n\n\n\n\nAt Globant we believe that an inclusive culture and a diverse environment makes us stronger. We encourage people to have an inclusive spirit as our global footprint expands. We seek to generate a place of inspiration and growth for everyone. A safe space, based on equity as a value, where everyone's careers can be promoted and developed in the same way. There is no innovation without diversity and there is no improvement without plurality.\n\n</em>Are you ready?\n\nJob Segment:    Database, Engineer, Developer, Equity, Java, Technology, Engineering, Finance",
        "skills": [
          "Java",
          "Python",
          "Azure"
        ]
      },
      {
        "title": "Software Engineer - Spain, Czechia Remote",
        "company": "Vista",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "Remote",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "91 people clicked apply",
        "salary": "",
        "posted": "Reposted 4 days ago",
        "description": "Who We Are\n\nCimpress Technology develops cutting-edge, best-in-world software that our mass customization businesses use to create personalized products for over 17 million global customers. Our Mass Customization Platform is comprised of modular, multi-tenant services. Our businesses can choose the solutions that work for them, or assemble any custom combination they need. This makes it easier and faster to do things like introduce new products, reach customers and track orders. And this kind of innovation keeps customers coming back. Just last year, Cimpress generated $2.88B in revenue through customized print products, signage, apparel, packaging and more.\n\nWe encourage our engineers to think like an owner – to continue to act small as we grow. Every team defines their own roadmaps, and uses the programming languages and technologies that suit them best. This helps us have a big impact at the enterprise level while still feeling small and nimble.\n\nWhat You Will Do\n\nAs a software engineer on Content Asset Management, you will work as part of a team at the center of what makes Cimpress unique: our graphic design content. Engineers within Content Asset Management design and develop products that enable graphic designers at Cimpress to create beautiful and flexible designs as well as manage the complexity of a design catalog containing millions of design assets. These designs are the starting point for our customers to create a wide range of personalized products for themselves and their businesses. We strive to lead the market in tools that make high-quality design accessible to non-professionals.\n\n      -Be part of a motivated team that is passionate about delivering impactful work to delight our customers.\n-Contribute to the design and development of software for Content Asset Management.\n-Write code in our modern stack: C# + .NET Core on the back-end and React.js + Typescript on the front-end.\n-Work with Product Managers and engineers on the technical design of new features and drive delivery.\n-Review code, build and run automated tests, deliver documentation, promote technical standards, and do anything else you deem vital to deliver high quality, maintainable, robust code.\n-Work in an environment where agile and iterative software development practices are embraced.\n-Influence the team's performance and growth through collaboration.\n\n\n\nYour Qualifications\n\nAt Cimpress, we value the experiences that individual team members add to our culture! Please don't hesitate to apply even if you don't meet the exact qualifications, we look forward to learning more about you!\n\n      -1+ year of proven experience writing commercial software.\n-Experience writing object-oriented back-end software, working in service-oriented architecture, as well as building web-based user interfaces.\n-Excellent oral and written communication skills. Fluency in English.\n-Strong collaborative mindset with teammates and stakeholders.\n-Passionate and enthusiastic about software engineering and learning in general.\n-Bachelor’s Degree in Software Engineering field, or equivalent work experience in relevant technical domain.\n\n\n\nNice To Have\n\n      -College-level courses in the fundamentals of computer science: data structures and algorithms, computer languages, operating systems, etc.\n-Experience writing back-end microservices and database programming (SQL and NoSQL).\n-Experience writing back-end software in C# + .NET Core.\n-Experience writing front-end software in React, Typescript.\n-Experience writing software hosted in the cloud. AWS a plus.\n\n\n\nWhy You'll Love Working Here\n\nBeing at Cimpress means that you don’t see work as just a building, a desk or a manufacturing floor. You see it as a chance to take a step forward in your career journey – and your life. We strive to give you everything you need to learn, grow, and succeed. Through innovation, collaboration, and perpetual exposure to what’s next, we’re always pushing boundaries and broadening our horizons. We embrace the chance to operate outside of our comfort zone to discover what we’re capable of. Some might call that a challenge; we just call it another great day at work.\n\nWe're Remote-First\n\nIn 2020, Cimpress adopted a Remote-First operating model and culture. We heard from our team members that having the freedom, autonomy and trust in each other to work from home and, the ability to operate when they are most productive, empowers them to be their best. Cimpress also provides collaboration spaces for team members to work physically together when it's safe to do so and when in-person collaboration will deliver the best results.\n\nAbout Us\n\nLed by founder and CEO Robert Keane, Cimpress invests in and helps build customer-focused, entrepreneurial mass customization businesses. Through the personalized physical (and digital) products these companies create, we empower over 17 million global customers to make an impression. Last year, Cimpress generated $2.88B in revenue through customized print products, signage, apparel, packaging and more. The Cimpress family includes a dynamic, international group of businesses and central teams, all working to solve problems, build businesses, innovate and improve.\n\nCommitment To Diversity, Equity, & Inclusion\n\nWe believe in the unique contributions of everyone within a diverse global organization. We are collaborative, inclusive, and innovative. We strive to role model and live an inclusive culture of fairness, respect and belonging for all. And we work together to empower each other, creating a space in which each of us can spark our next great idea.\n\nEqual Opportunity Employer\n\nCimpress Tech, a Cimpress company, is an Equal Employment Opportunity Employer. All qualified candidates will receive consideration for employment without regard to race, color, sex, national or ethnic origin, nationality, age, religion, citizenship, disability, medical condition, sexual orientation, gender identity, gender presentation, legal or preferred name, marital status, pregnancy, family structure, veteran status or any other basis protected by human rights laws or regulations. This list is not exhaustive and, in fact, in many cases, we strive to do more than the law requires.",
        "skills": [
          "C#",
          "React",
          "AWS"
        ]
      },
      {
        "title": "Software Engineer - Intern",
        "company": "Datadog",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": null,
        "job_type": "Internship",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "We’re looking for interns to join us to help collect, aggregate, visualize, and analyze high-scale metrics, logs, and application data. Software engineering at Datadog includes a variety of exciting opportunities across backend, frontend, infrastructure, libraries, data engineering, and data science. Interested in distributed systems or Kubernetes across tens of thousands of nodes? Looking to build out products like CI Visibility or Cloud Security Management or perhaps join one of our internal teams helping engineering teams ship apps quickly? Want to see your work actually impact and improve the product in a meaningful way? We’ve got you covered. Whether you’re writing a new integration, building data pipelines, or working with the open-source community, our interns are key contributors to our product.\n\nDatadog offers the unique opportunity to work on large-scale, real-time systems by engineers for engineers. Our product is multi-cloud and collects more than a hundred trillion events per day for 28,000+ customers. Interns work towards the same objectives as their teammates to bring impact to Datadog that persists even after the internship concludes.\n\nWe place value in our office culture - the relationships that it builds, the creativity it brings to the table, and the collaboration of being together. Our hybrid workplace ensures our employees can create a work-life harmony that best fits them.\n\nStudents can sign up anytime for a free  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/blog/datadog-github-student-developer-pack/\" data-test-app-aware-link=\"\">Datadog Pro account</a>!\n\nWhat You’ll Do:\n\n      -Solve scaling bottlenecks in critical services to grow Datadog for its expanding customer base\n-Deploy new features to production and contribute to projects that have a tangible impact on customers across Datadog’s user base\n-Develop your tech stack through technologies such as Kubernetes, Bazel, and many more while receiving mentorship from the best engineers in the industry\n-Grow alongside a diverse cohort of talented interns while working in a fun and collaborative environment  \n\n\n\nWho You Are:\n\n      -You will graduate in 2025 with a degree in computer science, software engineering, or a related subject from a university in Spain\n-You have strong computer science fundamentals (data structures, algorithms, software design, to name a few)  \n-You are comfortable coding in one or more programming languages  \n-You value code simplicity and performance  \n-You want to work in a fast-paced environment that values its employees and customers\n-You are a self-starter who enjoys partnering with other engineers and solving difficult problems  \n-You are available for a full-time or part-time internship starting in February or March 2025 (we are unable to accommodate internships starting at any other time)\n      -For part-time opportunities, you are expected to work from the Datadog Madrid office each day\n\n-You are looking for a curricular internship and have the option of continuing with an extracurricular internship\n\n\n\nDatadog values people from all walks of life. We understand not everyone will meet all the above qualifications on day one. That's okay. If you’re passionate about technology and want to grow your skills, we encourage you to apply.  \n\n</em>Benefits and Growth:  \n\n      -Opportunities to work with teammates in-office and across the globe on meaningful challenges that will keep you thinking\n-Intradepartmental mentor and buddy program for in-house networking\n-In-person intern cohort and monthly company social events\n-An inclusive company culture, ability to join our Community Guilds (Datadog employee resource groups)\n-Relocation support  \n-Unlimited snacks and drinks in our office; catered lunches on Monday, Wednesday, and Friday\n-Beautiful offices in convenient locations\n\n\n\nBenefits and Growth listed above may vary based on the country of your employment and the nature of your employment with Datadog.\n\n</em>Please ensure that you submit your CV/resume in English.\n\nAbout Datadog:  \n\nDatadog (NASDAQ: DDOG) is a global SaaS business, delivering a rare combination of growth and profitability. We are on a mission to break down silos and solve complexity in the cloud age by enabling digital transformation, cloud migration, and infrastructure monitoring of our customers’ entire technology stacks. Built by engineers, for engineers, Datadog is used by organizations of all sizes across a wide range of industries. Together, we champion professional development, diversity of thought, innovation, and work excellence to empower continuous growth. Join the pack and become part of a collaborative, pragmatic, and thoughtful people-first community where we solve tough problems, take smart risks, and celebrate one another. Learn more about #DatadogLife on  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.instagram.com/datadoghq/?hl=en\" data-test-app-aware-link=\"\">Instagram</a>,  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.linkedin.com/company/datadog\" data-test-app-aware-link=\"\">LinkedIn,</a>  and  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://learn.datadoghq.com/\" data-test-app-aware-link=\"\">Datadog Learning Center.  \n\n</a>Equal Opportunity at Datadog:\n\nDatadog is an  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/affirmative-action-statement\" data-test-app-aware-link=\"\">Affirmative Action</a>  and  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.eeoc.gov/sites/default/files/2022-10/EEOC_KnowYourRights_screen_reader_10_20.pdf\" data-test-app-aware-link=\"\">Equal Opportunity Employer</a>  and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. Here are our  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/legal/candidate-legal-notices/\" data-test-app-aware-link=\"\">Candidate Legal Notices</a>  for your reference.\n\nYour Privacy:\n\nAny information you submit to Datadog as part of your application will be processed in accordance with Datadog’s  <a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.datadoghq.com/legal/applicant-candidate-privacy/\" data-test-app-aware-link=\"\">Applicant and Candidate Privacy Notice</a>.",
        "skills": [
          "Kubernetes"
        ]
      },
      {
        "title": "Ruby - Elixir Backend Engineer",
        "company": "E-Frontiers",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "12",
        "salary": "",
        "posted": "18 hours ago",
        "description": "¿Quieres aprender a desarrollar en Elixir?Desde e-Frontiers estamos buscando profesionales con perfil fullstack o backend con experiencia en RoR o Erlang...en desarrollo web y/o de software, y que quieran familiarizarse y trabajar con Elixir. Estamos ayudando a una empresa tecnológica de producto propio cuya herramienta ayuda al crecimiento de empresas, webs y comercios electrónicos (contratación directa con cliente final).Funciones:      -Trabajarás en el equipo de desarrollo, principalmente donde además aprenderás a desarrollar con Elixir y utilizar otras tecnologías como AWS y Phoenix .\n-Muchos de sus servicios están basados en Python o RoR, por lo que si tienes experiencia con alguno de estos lenguajes será un plus.\n-Contribuir al desarrollo del sistema ayudando en su diseño e implementación.\n-Garantizar el trabajo en equipo.\n\n\nRequisitos:      -Al menos 4 años de experiencia en backend con alguno de estos lenguajes: RoR, Erlang, Go...\n-Interés y motivación por aprender Elixir.\n-Experiencia en front: JS, HTML, CSS...\n-Nivel de inglés medio: suficiente para entender documentación técnica y poder intercambiar emails.\n\n\nValorable:      -Muy valorable experiencia previa en Python, Elixir, Erlang, Phoenix, RoR...\n-Muy valorable experiencia con AWS.\n-Experiencia en proyectos basados en microservicios.\n-Experiencia en UX sería un plus.\n\n\nCondiciones:      -Contrato indefinido y directo con cliente final.\n-Seguro de salud.\n-Modelo de trabajo remoto o híbrido en base a tus necesidades.\n-Horario flexible.\n-Actividades de formación para equipos.\n-Salario: 35.000€ - 50.000 € en base a años de experiencia (aunque la franja es negociable).\n\n\n¿Quieres saber un poco más? Inscríbete y te llamaremos para entrar en detalles.",
        "skills": [
          "Elixir",
          "AWS",
          "Python",
          "Erlang",
          "Go",
          "HTML",
          "CSS"
        ]
      },
      {
        "title": "Big Data Developer - SCIB Málaga",
        "company": "Santander Corporate & Investment Banking",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "20 people clicked apply",
        "salary": "",
        "posted": "6 days ago",
        "description": "Country: Spain\n\nSCIB/ SDS is looking for a Big Data Developer  in our Málaga office.\n\nWHY YOU SHOULD CONSIDER THIS OPPORTUNITY\n\nAt Santander CIB (<a class=\"app-aware-link \" target=\"_blank\" href=\"http://www.santandercib.com/\" data-test-app-aware-link=\"\">www.santandercib.com</a>) we are key players in the transformation of the financial sector. Do you want to join us?\n\nSantander Corporate & Investment Banking (Santander CIB)  is Santander's global division that supports some of the world's most complex and sophisticated corporate and institutional clients, offering customized services and value-added wholesale products to best meet their needs.\n\nWe embrace a strong risk culture and all our professionals at all levels are expected to take a proactive and responsible approach toward risk management.\n\nSantander is proud of being an organization where there are equal opportunities regardless of gender identity, culture, and disability. Our mission is to contribute to help more people and business prosper.\n\nWhat You Will Be Doing\n\nAs a  Big Data Developer,  your mission will be to develop,  test and deploy the technical and functional specifications from the Solution Designers / Business Architects / Business Analysts, guaranteeing the correct operability and the compliance with the internal quality levels.\n\nWe need somebody like you to help us in different fronts:\n\n      -You will develop end-to-end ETL processes with Spark/Scala. This includes transferring data from/to the data lake, technical validations, business logic, etc.  \n-You will use Scrum methodology and be part of a high-performance team.  \n-You will document your solutions in the Group Santander tools: JIRA, Confluence, ALM…  \n-You will certify your delivery and its integration with other components, designing and performing the relevant test to ensure the quality of your team delivery.  \n\n\n\nExperience\n\n      -At least 2 years of experience working with Spark with Scala, software design patterns, and TDD.  \n-Experience working with Big Data environment – Hadoop, Hive is a must – Azure Databricks be a plus.  \n\n\n\nEDUCATION\n\n      -Bachelor's degree in Computer Science/Telecommunications, Mathematics or related studies.  \n\n\n\nSkills & Knowledge\n\n      -Experience and expertise across data integration and data management with high data volumes.  \n-Experience working in agile continuous integration/DevOps paradigm and tool set (Git, GitHub, Jenkins, Sonar, Nexus, Jira).  \n-Experience with different database structures, including (Postgres, SQL, Hive).  \n-English: at least B2 is a must.  \n\n\n\nIf you want to know more about us, follow us on:  \n\n</em><a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.linkedin.com/company/santander-corporate-investment-banking/\" data-test-app-aware-link=\"\">https://www.linkedin.com/company/santander-corporate-investment-banking/\n\n</a></em><a class=\"app-aware-link \" target=\"_blank\" href=\"https://es.linkedin.com/company/banco-santander\" data-test-app-aware-link=\"\">https://es.linkedin.com/company/banco-santander\n\n</a></em><a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.betechwithsantander.com/en/home\" data-test-app-aware-link=\"\">https://www.betechwithsantander.com/en/home\n\n</a></em>#SCIB",
        "skills": [
          "Spark",
          "Scala",
          "Hadoop",
          "Azure",
          "Jenkins",
          "SQL"
        ]
      },
      {
        "title": "Data Engineer - Negocio",
        "company": "Huxley",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "31 people clicked apply",
        "salary": "",
        "posted": "2 days ago",
        "description": "En Huxley estamos buscando un Data Engineer para unirse al equipo de Data de un proyecto de digitalización bancaria en pleno crecimiento. El candidato ideal debe tener experiencia en Python y PySpark, así como habilidades para interactuar con el negocio.  De manera más detallada, el  perfil  que buscamos es el siguiente:        -Data Engineer con experiencia en Python y PySpark, será tu día a día.  \n-Experiencia con cloud, preferiblemente AWS (S3, athena...).\n-Experiencia en bases de datos con SQL, PostgreSQL o HDFS.\n-Experiencia en toma de requerimientos técnicos. Tnedrás contacto con negocio continuamente.\n\n  Se valorará:        -Herramientas de visualización de datos (Tableau o Power BI).  \n-Experiencia en Orquestación de datos.\n-Experiencia previa en banca.  \n\n  Condiciones:        -Modalidad: Híbrido 2 días de oficina.  \n-Sede: Madrid.  \n-Salario competitivo según experiencia.  \n-Contrato con Huxley.  \n\n  En caso de que tu perfil cuadre con los requerimientos, no dudes en aplicar y me pondré en contacto contigo lo antes posible.",
        "skills": [
          "Python",
          "PySpark",
          "AWS",
          "SQL",
          "PostgreSQL"
        ]
      },
      {
        "title": "#DISCOVER I 2025-2026 Internship as Method Engineer",
        "company": "Airbus Aircraft",
        "location": "Greater Algeciras Metropolitan Area",
        "workplace": "Hybrid",
        "job_type": "Internship",
        "level": null,
        "applicants": "34 people clicked apply",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "Job Description\n\nReady to join one of our Graduate Programs in Spain?\n\nAIRBUS offer more than 70 vacancies for our full time graduate program in Spain - #DISCOVER I 2025/2026 - Starting date March 3rd 2025\n\nWe are looking for recent graduates from different disciplines interested in developing their professional career in the aeronautical sector.The current context demands different ways of looking, thinking and relating.\n\nWhat does this internship consists in?\n\nTogether with Camilo José Cela University, Airbus has developed an exclusive program (#DISCOVER) designed for those interested in the best training in new areas of knowledge essential to be able to develop as professionals of the future.\n\nYou will have the opportunity to study a Master, organized in three training blocks, that will allow you to DISCOVER the skills most in demand today. It will be combined with an 11 month internship at Airbus in an area related to your degree, where you can learn and complete your academic background.\n\nThe start of the internship will be in early March 2025, and will last 11 months (August disabled for all purposes). It is a full-time experience (40h/week), in which you will receive an attractive study grant.\n\nInternship Job Description\n\nWe are looking someone to support Manufacturing Engineering. You will help Manufacturing Engineering reinforcing Performance Management activities, Contribute in Augmented & Virtual Reality projects, Artificial Intelligence projects and to the transition towards predictive and prescriptive analytics to get ready for the future Airbus challenges.\n\nResponsibilities - Your Mission\n\n      -In your role, you will be responsible to implement data analytics needs for Manufacturing Engineering.\n-Capture and analyze data analytics use cases from the business\n-Develop, maintain and update key performance indicators\n-Develop proof of concepts/prototypes with a strong focus on predictive and prescriptive analytics to support existing initiatives e.g. Eliminate non-added value activities by proactively automating recurrent analytics and performance management tasks\n-Support the industrialization of KPIs and proof of concepts with the central.\n\n\n\nThis role will give you the opportunity to discover many key strategic projects and work with many different stakeholders within and outside of Manufacturing Engineering.\n\nRequired skills #AirbusDiversity\n\nAs a successful candidate, you will be able to demonstrate the following skills and experience:\n\n      -  Master or Bachelor degree in IT or Data Science. Some Engineering degrees could be also helpful.\n-  Advanced level of English. Spanish is a must: advanced level.\n-  Technical & Analytical Skills: Knowledge of data analytics/big data solutions. - Prior experiences with Qlik Sense, Skywise (Palantir), Google Data Studio as well as Python Software Development, including modules for data engineering/machine learning such as Pandas, Scikit-Learn, Tensorflow and PyTorch will be a plus\n-  Ability to translate business problems into meaningful insights\n-  Ability to work in a multicultural environment\n\n\n\nSoft Skills\n\n      -  Structured, self-organized and collaborative way of working,\n-  Strong communication towards diverse audiences (incl. senior management) and strong networking skills,\n-  Creativity and appetence for problem solving,\n-  Customer orientation to provide user-centric solution\n\n\n\nWhy should you apply?\n\n      -  Foster your professional development with a strong academic background and an in-depth collaboration in AIRBUS projects.\n-  Expand your network within the aeronautical industry.\n-  Meet our people working with passion and determination to make the world a more connected, safer and smarter place.\n-  Be part of our diversity and teamwork culture that propel us to accomplish the extraordinary - on the ground, in the sky and in space.\n\n\n\nAre you interested? Apply and make it fly!\n\nThis job requires an awareness of any potential compliance risks and a commitment to act with integrity, as the foundation for the Company’s success, reputation and sustainable growth.\n\nCompany\n\nAirbus Operations SL\n\nEmployment Type\n\nInternship\n\nExperience Level\n\nEntry Level\n\nJob Family\n\nSupport to Management\n\nBy submitting your CV or application you are consenting to Airbus using and storing information about you for monitoring purposes relating to your application or future employment. This information will only be used by Airbus.\n\nAirbus is committed to achieving workforce diversity and creating an inclusive working environment. We welcome all applications irrespective of social and cultural background, age, gender, disability, sexual orientation or religious belief.\n\nAirbus is, and always has been, committed to equal opportunities for all. As such, we will never ask for any type of monetary exchange in the frame of a recruitment process. Any impersonation of Airbus to do so should be reported to emsom@airbus.com.\n\nAt Airbus, we support you to work, connect and collaborate more easily and flexibly. Wherever possible, we foster flexible working arrangements to stimulate innovative thinking.#YESPOST",
        "skills": [
          "Python",
          "Pandas",
          "PyTorch"
        ]
      },
      {
        "title": "Full stack software Developer Intern",
        "company": "Roche",
        "location": "Sant Cugat del Vallès, Catalonia, Spain",
        "workplace": null,
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 hours ago",
        "description": "Roche fosters diversity, equity and inclusion, representing the communities we serve. When dealing with healthcare on a global scale, diversity is an essential ingredient to success. We believe that inclusion is key to understanding people’s varied healthcare needs. Together, we embrace individuality and share a passion for exceptional care. Join Roche, where every voice matters.\n\nThe Position\n\nOur Engineering Team is looking for talented engineers who take pride in their contribution to the team. We are engineers and we contribute actively to the business strategy delivery.\n\nYou will be part of an ongoing transformation in the healthcare industry, working in one of the future product teams in Roche, responsible for creating an intuitive core platform that has a great impact on users.\n\nWe work with Agile methodologies. We are looking for Engineers to work in a cross-functional environment. She/he/they will join our current team in developing the best solutions for making sure that our systems are secure, efficient, and highly available.\n\nYOU WILL\n\n      -Participate actively in technical decisions\n-Design, develop, evolve, and scale software as the business grows\n-Take part in product experimentation/ideation\n-Create Software you're proud of using modern engineering approaches and agile principles\n-Own your deliverables from start to finish\n-Deliver high-quality solutions, focusing on testing and clean code principles\n-Deliver value early and often\n\n\n\nWE LOOK FOR\n\n      -Preferred Education: Recent graduates -no more than 3 years- with a University degree or Master of Math, Computer Science Degree, or MSc in Software Development\n-Self-organized and an owner, with flexible remote working we believe in trust and individual accountability for getting things done.  \n-A team player, who listens to their colleagues but is not afraid to assert them\n-A proactive person and comfortable with speaking up constructively\n-Comfort with uncertainty\n-Passionate and naturally curious\n-Looking to solve real-world problems and proposing actual plans\n-Not afraid to fail and learn\n\n\n\nWE OFFER\n\n      -A continuous learning environment.  \n-Opportunity to work in a project with a real impact on patients' lives\n-A mentor who will guide you and challenge you to think out of the box\n\n\n\nThis opportunity is part of the  START TECH program</em>, you can find more information about the\n\nprogram at the following link:<a class=\"app-aware-link \" target=\"_blank\" href=\"http://careers.roche.com/global/en/start-tech-program-spain\" data-test-app-aware-link=\"\">  https://careers.roche.com/global/en/start-tech-program-spain\n\n</a>At Roche, we believe in diversity and inclusion as essential values for our success. We have a special interest in integrating people with disabilities into our teams. If you have a disability, for us it is a plus, and we have special benefits for you: Go ahead and join us!\n\nWho we are\n\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\n\nRoche is an Equal Opportunity Employer.",
        "skills": [
          "Go"
        ]
      }
    ],
    "companies_data": []
  },
  {
    "scrape_time": "2024-11-13T19:46:22.375078",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": null,
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [],
    "companies_data": []
  }
]