[
  {
    "scrape_time": "2024-11-12T23:15:26.560089",
    "keywords": "Software Engineer",
    "location": "Spain",
    "company": null,
    "posted": [
      "Past day"
    ],
    "workplace": null,
    "job_type": null,
    "job_level": [
      "Internship",
      "Entry level"
    ],
    "benefits": null,
    "jobs_data": [
      {
        "title": "Desarrollador de eCommerce / Senior-Junior PHP Developer",
        "company": "Denox, Expertos en Comercio Electrónico",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "3 months ago",
        "description": "<p dir=\"ltr\">\nEn Denox llevamos más de 20 años creando soluciones y desarrollando tiendas online a medida. Fundada en 2004, a día de hoy somos unos de los proveedores de soluciones eCommerce a medida principales en España.\nEn todos estos años hemos creado, desarrollado y ayudado a crecer a cientos de tiendas hoy día líderes en sus sectores., siendo su equipo de IT de confianza.\nPara poder asumir los retos que nos vienen en los próximos meses, queremos incorporar 3 Nuevos Perfiles de PHP Developers / Desarrolladores eCommerce.\n¿Quieres formar parte de nuestra Agencia eCommerce?\nBuscamos a alguien que no se encargue de desarrollar por desarrollar, sino de entregar código de calidad, que tenga muy presente, metodologías y arquitecturas modernas de desarrollos. Una persona inquieta, que quiera formar parte de un equipo joven y dinámico, con muchas ganas de aprender y crecer juntos.\nEl equipo de Desarrollo se encarga de todo lo que tiene que ver con la  programación de las tiendas online:  <em>nuevas funcionalidades, integraciones y mejoras de funcionalidades diarias para nuestros clientes</em>.\nEn el último año estamos enfocados en buscar un crecimiento responsable de nuestra plataforma y en mejorar varios procesos internos en el flujo de desarrollo de la misma. Uno de los retos extras que tendrás junto al equipo es la de mantener nuestra plataforma de la que nacen las tiendas de todos nuestros clientes y añadir nuevas features. Y todo eso, paralelizando con el principal hito que tienen en el roadmap nuestro equipo: la migración del stack de la plataforma. Actualmente, parte del código es PHP/MySQL y estamos incorporando el desarrollo mediante patrones, arquitecturas, despliegues, test (CQRS, SOLID, DDD, TDD)...\nContarás con libertad, los medios necesarios para hacer tu trabajo y sobre todo formar parte de un equipo joven, con talento y muy buen rollo.\n¿Tus responsabilidades?-Formarte, formarte y estar en continua formación.\n-Trabajar con nuestro equipo interno y clientes definiendo requisitos de las nuevas funcionalidades solicitadas por clientes.\n-Analizar los requisitos y la información que tengas para recomendar y planificar la implantación de una nueva funcionalidad o la modificación de una funcionalidad existente.\n-Refactorizar, optimizar y mejorar la base de código existente para permitir el escalado de la aplicación.\n-Realizar código de CALIDAD siguiendo buenas prácticas.\n-Realizar tanto desarrollos y mantenimiento de la nueva versión (PHP con Symfony y Arquitecturas) como el mantenimiento de la actual (PHP/MySQL).\n-Realizar integraciones con terceros (pasarelas de pagos, transportistas, catálogos dropshipping, marketplaces etc) mediante WebServices SOAP, API REST… Muchas a día de hoy ya las tenemos desarrolladas pero ¡siempre surgen nuevas!\n-Llevar a cabo una buena documentación y control de las ramas en GIT de los proyectos en los que trabajes\n-Optimizar las bases de datos MySQL de las tiendas cuando sean necesarias. Reciben cientos de peticiones y tendrás que pelear con MySQL principalmente.  \n\n\n¿Qué requisitos debes de cumplir?  -Tener disponibilidad para incorporación inmediata en la empresa. Necesitamos a alguien para principios de SEPTIEMBRE.\n-Experiencia en el desarrollo web demostrable en PHP\n-Experiencia con Bases de Datos MySQL\n-Desenvolverse con HTML, CSS, Javascript, JQuery y el responsive no te suena a chino ni la compatibilidad entre dispositivos y diferentes navegadores. ¡Tranquilo! No te pediremos maquetar pero lo básico para adaptar ciertas funcionalidades en un proyecto ya maquetado cuando sea necesario\n-Muchos commits a tus espaldas en GIT.\n-Comentar y documentar forma parte de tu día a día.\n\n  ¿Qué sumaría un plus en tus conocimientos? ¡Vamos a por el 10/10!-Tienes experiencia en desarrollar sobre plataformas de eCommerce.\n-Tienes experiencia con Symfony\n-Tienes experiencia y conocimientos de Arquitecturas de Desarrollo\n-Tienes perfil en Github con código de proyectos propios, ¿mejor curriculum que eso?\n\n\nA nivel personal-Buena gente, sencilla y humilde\n-Trabajador pero siempre con alegría y positividad\n-Trabajar en equipo es clave, saber pedir ayuda y saber prestarla\n-Documentar forma parte de tu día a día.\n-Compromiso y sinceridad con la empresa\n\n\n¿Qué horario trabajaría?De Lunes a Viernes de 8h a las 17:30h con 1h para comer y los Viernes de 8h a 14h.\nEn los meses de verano tenemos jornada intensiva (Julio y Agosto).\nUna vez superado tu periodo de formación, podemos ajustar a un horario moderadamente flexible si tus situaciones personales lo requieren. El compañerismo y el trabajo en equipo es necesario, por ello, es importante que el equipo cuadre durante la jornada.  ¿Desde donde trabajaría?Nuestra empresa nace en Cádiz y actualmente nuestra oficina central se encuentra en Madrid, aunque parte del equipo trabaja en remoto.\nEl puesto actual ofrecido es para incorporar equipo en la oficina que tenemos en Madrid, en la Calle Cronos.  \n¿Qué te ofrecemos?-📡 Posibilidad de Trabajo Remoto puntualmente en ciertos dias.\n-🕓 Horario moderadamente flexible y horario intensivo TODOS los Viernes del año.\n-☀️ Además durante Julio y Agosto ¡jornada intensiva también!\n-🏖️ 30 días naturales de vacaciones\n-🎂La tarde libre el día de tu cumpleaños.\n-👨‍🎓Formación inicial para familiarizarte con nuestra plataforma eCommerce.\n-🌍 Participar en crear funcionalidades en los eCommerce de nuestros clientes que utilizan millones de personas en todo el mundo\n\n  \n¿Cómo es el proceso de selección y cómo puedo aplicar?  Necesitamos cubrir tres puestos de desarrolladores cuanto antes, por lo que vamos a agilizar el proceso bastante con idea de a principios de Septiemrbe poder comenzar con la formación.\nPara ello necesitamos que nos envíen el CV y Github / Portfolio o listado de enlaces de proyectos realizados junto con una breve descripción de las tareas realizadas cuanto antes.\nUna vez realizada una preselección inicial, el proceso consta de tan solo tres fases:\n-Entrevista con Israel Gaviño\n-Sesión de pair-programming / prueba para conocer cómo trabajan resolviendo un problema sencillo\n-Entrevista técnica final",
        "skills": [
          "PHP",
          "Symfony",
          "MySQL",
          "HTML",
          "CSS"
        ]
      },
      {
        "title": "Desarrollador de Delphi",
        "company": "Eurofins Megalab",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "70",
        "salary": "",
        "posted": "1 week ago",
        "description": "<p dir=\"ltr\">\nDesde  nuestra creación en 1988, hemos trabajado por consolidarnos día a día como un gran laboratorio de análisis clínicos. Tras más de 30 años de experiencia y una trayectoria acreditada, Eurofins Megalab es en la actualidad uno de los mayores laboratorios de España.\nHoy en día somos líder nacional en servicios, información, gestión y realización de pruebas diagnósticas de análisis clínicos y anatomía patológica. También lideramos la gestión de laboratorios intra-hospitalarios en el territorio nacional, con presencia en  más de 70 hospitales que dan servicio 24 horas los 365 días del año.\nContamos con una red de laboratorios que cubre todo el territorio nacional y ofrecemos nuestros servicios a todas las sociedades médicas, centros sanitarios y compañías de gestión hospitalaria. En nuestros laboratorios ofrecemos a nuestros pacientes y clientes alrededor de  5.000 tipos de test diferentes  y realizamos más de  50 millones de análisis anualmente.Todo ello haciendo uso de los últimos avances tecnológicos con el objetivo de ofrecer una respuesta eficaz y de calidad a nuestros pacientes.Actualmente buscamos un Desarrollador con experiencia en Delphi y capacidad para trabajar en proyectos versátiles. El candidato ideal tendrá un enfoque flexible para abordar problemas y trabajará con un equipo dinámico, desarrollando soluciones que integran múltiples tecnologías y bases de datos.\nRequisitos Técnicos:· Lenguaje de programación: Experiencia en Delphi, idealmente en alguna de sus versiones recientes (10 Seattle, 10.1 Berlin, 10.2 Tokyo, 10.3 Rio, 10.4 Sydney, 11 Alexandria, o 12.2 Athens).· Conocimientos adicionales: Deseable familiaridad con otros lenguajes de programación como .NET, PHP y HTML.· Entorno de desarrollo: Experiencia trabajando con Embarcadero como IDE principal.· Integración API: Experiencia desarrollando y consumiendo interfaces API REST para integración con sistemas externos.· Bases de datos: Conocimientos en SQL Server y PostgreSQL a nivel de programación y optimización de consultas.Competencias:· Inglés: Habilidades de comprensión lectora y comunicación oral.· Trabajo en equipo y atención al usuario: Capacidad de colaborar eficazmente con colegas y brindar soporte a usuarios finales.· Creatividad en la resolución de problemas: Flexibilidad e imaginación para proponer soluciones innovadoras.Si estas interesado/a en formar parte de Eurofins Megalab envía tu curriculum vitae a la siguiente dirección de correo electrónico: seleccion@ctes.eurofinseu.com.",
        "skills": [
          "Delphi",
          "PHP",
          "SQL",
          "PostgreSQL"
        ]
      },
      {
        "title": "Data Engineer (Data Vault) - Valencia",
        "company": "Key Talent Indicator",
        "location": "Alicante, Valencian Community, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "38 people clicked apply",
        "salary": "",
        "posted": "3 weeks ago",
        "description": "<p dir=\"ltr\">\n<a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.thewiseseeker.com/?utm_source=TWSTJS&utm_id=TWSMP\" data-test-app-aware-link=\"\">The Wise Seeker  </a>somos la empresa tecnológica de RRHH líder en la evaluación de talento sin sesgos.\nCon más de 15 años en el sector analizando las necesidades y exigencias del mercado laboral somos capaces de identificar el mejor talento para cada empresa gracias a nuestro equipo de profesionales y a la plataforma Saas integrada con Inteligencia Artificial.\nSomos eficientes, evaluamos el talento de manera objetiva, sin sesgos y cerramos el tiempo de contratación en tiempo record dando resultados óptimos.\nBuscamos Data Engineer para trabajar en modelo híbrido en Barcelona o Valencia para trabajar en cliente con experiencia necesariamente en Data Vault.\nLugar: Barcelona o Valencia\nFunc-iones\nColaboración con el Data Architect para el diseño del modelo lógico global en Data\n-  VaultDiseño e implementación del modelado físico en Data Vault en las Capas de RDV, BD\n-V e IMImplementación de Soft Business\n-  RulesDesarrollo de workloads de movimiento y transformación de datos alineado a la estrategia D\n-ataOpsElaboración de juegos de prueba y validación de\n\n  datos\nRequisitos\nTecnologías y conocimientos  -exigidos\nConocimientos en modelado Data Vault (experiencia míni\n-ma 1 año)Conocimient\n-os en SQLBBDD: Oracle, Postgresql,  \n-SnowflakeConocimientos en DBT  \n-y AirflowConocimientos en herramientas de Reporting\n-: PowerBIFormación en Grado de Informática  \n\no similar-\nValor\n-amos\nPyth\n-onLiq\n-uibaseK\n-afkaJ\n-enkinsCI/CDDisponer de certificaciones en las tecnología\n-s indi\n\ncadasInglés\nCompetencia-s\nSe valorará\nActitud positiva, proactiva  \n-y constructivaPensami\n-ento analíticoGan\n-as de aprenderBuena predisposi\n-ción al cambioCapacidad de trab\n-ajar en equipoPasión por el desarrollo y\n\n  la tecnol-ogía\nBeneficios\nCon\n-trato indefinidoJornada híbrida de 2 días oficina en Barcelon\n-a o en Valencia.Salario competitivo en función del perf\n\nil del candidato",
        "skills": [
          "Oracle"
        ]
      },
      {
        "title": "Software Engineer for AI powered CAD platform",
        "company": "Architechtures",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "3 weeks ago",
        "description": "<p dir=\"ltr\">\nCompany Description:ARCHITEChTURES – AI-powered Building Design  is a cutting-edge platform that leverages generative AI to revolutionize architectural design. By drastically reducing execution times from months to minutes, our platform enables architects and designers to create more efficient, precise, and innovative solutions. Our mission is to empower building design professionals to address the challenges of rapid urbanization and support sustainable global development. Architechtures is the result of extensive R&D investments in AI-based architectural design, yielding significant improvements in design accuracy and efficiency.\nRole DescriptionThis is a full-time on-site role for a Software Engineer  based at Architechtures' headquarters in Malaga.  The Software Engineer will collaborate closely with the technology development team, focusing on building new platform functionalities. Key responsibilities include working on the back-end web development, developing new algorithms, and contributing to the ongoing evolution and development of the platform. The role involves analyzing and proposing solutions to complex geometric problems and working with related data structures.  \nQualifications-Computer Science and Software Development skills\n-Experience with Grasshopper and Computational Design software\n-Back-End Web Development proficiency\n-Programming and Object-Oriented Programming (OOP) experience\n-Strong problem-solving and analytical skills\n-Bachelor's or Master's degree in Computer Science or related field\n-Experience with CAD / BIM software development and LLM is highly valued",
        "skills": []
      },
      {
        "title": "DevOps Engineer - Barcelona, Spain",
        "company": "FCM Travel Spain",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Contract",
        "level": "Entry level",
        "applicants": "72 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 week ago",
        "description": "<p dir=\"ltr\">\nHola,你好, Hej,  Salut!  \n\nAt FCM Lab, we are more than just a division; we are innovators at the forefront of corporate technology. As a pivotal part of FCM Travel and the expansive Flight Centre Travel Group - the 4th largest business travel agency globally with a presence in over 100 countries and we are dedicated to blending technology with human insight to enhance business travel worldwide.\n\nAbout Your Opportunity...\n\nOur team develops internal products and solutions to ensure that our customers have an enjoyable experience throughout their time with us. To do so we utilise several webapps: A travel platform, a small CRM, a reporting tool, a tool for travel proposals, etc.\n\nAs our DevOps Engineer, you will evolve and maintain our infrastructure that consists of many virtual servers and containers clusters, and a few managed databases. Additional responsibilities are as follows:\n\n-  Be responsible for the CI/CD process  \n-  Decide on the update or renew of the architecture  \n-  Take part in the software cycle with the rest of the development team  \n-  Ensure the systems are securitized  \n-  Report to the CTO of the Lab  \n\n\n\n\nWhat We Are Looking For...\n\n-  The candidate should have a passion for automation and optimization.  \n-  Ideate and contribute to projects that increase overall efficiency/performance of the engineering team.  \n-  Bring expertise on troubleshooting application, database, and networking performance and failures.  \n-  Continually identify areas for process improvement in the production environment and develop appropriate resolutions.  \n-  Experience with Cloud providers (DigitalOcean, Azure, AWS, GCP, OVH).  \n-  Proficient with the command line, shell/Python scripting, and configuring systems monitoring tools.  \n-  Experience with tools such as Terraform, Chef, Puppet, Ansible, SaltStack, etc.  \n-  Experience with configuration management, monitoring, and automation tools.  \n-  Linux administration skills.  \n-  Experience with Kubernetes and Docker.  \n-  Experience building CI/CD pipelines.  \n-  Experience maintaining web projects (Nginx, RoR, PostgreSQL, etc.).  \n-  Knowledge of security principles.  \n-  Spoken and/or written English (French is a plus).  \n\n\n\n\nContract type:  Initial 12 month contract (with possibility to extend)\n\n  Location:  Plaza Catalunya, Barcelona (or remote from Spain)\n\nWho We Are...\n\nSince our beginning, our vision has always been to open up the world for those who want to see.\n\nAs a global travel retailer, our people come from all different backgrounds, and our connections spread to the far reaches of the globe. Together, we are a family (we call ourselves Flighties ).\n\nWe encourage you to  DREAM BIG  through collaboration and innovation, and make sure you are supported to make incredible ideas a reality. Together, we deliver quality, innovative solutions that delight our customers and achieve our strategic priorities.\n\nIrreverence. Ownership. Egalitarianism.  \n\n#FCMSP#FCMBL",
        "skills": [
          "Azure",
          "AWS",
          "GCP",
          "Kubernetes",
          "Docker",
          "PostgreSQL"
        ]
      },
      {
        "title": "iOS Developer",
        "company": "Digidentity",
        "location": "Seville, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "<p dir=\"ltr\">\nComo fundador y CTO de Digidentity, un pionero en identidad digital durante 16 años, enfrentamos una emocionante transición: pasar de una identidad  centralizada  a una  descentralizada. Nos espera una era híbrida llena de innovación.\n¿Eres un  iOS Developer  con experiencia y la motivación para generar impacto? Únete a nosotros en  Sevilla o Madrid  y ayuda a dar forma al futuro de la identidad digital segura.  Tu impulso y visión marcarán la diferencia  en esta transformación.\n¿Listo para ser parte de este viaje?  ¡Conectemos!  https://careers.digidentity.eu/sr-ios-developer/en",
        "skills": []
      },
      {
        "title": "Engineer",
        "company": "Westinghouse Electric Company",
        "location": "San Sebastián de los Reyes, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 1 week ago",
        "description": "<p dir=\"ltr\">\nIngeniero/a de sistemas para el SECTOR AEROESPACIAL\n\nBuscamos Ingenieros / as, para reforzar la Organización de Proyectos Aeronáuticos.\n\nFormarán parte de un equipo de personas que se desarrollará tanto a nivel técnico como de gestión, y participaran en proyectos de suministro de sistemas robotizados de inspección por ensayos no destructivos (principalmente ultrasonidos) dirigidos al control de calidad de piezas aeronáuticas e incluyendo las fases de diseño, fabricación, montaje, puesta a punto y pruebas de aceptación. Las actividades se realizarán tanto en nuestras instalaciones en la Sede de San Sebastián de los Reyes como en las plantas de los clientes en territorio nacional e internacional.\n\nUn ingeniero de sistemas agrupa el conocimiento en un gran número de tecnologías; robótica y control, software avanzado y ensayos no destructivos (ultrasonidos) entre las más importantes.\n\nLos Ingenieros De Sistemas Participan En Actividades Que Actúan Sobre El Sistema Completo Para Cumplir Con Su Objetivo Final De Funcionamiento\n\n-  Análisis de viabilidad e inspeccionabilidad de las piezas del cliente.\n-  Análisis de requisitos y especificaciones de clientes. Trasladar requisitos de clientes a soluciones específicas para ofertar. Valoraciones técnicas y económicas para las ofertas.\n-  Especificación de los requisitos para los sistemas a desarrollar.\n-  Diseño de la arquitectura y configuración de sistemas/productos/servicios en el ámbito de negocio de Productos Aeronáuticos.\n-  Verificación del diseño del sistema y validación funcional.\n-  Participación en las fases de puesta a punto, pruebas de aceptación y entrega a cliente.\n-  Apoyo al área comercial en la prospectiva e identificación de oportunidades, así como en las negociaciones de carácter técnico.\n-  Vigilancia de las tecnologías y productos/servicios relacionados con la ingeniería de sistemas de inspección.\n\n\n\nRequisitos\n\n-  Titulación de grado o máster en ingeniería mecánica, electrónica, química, de materiales u otras de rama técnica.\n-  Disponibilidad para realizar desplazamientos frecuentes a los emplazamientos donde se instalen los sistemas de inspección, tanto nacional como internacionalmente.\n\n\n\nNivel de inglés mínimo B2, valorándose mayor nivel y otros idiomas.",
        "skills": []
      },
      {
        "title": "DEVOPS Engineer",
        "company": "OBRAMAT",
        "location": "Leganés, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "14 people clicked apply",
        "salary": "",
        "posted": "1 week ago",
        "description": "<p dir=\"ltr\">\nOBRAMAT  (antes BRICOMART) es la empresa de referencia de distribución de Materiales en el mercado de la Reforma y Construcción integrada en GRUPO ADEO, primer grupo en el ranking europeo en distribución especializada en el acondicionamiento del hogar y tercero en el ranking mundial, matriz de empresas como Leroy Merlín, Bricoman, Saint Maclou, KBane, Weldom y Adeo Services.\nActualmente, contamos con 38 Almacenes a nivel nacional y ya somos cerca de 6.000 colaboradores/as comprometidos/as con nuestro proyecto de empresa.\nNuestro compromiso fundamental se encuentra en las personas: nuestros Colaboradores/as y nuestros Clientes. Son ellos los que dan vida a OBRAMAT y nuestra razón de ser.\nNos esforzamos día a día por ofrecer a todos nuestros Clientes la mejor experiencia de compra, basada en un asesoramiento profesional. Para esto, el talento de nuestros Equipos es nuestro principal pilar.\n¿CUÁL SERÁ TU MISIÓN?  🕵🏻\nQueremos reforzar el área de Operaciones,Tecnología y Servicios con un perfil DEVOPS. Esta persona será la encargada de diseñar, implantar y mantener la metodología DevOps.\n¡ERES UNA PIEZA FUNDAMENTAL EN EL EQUIPO! Tus funciones serán  🔧:\n-  Asegurar una mayor agilidad e integración continua de los desarrollos.  \n-  Automatizar los procesos de operaciones.  \n-  Automatizar los procesos QA.  \n-  Modelizar las prácticas inner source.  \n-  Trabajar con los modelos de integración y distribución continuas.  \n-  Desarrollar la gobernanza del modelo DEVOPS.  \n-  Implantar metodología SDLC de desarrollo software.  \n\n\n¿CUÁL ES NUESTRO PERFIL IDEAL?  🤩\nFormación : FP2/Ingeniería Informática o Telecomunicaciones.\nExperiencia mínima de 3 años desempeñando el rol.\nNivel de Inglés, al menos B2+ (comunicación oral y escrita fluida)\nConocimiento en plataformas cloud, preferentemente google.\n¿QUÉ TE OFRECEMOS POR TENER LA SANGRE NARANJA?  🧡\n-  Contrato indefinido a jornada completa ✍🏻 en una empresa de sólidos resultados, con un plan de expansión ambicioso a nivel nacional e internacional, y que forma parte de uno de los grupos líderes en la distribución en Europa 🥇\n-  Sistema Flexible e híbrido: 2 días teletrabajo 🏠 + 3 en la oficina 💻\n-  Salario Competitivo + Variable trimestral por ventas + Variable anual por reparto de beneficios 💰\n-  Conviértete en accionista del grupo ADEO 📈\n-  Plaza de Parking 🚗\n-  Plan de retribución Flexible 🤸🏻\n-  50% del seguro de salud pagado por la empresa 😷\n-  25 días laborables de vacaciones 🌴\n-  Día de tu cumpleaños libre! 🥳\n-  10% de descuento en tus compras OBRAMAT 🛒\n-  Cesta de Navidad 🎄\n-  Seguro de vida 🌈\n-  Descuentos en tus compras de Ocio, Belleza, Tecnología... Gracias a nuestro programa de fidelización \"Te lo mereces\" 😉\n-  Plan personalizado de formación para potenciar las oportunidades de crecimiento dentro de la Compañía 🎓\n\n\n(Todos los proyectos de desarrollo profesional de OBRAMAT consideran la igualdad de trato entre hombres y mujeres de acuerdo con lo establecido en la vigente normativa, así como lo establecido en nuestro Plan de Igualdad. Nuestra decisión de contratación estará basada únicamente en criterios objetivos de profesionalidad, de méritos y de capacidad).",
        "skills": []
      },
      {
        "title": "Full Stack Engineer",
        "company": "Sonas Wedding Venue Software",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100",
        "salary": "",
        "posted": "2 weeks ago",
        "description": "<p dir=\"ltr\">\nWho are we?Sonas is an all-in-one solution for wedding venue owners, designed to support marketing, sales, and events teams so they can consistently deliver perfect weddings. As we continue to grow, we're looking to expand our team to elevate our offerings and improve the user experience.\nWho are we looking for?We’re seeking a passionate  Full Stack Developer  who enjoys solving problems and delivering solutions for users. Ideally, you'll have a solid background with a few years of experience, but if you're still growing your skill set and eager to learn, we’d love to hear from you. This is a full-time role, and we’re looking for someone based in  Madrid.You'll work with the latest technologies, troubleshoot client issues, contribute to future releases, and occasionally dive into DevOps when needed. We’re a small, tight-knit team, so everyone shares onboarding and support responsibilities, keeping us connected to our users.\nMust-Have Skills:-At least 2 years of work experience with  NodeJS  (4 years preferred).\n-Proficiency in  MongoDB  query writing and index creation, with at least 1 year of experience (2 years preferred).\n-1 year of experience with  TypeScript  (2 years preferred).\n-Solid grasp of  JavaScript  (2+ years) including documentation and test writing (4 years preferred). Bonus points if you know  Playwright  or  Jest.\n-Experience with  HTML, CSS, and frameworks like  Bootstrap.\n-Ability to use  git  to create flow, not chaos.\n\n\nNice-to-Have Skills:-Familiarity with  MeteorJS.\n-Comfortable with  AWS services  like EC2, Lambda, SNS, and S3.\n-Experience integrating with payment processors like  Stripe.\n-Basic knowledge of accounting software like  Xero  or  QuickBooks.\n-Experience building APIs and integrating with automation platforms like  Zapier  or  Make.\n-Exposure to  React, Vue,  or  Svelte  (we currently use Blaze, but we plan to migrate).\n\n\nAnd what about English?Since our clients are primarily English-speaking, a good command of English is important. But don't worry, we’re not looking for perfection! If you’re proficient and willing to improve, we’re happy to help you develop your English skills further.\nWhat’s in it for you?We offer a flexible work environment. Most of our team works from our Madrid office in the mornings, then from home in the afternoons. You'll also have a lot of creative input in designing and implementing new features, as well as the freedom to shape your role as the company evolves.-Full-time  position.\n-Salary range of 30-40k, depending on experience:\n-Higher salaries are reserved for candidates with 4+ years of full-stack experience.\n-Less-experienced candidates will start closer to the lower end, with opportunities for growth as they develop.\n\n\nA Few Important Notes:-This role is only open to candidates based in Madrid or those willing to commute—no relocation provided.\n-Sorry,  recruiters: we’re not looking for outside help.\n-While we value all learning experiences, we do not count  bootcamps  or developing  personal projects  as professional work experience.\n\n\nHow to apply?We know you’re busy and probably applying to many jobs, so thanks for reading this far! To apply, email your CV and/or links to your GitHub or other work to  jobs@lytesoft.com, and please share a couple of sentences about why you're excited about this role and how you think you'd be a great fit. We look forward to hearing from you! 😁",
        "skills": [
          "MongoDB",
          "TypeScript",
          "JavaScript",
          "Playwright",
          "HTML",
          "CSS",
          "AWS",
          "React"
        ]
      },
      {
        "title": "Software Engineer (Malaga region, Spain)",
        "company": "SISU GROUP",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "1 month ago",
        "description": "<p dir=\"ltr\">\nSisu Group  is a fast growing startup founded by iGaming veteran Jan Svendsen, who previously founded Coolbet, NordicBet and Triobet - companies with a total exit value of over €240M. Sisu Group is on a mission to revolutionize the iGaming and online sports betting industry by creating the next-generation platform and products. Our offerings are 100% cloud-based, capable of seamless scaling across different regions and brands.\nSisu Group  is funded by staff and outside investors, with secured funding totalling appr. €21M. We currently have over 110 team members and are planning rapid growth for 2024.  The first brand, ReSpin.com, has just been launched, while the second brand  Epicbet  got life in June this year.\nWe're now looking for a Software Engineer to be part of creating the next-gen iGaming platform. If you're excited about starting fresh, without any technical baggage, Sisu Group is the place for you. Working hybrid - 4 in the office and a day remote.  \nYour role involves:-Designing and developing software solutions for business needs\n-Crafting clean, efficient, and easy-to-maintain code\n-Collaborating with diverse teams to gather and analyze requirements\n-Enhancing software performance, scalability, and reliability\n-Building and deploying cutting-edge, cloud-native automated software.\n\n\nWhat we're looking for:-Good English language proficiency\n-Eagerness to develop new services from the ground up\n-Interest in automation opportunities\n-Understanding of application lifecycle and agile workflows\n-Strong communication and teamwork skills\n-Genuine enthusiasm for the technologies and tools we use.\n\n\nOur tech stack includes:-Typescript & Node.js\n-PostgreSQL\n-Kafka\n-React / Preact\n-Google Cloud\n-Github\n-Monorepo\n-ArgoCD\n-Terraform (CDK)\n\n\nCompany Culture and Perks:At Sisu Group, we foster a positive and inclusive culture that values teamwork. Collaboration, open communication, and treating everyone as equals are at the heart of our values. We empower our employees to take initiative, own their work, and provide the support and resources for continuous growth.\nRecognising that our team is our greatest asset, we offer a competitive compensation package, including stock options, and generous paid time off. Building a great company is about more than just a successful product. It's about creating a community of passionate individuals. If you're eager to grow professionally, work with talented colleagues, and make a real impact, Sisu Group is the place for you. Join us in shaping the future of iGaming, now expanding our reach to the vibrant tech community in the Malaga region, Spain.  If you're looking for a company where you can grow professionally, work with talented and dedicated colleagues, and make a real impact, then Sisu Group is the place for you.<em>By submitting this application, the candidate agrees that Sisu Group stores personal details to be able to process the job application. Sisu Group follows and is compliant with the General Data Protection Regulation.</em>",
        "skills": [
          "Node.js"
        ]
      },
      {
        "title": "Test Engineer with Chinese language",
        "company": "JOYNEXT",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "18",
        "salary": "",
        "posted": "3 weeks ago",
        "description": "<p dir=\"ltr\">\nNESINEXT is seeking for  Test Engineer with Chinese  language to join our team.Work is mainly in business trips (from 1 month up to 2-3 months in a row)  This role focuses on the comprehensive testing of automotive cockpit systems, ensuring they meet our rigorous standards for quality, functionality, and user experience. The successful candidate will be instrumental in validating the performance of cockpit components, including infotainment systems, dashboards, in-car controls, and driver assistance technologies.\nNESINEXT, a subsidiary wholly owned by JOYNEXT, is headquartered in Ningbo, Zhejiang Province, China. Founded in 2021.\nResponsibilities and Requirements:-Conduct end-to-end testing of automotive cockpit systems to ensure the proper functioning of various components and features.\n-Design, execute, and maintain test cases to validate different aspects of the vehicle cockpit, including infotainment systems, dashboards, and in-car controls.\n-Perform user interface testing to ensure that dashboards and other control elements adhere to user experience standards and provide smooth operation.\n-Test the connectivity of cockpit systems, including Bluetooth, Wi-Fi, navigation systems, etc., ensuring reliable connections in different scenarios.\n-Test driver assistance systems within the vehicle cockpit, including features like AEB, ACC, BSD, LDW, ELK, etc.\n-Conduct performance testing to assess response times and stability of the cockpit system under different loads and conditions.\n-Check the performance of the cockpit system over extended periods to ensure no degradation or crashes occur.\n-Test cockpit systems under various climate and environmental conditions, including temperature, humidity, and high-altitude scenarios, ensuring functionality in diverse situations.\n-Conduct In-Vehicle OTA Testing. Remotely update in-vehicle software, firmware, and map data through wireless networks.\n-Track and document issues identified during testing, compile detailed test reports, and communicate results to the development team and relevant stakeholders.\n-Collaborate closely with other testing engineers, the development team, and product teams to ensure testing activities align with development and product requirements.\n\n\nSkill Requirements:-Hold  EU driver's license\n-English,  Chinese\n-Be ready to business trips\n-Experience in automotive cockpit testing with an understanding of various cockpit components or desire to learn\n-Familiarity with  testing tools like CANoe, CANalyzer, PCAN, multimeter, oscilloscope, etc.\n-Excellent problem-solving and communication skills.\n-Sensitivity to the automotive industry and awareness of the latest trends in cockpit technology.\n\n\nBenefits and Perks:-Attractive Salary.\n-Wonderful Working Environment.\n-Career Growth Opportunities.",
        "skills": []
      },
      {
        "title": "Software Designer / Concepteur(trice) logiciel",
        "company": "EXFO",
        "location": "Valencia, Valencian Community, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "<p dir=\"ltr\">\nWe are the telecom network test, monitoring and analytics experts—and we love what we do. With over 2,000 employees in more than 25 countries, we help the world’s leading communications service providers, network equipment manufacturers and webscale companies make sure their networks deliver. With the acquisition of Astellia, EXFO has emerged as a leading provider of network and subscriber intelligence, enabling mobile operators to drive service quality, maximize operational efficiency, reduce churn and develop revenues. Our real-time monitoring and troubleshooting solutions optimize networks end-to-end, from radio to core. We’re always looking for top talent to help us lead the way in a thriving industry with boundless opportunities.\n\nJob Summary\n\nProject: Cloud native product development\n\nEXFO product for 5G & 4G network monitoring, analysis & optimization is evolving towards cloud native architecture in order to enable full automation capability, ML/AI algorithms for network analysis and high scalability to address the needs of 5G networks for which EXFO is playing a very active role.\n\nYou will be a member of a scrum team focused on the implementation of radio optimization tool for mobile network operators. As part of this team, you will participate in the development of a microservice-based web application.\n\nYour responsibilities will also include contributing to the team’s efforts to evolve our CI/CD processes to improve the deployment and delivery workflow and the quality of our solutions.\n\nYou will benefit from a collaborative working environment and will be valued for leveraging your skills and experience to improve the team practices and processes.\n\nWhat We’re Looking For\n\nWe are looking for people with different skills to meet the needs of the different phases of the Product development cycle: SW development, testing, CI/CD Integration & deployment.\n\nAs a reference, below some of the technologies that would be used.\n\nFunction\n\nTechnology\n\nSw development\n\nJava, Go, Angular\n\nDevOps\n\nGitlab, Kubernetes, Docker\n\nDataprocessing\n\nElastic search\n\nQA\n\nManual testing, test automation (Robot Framework, Python\n\nWhat You’ll Do\n\n-  Participate in the development of new functionalities in the front-end and back-end of a web application  \n-  Implement unit tests  \n-  Participate in code reviews  \n-  Participate in the definition and evolution of the product architecture  \n-  Collaborate in the maintenance and evolution of CI/CD workflows  \n-  Elaborate software documentation and production documentation  \n-  Participate actively in scrum ceremonies and technical meetings and contribute to improve our engineering standards and processes  \n\n\n\nWhat We’re Looking For\n\nTechnical skills  \n\n-  Experience of front-end development: HTML, CSS/SCSS, JavaScript, TypeScript, Angular, Material Design  \n-  Experience of back-end development: Java, Go, REST  \n-  CI/CD tools knowledge like Gitlab  \n-  Virtualization experience is a plus (Docker)  \n-  Mobile network technologies knowledge like GSM/GPRS, UMTS and LTE is an added value  \n-  Knowledge of microservices and micro-frontend architectures  \n\n\n\nRequired aptitudes\n\nThe candidate should be teamwork and problem solving oriented, self-driver, proactive and dynamic. Organizational and analytical behaviors are also required values.\n\n-  Collaboration  \n-  Willingness to work in a highly team-oriented environment  \n-  Ability to analyze technical challenges and propose solutions with autonomy  \n-  Good written and verbal communication skills  \n-  Flexibility and adaptability to work in changing environments  \n-  Initiative to bring new ideas and propose improvements  \n-  Passion for good coding practices and high-quality code  \n\n\n\nMust have\n\nLanguage requirements: Fluent in English and Spanish\n\nEducation: BS/MS Telecommunications or Computer Science Master Degree or equivalent",
        "skills": [
          "Java",
          "Go",
          "Angular",
          "Kubernetes",
          "Docker",
          "Python",
          "HTML",
          "JavaScript",
          "TypeScript"
        ]
      },
      {
        "title": "Data Engineer",
        "company": "Kyndryl",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "97 people clicked apply",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "<p dir=\"ltr\">\nWho We Are\n\nAt Kyndryl, we design, build, manage and modernize the mission-critical technology systems that the world depends on every day. So why work at Kyndryl? We are always moving forward – always pushing ourselves to go further in our efforts to build a more equitable, inclusive world for our employees, our customers and our communities.\n\nThe Role\n\nWe are looking for a  Data Engineer  to join our dynamic and multifunctional team. In this role, you will participate in several projects across  multiple clouds, covering the entire data lifecycle.\n\nYou will work in a multi-client and multi-project environment, utilizing different technologies and managing data within the cloud ecosystem.\n\nResponsibilities:\n\n-Design and implement data platforms in multicloud environments.  \n-Manage data projects from collection to analysis and visualization.  \n-Collaborate with cross-functional teams to ensure data integration and flow.  \n-Evaluate and select appropriate technologies for each project.  \n-Provide technical support and training to end users.  \n\n\n\nWe Offer:\n\n-A dynamic and collaborative work environment.  \n-Opportunities for professional development and continuous training.  \n-Participation in innovative and high-impact projects.  \n\n\n\nIf you are interested in joining our team, we invite you to apply!\n\nWho You Are\n\nRequired Technical and Professional Expertise\n\n-Experience in building and maintaining large-scale data warehouses and ensuring data quality at scale. Strong understanding of Data services in one of: AWS, GCP, and/or Azure.  \n-Expertise in data mining, data storage and Extract-Transform-Load (ETL) processes.  \n-Python and SQL programing skills (Pyspark, Pandas, etc…)\n-Knowledge of BI tools such as Looker or PowerBI for data visualization and reporting.  \n-Communication skills.  \n-Spanish fluent or native.  \n\n\n\nPreferred Technical And Professional Experience\n\n-BS, MS, or PhD in Mathematics, Computer Science, or a related field.  \n-Experience in data pipelines development and tooling, e.g. Databricks, Cloudera, Teradata, Snowflake\n-Knowledge of DevOps/DataOps or CI/CD pipelines.  \n-Cloud platform certification.  \n\n\n\nBeing You\n\nDiversity is a whole lot more than what we look like or where we come from, it’s how we think and who we are. We welcome people of all cultures, backgrounds, and experiences. But we’re not doing it single-handily: Our Kyndryl Inclusion Networks are only one of many ways we create a workplace where all Kyndryls can find and provide support and advice. This dedication to welcoming everyone into our company means that Kyndryl gives you – and everyone next to you – the ability to bring your whole self to work, individually and collectively, and support the activation of our equitable culture. That’s the Kyndryl Way.\n\nWhat You Can Expect\n\nWith state-of-the-art resources and Fortune 100 clients, every day is an opportunity to innovate, build new capabilities, new relationships, new processes, and new value. Kyndryl cares about your well-being and prides itself on offering benefits that give you choice, reflect the diversity of our employees and support you and your family through the moments that matter – wherever you are in your life journey. Our employee learning programs give you access to the best learning in the industry to receive certifications, including Microsoft, Google, Amazon, Skillsoft, and many more. Through our company-wide volunteering and giving platform, you can donate, start fundraisers, volunteer, and search over 2 million non-profit organizations. At Kyndryl, we invest heavily in you, we want you to succeed so that together, we will all succeed.\n\nGet Referred!\n\nIf you know someone that works at Kyndryl, when asked ‘How Did You Hear About Us’ during the application process, select ‘Employee Referral’ and enter your contact's Kyndryl email address.",
        "skills": [
          "AWS",
          "GCP",
          "Azure",
          "SQL",
          "Pandas",
          "Snowflake"
        ]
      },
      {
        "title": "Software Embedded Engineer",
        "company": "Robert Walters",
        "location": "Barcelona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "30 people clicked apply",
        "salary": "",
        "posted": "2 weeks ago",
        "description": "<p dir=\"ltr\">\nDesde Robert Walters, estamos en búsqueda de un Software Embedded Engineer para una empresa cliente vinculado a la investigación y desarrollo de I+D, si tienes de 3 a 5 años de experiencia con C/C++, Python esta es tu oportunidad.  \n\nFunciones Principales:-Desarrollar aplicaciones escritorio y web para monitoreo de QKD\n-Optimizar los módulos vinculados a la base de datos para la gestión de claves criptográficas.\n-Implementar protocolos de comunicación.\n\nConocimientos:-5 años de experiencia en Software Embedded Linux\n-Dominio de C/C++, Python\n-Sistema operativo Linux, kernel y drivers\n-Inglés C1",
        "skills": [
          "Python"
        ]
      },
      {
        "title": "Ingeniero/a Navegación Robótica: HMI",
        "company": "Sener",
        "location": "Getxo, Basque Country, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "33 people clicked apply",
        "salary": "",
        "posted": "2 weeks ago",
        "description": "<p dir=\"ltr\">\nEn Sener deseamos incorporar en nuestro equipo a un/a Ingeniero/a Navegación - Robótica en nuestro centro de trabajo de Madrid.\n\nLa misión del puesto es el desarrollo de algoritmos de navegación enfocados a la visualización de la información obtenida de plataformas terrestres y aéreas en el puesto de mando y control.\n\nSomos una compañía de ingeniería pionera en el diseño de tecnología satelital y equipos para la exploración espacial. En Defensa abordamos el diseño y producción de equipos y sistemas, incluidos los no tripulados. Nuestra pasión por la precisión nos ha llevado a situarnos como colaboradores de confianza de las principales agencias espaciales, organismos gubernamentales y empresas.\n\nQué harás:\n\nEntre las funciones más relevantes que desempeñarás, destacan:\n\nAnálisis de requisitos.\n\nDiseño de algoritmos de ADAS, front-end y back-end en aplicaciones propietarias.\n\nDiseño e implementación de los algoritmos sobre equipos integrados en plataformas.\n\nPlanificación, ejecución y análisis de ensayos.\n\nDiseño e implementación de algoritmos en C++, Python y ROS 2 para SO Ubuntu.\n\nDiseño e implementación de aplicaciones e interfaces a través de la librería Qt\n\nDiseño e implementación de algoritmos de ayuda a la operación/conducción en sistemas autónomos o teleoperados sobre streaming de imagen de vídeo (ADAS)\n\nDiseño e implementación de aplicaciones y visualizaciones 3D para representar el entorno (Situation Awareness) que rodea a la plataforma\n\nDiseño e implementación de sistemas de Control de Misión y operaciones de Command&Control de plataforma\n\nDiseño e implementación de sistemas de tratamiento de mapas basados en librerías GIS\n\nQué esperamos de ti:\n\nBachiller/Formación Profesional Especialidad<em>:</em>  matemáticas, robótica, industrial, aeronáutico.\n\nExperiencia previa no requerida.\n\nInglés nivel alto.\n\nQué te ofrecemos:\n\nEstos son algunos de los beneficios de los que disfrutarás en Sener:\n\n-Intégrate en un equipo multidisciplinar y altamente cualificado participando en proyectos innovadores tecnológicamente a nivel internacional.  \n-Continua tu desarrollo profesional con nosotros y accede a un amplio abanico formativo (formación técnica, en habilidades, idiomas...).\n-Cuídate con nuestro programa de bienestar físico y emocional: deportes, talleres, servicio médico, fisioterapia, etc.\n-Optimiza tu salario con nuestro plan retributivo flexible (tarjeta de comida, seguro médico privado, tickets guardería...) y cuenta con nuestro seguro de vida y accidentes.  \n-¡Flexibiliza tu forma de trabajar! Disponemos de horario flexible, política de teletrabajo, espacios de coworking...\n-Portal de descuentos para ti y plan de acogida específico para nuestros empleados internacionales.  \n-Promovemos la igualdad de oportunidades, diversidad e inclusión de todas las personas y estamos certificados como Entidad Familiarmente Responsable (efr). Además, desde la Fundación Sener colaboramos en actividades que fomentan la búsqueda del conocimiento y contribuyen al desarrollo socialmente responsable de la ingeniería.\n\n\n\nSi te sientes identificado/a, te esperamos....¡En Sener queremos llegar tan lejos como quieras llegar tú!",
        "skills": [
          "C++",
          "Python"
        ]
      },
      {
        "title": "Rev-celerator Internship Programme: Python Software Engineer",
        "company": "Revolut",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Remote",
        "job_type": "Internship",
        "level": null,
        "applicants": "100 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 weeks ago",
        "description": "<p dir=\"ltr\">\nAbout Revolut\n\nPeople deserve more from their money. More visibility, more control, and more freedom. Since 2015, Revolut has been on a mission to deliver just that. Our powerhouse of products — including spending, saving, investing, exchanging, travelling, and more — help our 45+ million customers get more from their money every day.\n\nAs we continue our lightning-fast growth,‌ 2 things are essential to our success: our people and our culture. In recognition of our outstanding employee experience, we've been certified as a Great Place to Work™. So far, we have 10,000+ people working around the world, from our offices and remotely, to help us achieve our mission. And we're looking for more brilliant people. People who love building great products, redefining success, and turning the complexity of a chaotic world into the simplicity of a beautiful solution.\n\nAbout The Role\n\nOur Technology team isn’t just one of the best in the industry. It’s one of the best in the world. And we’re proud of it. It’s our driving force, our engine. From building a new financial backend to creating an innovative app that millions of people around the world will use, there’s nothing (and we mean nothing) our tech team can’t do.\n\nAbout The Rev-celerator Internship Programme 🎓\n\nThe Rev-celerator Internship programme is designed for top students seeking to make the most of their summer by working alongside industry professionals, taking on real-world challenges, and honing their skills. Embark on a paid, 3-month adventure where you'll gain hands-on experience, broaden your network, and seize the chance to learn, grow, and influence the future of finance. Join us for a summer of innovation and growth.\n\nYou may expect our Python Engineers to work on heavily regulated financial systems, but we love the unexpected. We’re better known internally for writing high-quality code and building complex novel solutions end to end.\n\nWe're looking for a Python Engineer Intern who’s looking to get involved and step into the future of finance through this career-boosting opportunity.\n\nUp for the challenge? Let’s get in touch 🚀\n\nWhat You’ll Be Doing\n\n-Helping our team to build APIs, ensuring they’re properly designed and can scale according to business needs\n-Supporting the creation of data pipelines to pull data from production services into our data warehouse, powering reporting, data analytics, and data science\n-Working within multidisciplinary squads to build new data models to provide this data to new flows and processes\n-Gaining commercial exposure to the most widely used OOPL, and expanding your SQL knowledge\n-Working alongside engineers with a deep understanding of distributed systems\n\n\n\nWhat You'll Need\n\n-A portfolio of multiple coding side projects or open source contributions\n-To currently be in penultimate year of a bachelor’s or master’s degree in a relevant field, such as computer science, maths, or physics\n-A proactive attitude\n-Love for problem-solving\n-Fluency in English\n-To be an ambitious, quick learner with a results-driven attitude\n-Excellent communication and organisational skills\n-To be able to travel to a Revolut office in your country of employment (hybrid working)\n-Full-time availability for the programme (summer 2025)\n\n\n\n<em>Building a global financial super app isn’t enough. Our Revoluters are a priority, and that’s why in 2021 we launched our inaugural D&I Framework, designed to help us thrive and grow everyday. We're not just doing this because it's the right thing to do. We’re doing it because we know that seeking out diverse talent and creating an inclusive workplace is the way to create exceptional, innovative products and services for our customers. That’s why we encourage applications from people with diverse backgrounds and experiences to join this multicultural, hard-working team.\n\nRefer to our <a class=\"postings-link\" href=\"<a class=\"app-aware-link \" target=\"_blank\" href=\"https://www.revolut.com/legal/data-privacy-for-candidates\" data-test-app-aware-link=\"\">https://www.revolut.com/legal/data-privacy-for-candidates</a>\">Data Privacy Statement for Candidates for details on our data handling practices during your application.</em>",
        "skills": [
          "Python",
          "SQL"
        ]
      },
      {
        "title": "DevOps Engineer",
        "company": "NTT DATA Europe & Latam",
        "location": "Madrid, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "100",
        "salary": "",
        "posted": "Reposted 2 weeks ago",
        "description": "<p dir=\"ltr\">\nNTT Data somos todas las personas que la formamos. Un equipo de más de 139.000 profesionales, tan diverso cómo diversos son los 50 países en los que estamos presentes y los diferentes sectores en los que desarrollamos nuestra actividad.  \n¿Nuestra misión?  Ofrecer soluciones tecnológicas, de negocio, estrategia, desarrollo y mantenimiento de aplicaciones, siendo un referente en consultoria. Todo gracias a la colaboración entre equipos, la calidad humana de nuestra gente y a que no nos conformamos con lo establecido, buscamos siempre la innovación que nos acerca al futuro.\nNuestra esencia nos ha llevado a la vanguardia de la tecnología, a romper paradigmas y a brindar las soluciones que realmente se corresponden a las necesidades de cada cliente. Nuestro talento nos ha hecho poder decir con orgullo que somos una de las 6 empresas TOP de tecnologías en el mundo.\nActualmente en nuestras oficinas de Madrid nos encontramos en un momento de crecimiento en nuestra área de arquitectura, donde estamos colaborando en proyectos para clientes de diferente sector (banca, administración pública, seguros...). Buscamos un perfil  DevOps Engineer con más de 3 años de experiencia.\n¿Cuáles serán tus funciones?· Dar soporte a las operaciones de desarrollo de software y despliegues en la nube· Instalar y administrar las herramientas y mecanismos necesarios para llevar a cabo las mejores prácticas de desarrollo e integración continua· Configurar y administrar las herramientas necesarias para el control de versiones y TDD· Configurar y preparar entornos locales, de desarrollo y producción para los diferentes equipos y proyectos· Liderar la instalación, configuración y despliegue del software y las herramientas necesarias para dar soporte a los proyectos\n¿Qué te ofrecemos?· Incorporarte a un equipo altamente especializado, cuyo objetivo es el impulso del cambio en la gestión de las Administraciones Públicas y la aportación de valor al cliente, basada en el conocimiento de su negocio· Establecer contigo un plan de carrera personalizado que te permita evolucionar profesionalmente alineado con tus intereses y objetivos· Acceder a la formación/certificación necesaria para estar al día, y diseñar y ofrecer servicios innovadores a nuestros clientes.· Personalizar la modalidad de trabajo (presencial, teletrabajo)· Contrato indefinido· Remuneración acorde a la experiencia y conocimientos aportados· Revisión anual de misión/salario/categoría\nEn NTT Data creemos que toda persona es única y diferente y por ello apostamos por una cultura inclusiva que reconoce y valora la diversidad. Trabajamos día a día para crear un entorno en el que podamos explorar, vivir y potenciar nuestra propia singularidad. #WeAreAllUnique #YouMakeUsUnique",
        "skills": []
      },
      {
        "title": "Programador PLC",
        "company": "Grupo Talents",
        "location": "Badalona, Catalonia, Spain",
        "workplace": "On-site",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "26 people clicked apply",
        "salary": "",
        "posted": "Reposted 6 days ago",
        "description": "<p dir=\"ltr\">\nGrupo Talents, pertenece a Grupo Linking Talents consultoría internacional de selección de personal especializada por sectores, con más de 15 años de experiencia y 14 divisiones expertas en su sector.\n\nActualmente estamos en búsqueda de un/a  Programador PLC  para incorporarse a una empresa de ingeniería puntera en su sector.\n\n¿Por qué unirse a esta empresa?\n\n-Podrás formar de una de ingeniería relacionada con el mundo del automóvil.  \n-Tendrás la oportunidad de trabajar con las mejores empresas europeas del sector automovilístico.  \n\n\n\nFunciones\n\n-Listar los requerimientos y asegurar su complimiento en el proyecto de software  \n-Analizar los requerimientos del cliente.  \n-Listar las tareas en las que se subdivide el proyecto de software.\n-Planificar la fecha de cumplimiento de las tareas y marcar el avance  \n-Presentar los informes de estado/avance de las tareas al responsable del departamento  \n-Informar a los responsables del departamento y del proyecto de las posibles desviaciones en el avance con la suficiente antelación para poder tomar medidas correctoras.  \n-Identificar peticiones del cliente que pueden ser consideradas como sobrecostes y valorar su impacto en el proyecto.  \n-Programación de PLC y HMI  \n-Redactar manuales de uso, funcionamiento, formación.  \n-Redactar documentación técnica asociada al proyecto.  \n-Puesta en marcha en casa del cliente  \n-Asistencia técnica en planta y/o asistencia telefónica en el caso de que el cliente/proyecto lo haya contratado.  \n-Tienes la posibilidad de un plan de carrera preestablecido con un importante crecimiento profesional.  \n\n\n\nUbicación: Badalona.\n\nSalario según experiencia.  \n\n-Automatización industrial sector ciencia.  \n-Buenos conocimientos de programación PLC:\n-SIEMENS (S7-400, S7-1500, …)  \n-SIEMENS Step 7  \n-SIEMENS TIA Portal  \n-SIEMENS Safety  \n-Rockwell RSLogix5000  \n-PILZ PAS4000, PSS3000  \n\n-Buenos conocimientos de programación HMI:\n-SIEMENS WinCC  \n-Wonderware Intouch  \n-SIEMENS WinCC OA (valorable)  \n\n-Se considerará favorablemente conocimientos en SCADA científico como WinCC OA.  \n-Experiencia previa en la puesta en marcha de las instalaciones en el sector automoción (puesta en marcha en casa del cliente) o ciencia.  \n-Gran capacidad analítica y de trabajo bajo presión. Capacidad para trabajar solo y para trabajar en equipo.  \n-Disponibilidad para viajar para las puestas en marcha en casa del cliente:\n-España  \n-Alemania  \n-Francia  \n-Suiza  \n-Etc.\n\n\n\n¿Qué ofrecemos?\n\n-Flexibilidad de entrada y salida,  \n-Contrato indefinido.  \n-Dietas además del salario.  \n-Plan de carrera.\n\n\n\nSi te atrae esta posición… ¡Queremos conocerte!",
        "skills": []
      },
      {
        "title": "Ingeniero/a Navegación Robótica: HMI",
        "company": "Sener",
        "location": "Tres Cantos, Community of Madrid, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "42 people clicked apply",
        "salary": "",
        "posted": "2 weeks ago",
        "description": "<p dir=\"ltr\">\nEn Sener deseamos incorporar en nuestro equipo a un/a Ingeniero/a Navegación - Robótica en nuestro centro de trabajo de Madrid.\n\nLa misión del puesto es el desarrollo de algoritmos de navegación enfocados a la visualización de la información obtenida de plataformas terrestres y aéreas en el puesto de mando y control.\n\nSomos una compañía de ingeniería pionera en el diseño de tecnología satelital y equipos para la exploración espacial. En Defensa abordamos el diseño y producción de equipos y sistemas, incluidos los no tripulados. Nuestra pasión por la precisión nos ha llevado a situarnos como colaboradores de confianza de las principales agencias espaciales, organismos gubernamentales y empresas.\n\nQué harás:\n\nEntre las funciones más relevantes que desempeñarás, destacan:\n\nAnálisis de requisitos.\n\nDiseño de algoritmos de ADAS, front-end y back-end en aplicaciones propietarias.\n\nDiseño e implementación de los algoritmos sobre equipos integrados en plataformas.\n\nPlanificación, ejecución y análisis de ensayos.\n\nDiseño e implementación de algoritmos en C++, Python y ROS 2 para SO Ubuntu.\n\nDiseño e implementación de aplicaciones e interfaces a través de la librería Qt\n\nDiseño e implementación de algoritmos de ayuda a la operación/conducción en sistemas autónomos o teleoperados sobre streaming de imagen de vídeo (ADAS)\n\nDiseño e implementación de aplicaciones y visualizaciones 3D para representar el entorno (Situation Awareness) que rodea a la plataforma\n\nDiseño e implementación de sistemas de Control de Misión y operaciones de Command&Control de plataforma\n\nDiseño e implementación de sistemas de tratamiento de mapas basados en librerías GIS\n\nQué esperamos de ti:\n\nBachiller/Formación Profesional Especialidad<em>:</em>  matemáticas, robótica, industrial, aeronáutico.\n\nExperiencia previa no requerida.\n\nInglés nivel alto.\n\nQué te ofrecemos:\n\nEstos son algunos de los beneficios de los que disfrutarás en Sener:\n\n-Intégrate en un equipo multidisciplinar y altamente cualificado participando en proyectos innovadores tecnológicamente a nivel internacional.  \n-Continua tu desarrollo profesional con nosotros y accede a un amplio abanico formativo (formación técnica, en habilidades, idiomas...).\n-Cuídate con nuestro programa de bienestar físico y emocional: deportes, talleres, servicio médico, fisioterapia, etc.\n-Optimiza tu salario con nuestro plan retributivo flexible (tarjeta de comida, seguro médico privado, tickets guardería...) y cuenta con nuestro seguro de vida y accidentes.  \n-¡Flexibiliza tu forma de trabajar! Disponemos de horario flexible, política de teletrabajo, espacios de coworking...\n-Portal de descuentos para ti y plan de acogida específico para nuestros empleados internacionales.  \n-Promovemos la igualdad de oportunidades, diversidad e inclusión de todas las personas y estamos certificados como Entidad Familiarmente Responsable (efr). Además, desde la Fundación Sener colaboramos en actividades que fomentan la búsqueda del conocimiento y contribuyen al desarrollo socialmente responsable de la ingeniería.\n\n\n\nSi te sientes identificado/a, te esperamos....¡En Sener queremos llegar tan lejos como quieras llegar tú!",
        "skills": [
          "C++",
          "Python"
        ]
      },
      {
        "title": "Site Reliability Engineer",
        "company": "LeoVegas Group",
        "location": "Málaga, Andalusia, Spain",
        "workplace": "Hybrid",
        "job_type": "Full-time",
        "level": "Entry level",
        "applicants": "64 people clicked apply",
        "salary": "",
        "posted": "Reposted 2 weeks ago",
        "description": "<p dir=\"ltr\">\nDescription\n\n<em>Position at LeoVegas Group\n\n</em>Site Reliability Engineering (SRE) is a critical part of our platform strategy. As a member of the SRE team, you will focus on providing technical expertise and support to our engineering teams to enable them to deliver high-quality software solutions efficiently. This includes helping teams with technical continuous effort, overcoming major technical hurdles, performance improvements, implementing system monitoring and building software with high availability.\n\nYOU WILL BE RESPONSIBLE FOR:\n\n-Help domain teams build software with high availability, resilience, and scalability to meet the needs of the business and customers.\n-Implement system monitoring to track system health, performance, and availability.\n-Drive performance improvements by analysing system metrics.\n-Contribute to the development of standards, guidelines, and best practices for software development, deployment, and operations.\n-Stay current with industry trends, emerging technologies, and best practices and share knowledge and insights with the broader engineering organisation.\n\n\n\nOUR SUCCESSFUL CANDIDATE WILL HAVE:\n\nESSENTIAL SKILLS:\n\n-Strong technical background with expertise in software development, including proficiency in one or more programming languages (e.g., Java, Python, JavaScript).\n-Familiarity with cloud computing platforms (e.g., AWS, Azure, GCP) and containerization technologies (e.g., Docker, Kubernetes).\n-Excellent problem-solving and analytical skills, with the ability to analyse complex technical issues and develop effective solutions.\n-Strong communication and collaboration skills, with the ability to work effectively in a cross-functional team environment and influence technical decision-making.\n-Good understanding of systems architecture.  \n-Experience with monitoring, logging, and observability tools such as Datadog and Grafana.\n\n\n\nNICE TO HAVES:\n\n-Experience from the iGaming industry is meriting\n\n\n\nWho We Are\n\nAt the core of LeoVegas Group, is Team Leo. Our culture is our foundation and is what enables us to innovate, build, and lead as we trailblaze our way through the igaming industry. We’re a team of over 1800 innovators, initiators, and groundbreakers working in a fast-paced and agile environment across 16 offices world-wide.\n\nBenefits\n\n-Hybrid work policy\n-4 weeks of Workation (T&C apply)\n-30 annual vacation days\n-Occupational Pension\n-5,000 SEK wellness contribution annually\n-Parental Leave Top-Up\n-Possibility to enrol in a private health care insurance for both you and your partner\n-1,500 SEK equipment allowance\n-Benify - benefits portal with many offers and discounts\n-We offer a relocation package with accommodation and flights.\n\n\n\nJOIN US!\n\nIn our pride, we like to empower our teammates to find their roar and run with their wildest ideas. We don’t wait around for things to happen, we pounce and make it happen!\n\nWould you be a good fit for the Leo Pride - give us a roar!\n\n**As our company working language is English we’d like to see your CV in English please**",
        "skills": [
          "Java",
          "Python",
          "AWS",
          "Azure",
          "Docker"
        ]
      }
    ],
    "companies_data": []
  }
]